Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Select one or many metrics to display, that will be displayed in the percentages of total. Percentage metrics will be calculated only from data within the row limit. You can use an aggregation function on a column or write custom SQL to create a percentage metric.
ru: Выберите один или много показателей для отображения, которые будут отображаться в процентах от общего числа.

source: Show summary
ru: Показать итоги

source: Show total aggregations of selected metrics. Note that row limit does not apply to the result.
ru: Показать общие итоговые значения выбранных показателей. Обратите внимание, что ограничение количества строк не применяется к результату.

source: Ordering
ru: Упорядочивание

source: Order results by selected columns
ru: Упорядочить результаты по выбранным столбцам

source: Sort descending
ru: Сортировка по убыванию

source: Server pagination
ru: Серверная пагинация

source: Enable server side pagination of results (experimental feature)
ru: Включить серверную пагинацию результатов (экспериментально)

source: Server Page Length
ru: Серверный размер страницы

source: Rows per page, 0 means no pagination
ru: Строчек на странице, 0 означает все строки

source: Query mode
ru: Режим запроса

source: Group By, Metrics or Percentage Metrics must have a value
ru: Измерения, Меры или Процентные меры должны иметь значение

source: You need to configure HTML sanitization to use CSS
ru: Вам необходимо настроить санитазацию HTML для использования CSS

source: CSS Styles
ru: CSS стили

source: CSS applied to the chart
ru: CSS, примененный к графику

source: Columns to group by on the columns
ru: Столбцы для группировки по столбцам

source: Rows
ru: Строки

source: Columns to group by on the rows
ru: Столбцы для группировки по строкам

source: Apply metrics on
ru: Применить меры к

source: Use metrics as a top level group for columns or for rows
ru: Используйте метрики в качестве группы верхнего уровня для столбцов или для рядов

source: Cell limit
ru: Лимит ячеек

source: Limits the number of cells that get retrieved.
ru: Ограничивает количество извлекаемых ячеек

source: Metric used to define how the top series are sorted if a series or cell limit is present. If undefined reverts to the first metric (where appropriate).
ru: Мера, используемая для определения того, как сортируются верхние категории, если присутствует ограничение по категории или ячейке. Если не определено, возвращается к первой мере (где это уместно).

source: Aggregation function
ru: Функция агрегирования

source: Aggregate function to apply when pivoting and computing the total rows and columns
ru: Агрегатная функция, применяемая для сводных таблиц и вычислении суммарных значений.

source: Show rows total
ru: Показать общий итог по строкам

source: Display row level total
ru: Отображать общий итог по строке

source: Show rows subtotal
ru: Показать Rows Subtotal

source: Display row level subtotal
ru: Показ уровня строки подтотальный

source: Show columns total
ru: Показать общий итог по столбцам

source: Display column level total
ru: Отображать общий итог по столбцу

source: Show columns subtotal
ru: Показать столбцы подтоталь

source: Display column level subtotal
ru: Попрос на уровне столбца подтотальный

source: Transpose pivot
ru: Транспонировать таблицу

source: Swap rows and columns
ru: Поменять местами строки и столбцы

source: Combine metrics
ru: Объединить меры

source: Display metrics side by side within each column, as opposed to each column being displayed side by side for each metric.
ru: Отображать меры рядом в каждом столбце, в отличие от отображения каждого столбца рядом для каждой меры.

source: Adaptive formatting dot ddmmyyyy
ru: %d.%m.%Y (гран.) | 14.01.2019

source: D3 time format for datetime columns
ru: Формат времени D3 для столбцов типа дата/время

source: Sort rows by
ru: Сортировка строк по

source: key a-z
ru: По алфавиту А-Я

source: key z-a
ru: По алфавиту Я-А

source: value ascending
ru: Значение по возрастанию

source: value descending
ru: Значение по убыванию

source: Change order of rows.
ru: Сменить порядок строк.

source: Available sorting modes:
ru: Доступные режимы сортировки:

source: By key: use row names as sorting key
ru: По ключу: использовать имена строк как ключ сортировки

source: By value: use metric values as sorting key
ru: По значению: использовать значения мер как ключ сортировки

source: Sort columns by
ru: Сортировать столбцы по

source: Change order of columns.
ru: Сменить порядок столбцов.

source: By key: use column names as sorting key
ru: По ключу: использовать имена столбцов как ключ сортировки

source: Rows subtotal position
ru: Расположение строк подытогов

source: Position of row level subtotal
ru: Расположение промежуточного итога на уровне строки

source: Columns subtotal position
ru: Расположение столбцов подытогов

source: Position of column level subtotal
ru: Расположение промежуточного итога на уровне столбца

source: Customize columns
ru: Настроить столбцы

source: Further customize how to display each column
ru: Дальнейшая настройка отображения каждого столбца

source: Apply conditional color formatting to metrics
ru: Применить условное цветовое форматирование к мерам

source: Used to summarize a set of data by grouping together multiple statistics along two axes. Examples: Sales numbers by region and month, tasks by status and assignee, active users by age and location. Not the most visually stunning visualization, but highly informative and versatile.
ru: Используется для обобщения набора данных путем группировки нескольких статистических данных по двум осям. Примеры: Количество продаж по регионам и месяцам, задачи по статусу и назначенному лицу, активные пользователи по возрасту и местоположению. Не самая наглядная визуализация, но очень информативная и универсальная.

source: Pivot Table
ru: Сводная таблица

source: metric
ru: мера

source: Subtotal
ru: Подытог

source: Total (%(aggregatorName)s)
ru: Итого (%(aggregatorName)s)

source: Value has own aggregation: %(aggregation)s
ru: Значение имеет собственную агрегацию: %(aggregation)s

source: Unknown input format
ru: Неизвестный формат ввода

source: Search %s records
ru: Поиск %s записей

source: page_size.show
ru: Показать

source: Show %s entries
ru: Показывать %s записей

source: page_size.entries
ru: записей

source: No matching records found
ru: не найдено соответствующих записей

source: Display all
ru: Отображать все

source: Main
ru: Основной

source: Select columns that will be displayed in the table. You can multiselect columns.
ru: Выберите столбцы, которые будут отображаться в таблице.

source: Shift + Click to sort by multiple columns
ru: Shift + Нажать для сортировки по нескольким столбцам

source: Summary
ru: Итого

source: Display
ru: Отображение

source: Number formatting
ru: Форматирование чисел

source: Timestamp format
ru: Формат даты и времени

source: Page length
ru: Размер страницы

source: Search box
ru: Строка поиска

source: Whether to include a client-side search box
ru: Отображение строки поиска

source: Allow columns to be rearranged
ru: Разрешить смену столбцов местами

source: Allow end user to drag-and-drop column headers to rearrange them. Note their changes won't persist for the next time they open the chart.
ru: Разрешить конечному пользователю перемещать столбцы, удерживая их заголовки. Заметьте, такие изменения будут нейтрализованы при следующем обращении к дашборду.

source: Render columns in HTML format
ru: Рендеринговые столбцы в формате HTML

source: Render data in HTML format if applicable.
ru: Данные рендеринга в формате HTML, если применимо.

source: Visual formatting
ru: Визуальное форматирование

source: Show Cell bars
ru: Показать сотовые стержни

source: Whether to display a bar chart background in table columns
ru: Отображать гистограмм в колонках таблицы

source: Align +/-
ru: Выровнять +/-

source: Whether to align background charts with both positive and negative values at 0
ru: Совместить ли фоновые диаграммы как с положительными, так и с отрицательными значениями при 0

source: add colors to cell bars for +/-
ru: добавьте цвета в стержни для /-

source: Whether to colorize numeric values by whether they are positive or negative
ru: окрасить численные значения на то, являются ли они положительными или отрицательными

source: basic conditional formatting
ru: основное условное форматирование

source: This will be applied to the whole table. Arrows (↑ and ↓) will be added to main columns for increase and decrease. Basic conditional formatting can be overwritten by conditional formatting below.
ru: Это будет применено ко всей таблице.

source: color type
ru: тип цвета

source: Custom Conditional Formatting
ru: Пользовательский условный форматирование

source: Green for increase, red for decrease
ru: Зеленый для увеличения, красный для уменьшения

source: Red for increase, green for decrease
ru: красный для увеличения, зеленый для уменьшения

source: Apply conditional color formatting to numeric columns
ru: Применить условное цветовое форматирование к столбцам

source: Classic row-by-column spreadsheet like view of a dataset. Use tables to showcase a view into the underlying data or to show aggregated metrics.
ru: Классическое представление таблицы. Используйте таблицы для демонстрации отображения исходных или агрегированных данных.

source: Show
ru: Показать

source: entries
ru: записи

source: Minimum Font Size
ru: Минимальный размер шрифта

source: Font size for the smallest value in the list
ru: Размер шрифта для наименьшего значения в списке

source: Maximum Font Size
ru: Максимальный размер шрифта

source: Font size for the biggest value in the list
ru: Размер шрифта для наибольшего значения в списке

source: Word Rotation
ru: Поворот текста

source: random
ru: случайно

source: square
ru: квадрат

source: Rotation to apply to words in the cloud
ru: Вращение для применения к словам в облаке

source: Visualizes the words in a column that appear the most often. Bigger font corresponds to higher frequency.
ru: Визуализирует слова в столбце, которые появляются чаще всего. Более крупный шрифт соответствует более высокой частоте

source: Word Cloud
ru: Облако слов

source: You cannot edit titles from Dataset
ru: Вы не можете редактировать заголовки из Датасета

source: Editing filter set:
ru: Редактирование набора фильтров:

source: Cancel
ru: Отмена

source: Filter set with this name already exists
ru: Набор фильтров с этим именем уже существует

source: Filter set already exists
ru: Набор фильтров уже существует

source: Save
ru: Сохранить

source: This filter set is identical to: "%s"
ru: Этот набор фильтров идентичен "%s"

source: Edit
ru: Редактировать

source: The primary set of filters will be applied automatically
ru: Основной набор фильтров будет применяться автоматически

source: Set as primary
ru: Установить основным

source: Remove invalid filters
ru: Удалить недействующие фильтры

source: Rebuild
ru: Обновить

source: Delete
ru: Удалить

source: Filters (%d)
ru: Фильтры (%d)

source: This filter doesn't exist in dashboard. It will not be applied.
ru: Этот фильтр не существует в дашборде. Он не будет применен.

source: Filter metadata changed in dashboard. It will not be applied.
ru: Метаданные фильтра изменились в дашборде. Они не будут применены.

source: Please filter set name
ru: Введите имя набора фильтров

source: Create
ru: Создать

source: Create filter set
ru: Создать набор фильтров

source: New filter set
ru: Новый набор фильтров

source: Please apply filter changes
ru: Пожалуйста, примените изменения фильтров

source: Unknown value
ru: Неизвестная ошибка

source: Service temporarily unavailable
ru: Сервис временно недоступен

source: Sorry, something went wrong. We are fixing the mistake now. Try again later.
ru: Извините, что-то пошло не так. Сейчас мы исправляем ошибку. Повторите попытку позже.

source: Edit formatter
ru: Редактировать форматер

source: Add new formatter
ru: Добавить форматирование

source: Add new color formatter
ru: Добавить цветовое форматирование

source: Color scheme
ru: Цветовая схема

source: Color
ru: Цвет

source: Apply
ru: Применить

source: success
ru: успех

source: alert
ru: оповещение

source: error
ru: ошибка

source: success dark
ru: Успех темный

source: alert dark
ru: бенжетная тьма

source: error dark
ru: Ошибка темная

source: This value should be smaller than the right target value
ru: Это значение должно быть больше чем правое целевое значение

source: This value should be greater than the left target value
ru: Это значение должно быть больше чем левое целевое значение

source: Required
ru: Обязательно

source: Operator
ru: Оператор

source: Left value
ru: Левое значение

source: Right value
ru: Правое значение

source: Target value
ru: Целевое значение

source: Select column
ru: Выберите столбец

source: Message
ru: Сообщение

source: Not assigned
ru: Не назначено

source: Create new team
ru: Создайте новую команду

source: Create team
ru: Создать команду

source: User from
ru: Пользователь из

source: slug
ru: читаемый URL

source: New team will be created
ru: Будет создана новая команда

source: User will update is on the next step
ru: Пользователь будет обновлен на следующем шаге

source: Next
ru: Следующий

source: Team Name
ru: Название команды

source: Too short
ru: Слишком короткий

source: Too long
ru: Слишком длинное

source: Full Team Name
ru: Полное название команды

source: enter team name
ru: Введите название команды

source: You are welcome to Superset
ru: Добро пожаловать в Суперсет

source: Tell us more about yourself
ru: Расскажите нам о себе

source: All the data is from Dodo IS. Please enter your team or role. It helps to proceed your request.
ru: Все данные взяты из Dodo IS. Пожалуйста, укажите свою команду или должность. Это поможет выполнить ваш запрос.

source: First name
ru: Имя

source: Last name
ru: Фамилия

source: Role in Dodo Brands
ru: Роль в Dodo Brands

source: Please input your role in Dodo Brands!
ru: Пожалуйста, укажите вашу роль в Dodo Brands!

source: Minimum 3 characters
ru: Минимум 3 символа

source: Maximum 30 characters
ru: Максимум 30 символов

source: Next step
ru: Следующий шаг

source: You request created
ru: Ваша заявка создана

source: Request will be proceed by administrators. You can see your requests in
ru: Заявка будет обработана администраторами. Вы можете увидеть ваши заявки в

source: profile
ru: профиле

source: Tell us why you are here
ru: Расскажите нам, почему вы здесь

source: Are you a franchisee or from a Managing Company?
ru: Вы являетесь франчайзи или работаете в управляющей компании?

source: Create of find your team
ru: Создайте или найдите вашу команду

source: Select `C_LEVEL` if you are a ‘C level’ in DODO
ru: Выберите `C_LEVEL` если вы ‘C level’ в ДОДО

source: Your team name is
ru: Название вашей команды:

source: Finish onboarding
ru: Завершить онбординг

source: All C-level people please select ‘c_level’
ru: Все люди C-уровня, пожалуйста, выберите «C_LEVEL»

source: your team
ru: ваша команда

source: Which use cases are you interested in using Superset for?
ru: Как вы планируете использовать Суперсет?

source: readonly
ru: Анализ данных

source: Check available dashboards. Gather insights from charts inside a dashboard
ru: Проверка доступных дашбордов. Получение информации из графиков внутри дашбордов

source: Create dashboards and charts
ru: Создание дашбордов и графиков

source: Create dashboards. Create charts
ru: Создание дашбордов, создание графиков

source: Create datasets and use SQL Lab
ru: Создание датасетов и использование SQL Lab

source: Create datasets. Use SQL Lab for your Ad-hoc queries
ru: Создание датасетов. Использование SQL Lab для Ad-hoc запросов

source: Based on your selection, your roles are:
ru: Вы выбрали следующие роли

source: An error occurred while checking user's team
ru: Произошла ошибка при получении команды пользователя.

source: Team search
ru: Поиск команды

source: Existing team
ru: Существующая команда

source: Check information and update user
ru: Проверьте информацию и обновите пользователя

source: If this is C-level
ru: Если запрос от C-level

source: give: c_level
ru: даем: c_level

source: If it's a franchisee
ru: Если это френчайзи

source: Give: fr_{last name}_{first name}
ru: Даем: fr_{фамилия}_{имя}

source: If from management company
ru: Если это сотрудник УК

source: Give: by the name of the team
ru: Даем: по названию команды

source: Team has been created successfully.
ru: Команда была создана успешно.

source: An error occurred while creating the team
ru: Произошла ошибка при создании команды

source: Request closed successfully.
ru: Запрос успешно закрыт.

source: An error occurred while closing the request
ru: Произошла ошибка при закрытии запроса

source: Onboarding request
ru: Заявка на онбоардинг

source: email
ru: электронная почта

source: Current roles
ru: Текущие роли

source: Requested roles
ru: Запрашиваемые роли

source: Closed
ru: Закрыта

source: Request date
ru: Дата заявки

source: Update date
ru: Дата обновления

source: Check available dashboards
ru: Проверка доступных дашбордов

source: Gather insights from charts inside a dashboard
ru: Анализ графиков в дашбордах

source: Create datasets
ru: Создание датасетов

source: Use SQL Lab for your Ad-hoc queries
ru: Использование SQL Lab для произвольных запросов

source: Create dashboards
ru: Создание дашбордов

source: Create charts
ru: Создание графиков

source: User update
ru: Обновить пользователя

source: Apply roles and link to a team
ru: Применить роли и добавить в команду

source: New Roles
ru: Новые роли

source: Email
ru: Электронная почта

source: Actions
ru: Действия

source: Requests
ru: Заявки

source: All
ru: Все

source: An error occurred while fetching statements user values: %s
ru: Произошла ошибка при извлечении операторов операторов: %s

source: Any
ru: Любой

source: Franchisee
ru: Франчайзи

source: Members count
ru: Количество участников

source: Add members
ru: Добавить участников

source: select member
ru: выберите участник

source: Members
ru: Участники

source: Username
ru: Имя пользователя

source: Created on
ru: Дата создания

source: Login count
ru: Количество логинов

source: Last login date
ru: Дата последнего логина

source: REMOVE FROM TEAM
ru: Удалить из команды

source: Member added successfully.
ru: Участник успешно добавлен.

source: Member removed successfully.
ru: участник успешно удален.

source: An error occurred while adding user:
ru: Произошла ошибка при добавлении пользователя:

source: An error occurred while removing user:
ru: Произошла ошибка при удалении пользователя:

source: Teams
ru: Команды

source: offline
ru: офлайн

source: failed
ru: не удалось

source: pending
ru: В ожидании

source: fetching
ru: Привлечение

source: running
ru: бег

source: stopped
ru: остановлен

source: The query couldn't be loaded
ru: Запрос невозможно загрузить

source: Your query has been scheduled. To see details of your query, navigate to Saved queries
ru: Запрос был запланирован. Чтобы посмотреть детали запроса, перейдите в Сохраненные запросы

source: Your query could not be scheduled
ru: Не удалось запланировать ваш запрос

source: Failed at retrieving results
ru: Невозможно выполнить запрос

source: Query was stopped.
ru: Запрос прерван

source: Failed at stopping query. %s
ru: Не удалось остановить запрос. %s

source: Unable to migrate table schema state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ru: Не удается перенести состояние схемы таблицы на сервер. Суперсет повторит попытку позже. Пожалуйста, свяжитесь с вашим администратором, если эта проблема не устранена.

source: Unable to migrate query state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ru: Не удается перенести состояние запроса на сервер. Суперсет повторит попытку позже. Пожалуйста, свяжитесь с вашим администратором, если эта проблема не устранена.

source: Unable to migrate query editor state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ru: Не удается перенести состояние редактора запроса на сервер. Суперсет повторит попытку позже. Пожалуйста, свяжитесь с вашим администратором, если эта проблема не устранена.

source: -- Note: Unless you save your query, these tabs will NOT persist if you clear your cookies or change browsers.
ru: — Примечание. Если вы не сохраните свой запрос, эти вкладки не будут сохраняться, если вы очистите свои файлы cookie или измените браузеры.

source: Copy of %s
ru: Копия %s

source: An error occurred while fetching tab state
ru: Произошла ошибка при получении данных вкладки

source: An error occurred while removing query. Please contact your administrator.
ru: Произошла ошибка при удалении запроса. Пожалуйста, свяжитесь с администратором.

source: Your query could not be saved
ru: Не удалось сохранить ваш запрос

source: Your query was not properly saved
ru: Ваш запрос не был сохранен должным образом

source: Your query was saved
ru: Ваш запрос был сохранен

source: Your query was updated
ru: Ваш запрос был сохранен

source: Your query could not be updated
ru: Не удалось обновить ваш запрос

source: An error occurred while storing your query in the backend. To avoid losing your changes, please save your query using the "Save Query" button.
ru: Произошла ошибка при сохранении запроса на сервере. Чтобы сохранить изменения, пожалуйста, сохраните ваш запрос через кнопку "Сохранить как".

source: An error occurred while fetching table metadata. Please contact your administrator.
ru: Произошла ошибка при получении метаданных таблицы. Пожалуйста, свяжитесь с администратором.

source: An error occurred while expanding the table schema. Please contact your administrator.
ru: Произошла ошибка при разворачивании схемы. Пожалуйста, свяжитесь с администратором.

source: An error occurred while collapsing the table schema. Please contact your administrator.
ru: Произошла ошибка при сворачивании схемы. Пожалуйста, свяжитесь с администратором.

source: An error occurred while removing the table schema. Please contact your administrator.
ru: Произошла ошибка при удалении схемы. Пожалуйста, свяжитесь с администратором.

source: Shared query
ru: Общедоступный запрос

source: The datasource couldn't be loaded
ru: Невозможно загрузить источник данных

source: An error occurred while creating the data source
ru: Произошла ошибка при создании источника данных

source: An error occurred while fetching function names.
ru: Произошла ошибка при получении имен функций

source: SQL Lab uses your browser's local storage to store queries and results. Currently, you are using %(currentUsage)s KB out of %(maxStorage)d KB storage space. To keep SQL Lab from crashing, please delete some query tabs. You can re-access these queries by using the Save feature before you delete the tab. Note that you will need to close other SQL Lab windows before you do this.
ru: SQL Lab использует локальное хранилище вашего браузера для хранения запросов и результатов. SQL Lab использует локальное хранилище вашего браузера для хранения запросов и результатов. В настоящее время вы используете %(currentUsage)s КБ из %(maxStorage)d КБ дискового пространства. Чтобы предотвратить сбой Лаборатории SQL, пожалуйста, удалите некоторые вкладки запросов. Вы можете повторно получить доступ к этим запросам, используя функцию сохранения перед удалением вкладки. Обратите внимание, что перед этим вам нужно будет закрыть другие окна Лаборатории SQL.

source: Primary key
ru: Первичный ключ

source: Foreign key
ru: Внешний ключ

source: Index
ru: Индекс

source: Estimate selected query cost
ru: Оценить стоимость выбранного запроса

source: Estimate cost
ru: Оценить стоимость запроса
