Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Cost estimate
ru: Прогноз затрат

source: Creating a data source and creating a new tab
ru: Создание источника данных и добавление новой вкладки

source: Explore the result set in the data exploration view
ru: Создать новый график на основе этих данных

source: explore
ru: исследовать

source: Create Chart
ru: Создать график

source: Source SQL
ru: Исходный SQL

source: Executed SQL
ru: Исполненный SQL

source: Run query
ru: Выполнить запрос

source: Run current query
ru: Запустите текущий запрос

source: Stop query
ru: Остановить запрос

source: New tab
ru: Новая вкладка

source: Previous Line
ru: Предыдущая строка

source: Format SQL
ru: Отформатировать SQL

source: Switch to the previous tab
ru: Переключиться на предыдущую вкладку

source: Switch to the next tab
ru: Переключиться на предыдущую вкладку

source: Find
ru: Найти

source: Replace
ru: Заменить

source: Keyboard shortcuts
ru: Горячие клавиши

source: Run a query to display query history
ru: Выполните запрос для отображения истории

source: LIMIT
ru: ОГРАНИЧЕНИЕ

source: State
ru: Состояние

source: Started
ru: Начато

source: Duration
ru: Продолжительность

source: Results
ru: Результаты

source: Success
ru: Успешно

source: Failed
ru: Ошибка

source: Running
ru: Выполняется

source: Fetching
ru: Получение данных

source: Offline
ru: Оффлайн

source: Scheduled
ru: Запланировано

source: Unknown Status
ru: Неизвестный статус

source: View
ru: Показать

source: Data preview
ru: Предпросмотр данных

source: Overwrite text in the editor with a query on this table
ru: Вставить этот запрос в редактор SQL

source: Run query in a new tab
ru: Выполнить запрос на новой вкладке

source: Remove query from log
ru: Удалить запрос из истории

source: Unable to create chart without a query id.
ru: Невозможно создать график без идентификатора запроса.

source: Save & Explore
ru: Сохранить и исследовать

source: Overwrite & Explore
ru: Перезаписать и исследовать

source: Save this query as a virtual dataset to continue exploring
ru: Сохраните данный запрос как виртуальный датасет для создания графика

source: Download to CSV
ru: Сохранить в CSV

source: Copy to Clipboard
ru: Скопировать в буфер обмена

source: Filter results
ru: Фильтровать результаты

source: The number of results displayed is limited to %(rows)d by the configuration DISPLAY_MAX_ROW. Please add additional limits/filters or download to csv to see more rows up to the %(limit)d limit.
ru: Количество отображаемых результатов ограничено %(rows)d с помощью конфигурации DISPLAY_MAX_ROW. Пожалуйста, добавьте дополнительные ограничения/фильтры или загрузите в csv, чтобы увидеть больше строк вплоть до %(limit)d.

source: The number of results displayed is limited to %(rows)d. Please add additional limits/filters, download to csv, or contact an admin to see more rows up to the %(limit)d limit.
ru: Количество отображаемых результатов ограничено %(rows)d. Пожалуйста, добавьте дополнительные ограничения/фильтры или загрузите в csv, чтобы увидеть больше строк до предела %(limit)d."

source: The number of rows displayed is limited to %(rows)d by the query
ru: Количество отображаемых строк ограничено: не более %(rows)d.

source: The number of rows displayed is limited to %(rows)d by the limit dropdown.
ru: Количество отображаемых строк ограничено: не более %(rows)d.

source: The number of rows displayed is limited to %(rows)d by the query and limit dropdown.
ru: Количество отображаемых строк ограничено: не более %(rows)d.

source: %(rows)d rows returned
ru: Получено строк: %(rows)d

source: The number of rows displayed is limited to %(rows)d by the dropdown.
ru: Количество отображаемых строк ограничено %(rows)d на раскрывающемся списке.

source: %s row
ru: %s ряд

source: Track job
ru: Отслеживать работу

source: See query details
ru: Показать детали запроса

source: Query was stopped
ru: Запрос прерван

source: Database error
ru: Ошибка базы данных

source: Retry fetching results
ru: Повторные результаты получения результатов

source: was created
ru: создан(а)

source: Query in a new tab
ru: Запрос в отдельной вкладке

source: The query returned no data
ru: Запрос не вернул данных

source: Fetch data preview
ru: Получить данные для просмотра

source: Refetch results
ru: Выполнить запрос повторно

source: Stop
ru: Стоп

source: Run selection
ru: Выполнить выбранное

source: Run
ru: Выполнить

source: Stop running (Ctrl + x)
ru: Остановить выполнение (CTRL + x)

source: Stop running (Ctrl + e)
ru: Остановить выполнение (CTRL + e)

source: Run query (Ctrl + Return)
ru: Выполнить запрос (Ctrl + Enter)

source: Untitled Dataset
ru: Безымянный датасет

source: An error occurred saving dataset
ru: Произошла ошибка при сохранении датасета

source: Save or Overwrite Dataset
ru: Сохранить или перезаписать датасет

source: Back
ru: Назад

source: Save as new
ru: Сохранить как новый

source: Overwrite existing
ru: Перезаписать существующий

source: Select or type dataset name
ru: Выберите/введите имя датасета

source: Existing dataset
ru: Существующий датасет

source: Are you sure you want to overwrite this dataset?
ru: Вы уверены, что хотите перезаписать этот датасет?

source: Undefined
ru: Не определено

source: Save dataset
ru: Сохранить датасет

source: Save as
ru: Сохранить как

source: Save query
ru: Сохранить запрос

source: Update
ru: Обновить

source: Label for your query
ru: Метка для вашего запроса

source: Write a description for your query
ru: Заполните описание к вашему запросу

source: Submit
ru: Отправить

source: Schedule query
ru: Сохранить запрос

source: Schedule
ru: Расписание

source: There was an error with your request
ru: Произошла ошибка с вашим запросом

source: Please save the query to enable sharing
ru: Пожалуйста, сохраните запрос, чтобы включить функцию "поделиться"

source: Copy query link to your clipboard
ru: Скопировать ссылку на запрос в буфер обмена

source: Save the query to enable this feature
ru: Сохраните запрос для включения этой опции

source: Copy link
ru: Скопировать ссылку

source: Run a query to display results
ru: Выполните запрос для отображения результатов

source: No stored results found, you need to re-run your query
ru: Не найдены сохраненные результаты, необходимо повторно выполнить запрос

source: Query history
ru: История запросов

source: Preview: `%s`
ru: Предпросмотр «%s»

source: Schedule the query periodically
ru: Запланировать периодическое выполнение запроса

source: You must run the query successfully first
ru: Сначала необходимо успешно выполнить запрос

source: Render HTML
ru: Отрисовать HTML

source: Autocomplete
ru: Автозаполнение

source: The database that was used to generate this query could not be found
ru: база данных, которая использовалась для генерации этого запроса, не может быть найдена

source: Choose one of the available databases on the left panel.
ru: Выберите одну из доступных баз данных из панели слева.

source: Estimate the cost before running a query
ru: Спрогнозировать стоимость до выполнения запроса

source: Specify name to CREATE VIEW AS schema in: public
ru: Укажите имя нового представления для CREATE VIEW AS

source: Specify name to CREATE TABLE AS schema in: public
ru: Укажите имя новой таблицы для CREATE TABLE AS

source: Select a database to write a query
ru: Выберите базу данных для написания запроса

source: Choose one of the available databases from the panel on the left.
ru: Выберите одну из доступных баз данных из панели слева.

source: Collapse table preview
ru: Свернуть предпросмотр таблицы

source: Expand table preview
ru: Расширить предпросмотр таблицы

source: Reset state
ru: Сбросить текущее состояние

source: Enter a new title for the tab
ru: Введите новое название для вкладки

source: Close tab
ru: Закрыть вкладку

source: Rename tab
ru: Переименовать вкладку

source: Expand tool bar
ru: Показать панель инструментов

source: Hide tool bar
ru: Скрыть панель инструментов

source: Close all other tabs
ru: Закрыть остальные вкладки

source: Duplicate tab
ru: Дублировать вкладку

source: Add a new tab
ru: Новая вкладка

source: New tab (Ctrl + q)
ru: Новая вкладка (CTRL + Q)

source: New tab (Ctrl + t)
ru: Новая вкладка (CTRL + T)

source: Add a new tab to create SQL Query
ru: Откройте новую вкладку для создания SQL запроса

source: An error occurred while fetching table metadata
ru: Произошла ошибка при получении метаданных из таблицы

source: Copy partition query to clipboard
ru: Скопировать часть запроса в буфер обмена

source: latest partition:
ru: последний раздел:

source: Keys for table
ru: Ключи для таблицы

source: View keys & indexes (%s)
ru: Показать ключи и индексы (%s)

source: Original table column order
ru: Расположение столбцов как в исходной таблице

source: Sort columns alphabetically
ru: Отсортировать столбцы в алфавитном порядке

source: Copy SELECT statement to the clipboard
ru: Скопировать выражение SELECT в буфер обмена

source: Show CREATE VIEW statement
ru: Показать выражение CREATE VIEW

source: CREATE VIEW statement
ru: Выражение CREATE VIEW

source: Remove table preview
ru: Убрать предпросмотр таблицы

source: Assign a set of parameters as
ru: Задайте набор параметров в формате

source: below (example:
ru: ниже (пример:

source: ), and they become available in your SQL (example:
ru: ), и они станут доступны в ваших SQL запросах (пример:

source: by using
ru: , используя

source: Jinja templating
ru: Шаблонизацию Jinja

source: syntax.
ru: Синтаксис.

source: Edit template parameters
ru: Редактировать параметры шаблонизации Jinja

source: Parameters
ru: Параметры

source: Invalid JSON
ru: Недопустимый формат JSON

source: Untitled query
ru: Безымянный запрос

source: Control
ru: Элемент

source: Before
ru: До

source: After
ru: После

source: Click to see difference
ru: Нажмите для просмотра изменений

source: Altered
ru: Измененено

source: Chart changes
ru: Изменения графика

source: Modified by: %s
ru: Модифицировано: %s

source: Loaded data cached
ru: Данные загружены в кэш

source: Loaded from cache
ru: Загружено из кэша

source: Click to force-refresh
ru: Нажмите для принудительного обновления

source: Cached
ru: Добавлено в кэш

source: Waiting on %s
ru: Ожидаем %s

source: Waiting on database...
ru: Ожидаем базу данных...

source: Add required control values to preview chart
ru: Добавьте обязательные значения для предпросмотра графика

source: Your chart is ready to go!
ru: Ваш график готов!

source: Click on "Create chart" button in the control panel on the left to preview a visualization or
ru: Нажмите на кнопку "Создать график" на панели управления слева для просмотра графика или

source: click here
ru: нажмите сюда

source: No results were returned for this query
ru: Не было получено данных по этому запросу

source: Make sure that the controls are configured properly and the datasource contains data for the selected time range
ru: Убедитесь, что настройки графика верно сконфигурированы и источник данных содержит данные для выбранного временного интервала

source: An error occurred while loading the SQL
ru: Произошла ошибка при загрузке SQL

source: Sorry, an error occurred
ru: Извините, произошла ошибка

source: Updating chart was stopped
ru: Обновление графика остановлено

source: An error occurred while rendering the visualization: %s
ru: Произошла ошибка при построении графика: %s

source: Network error.
ru: Ошибка сети.

source: Cross-filter will be applied to all of the charts that use this dataset.
ru: Cross Filter будет применен ко всем диаграммам, которые используют этот набор данных.

source: You can also just click on the chart to apply cross-filter.
ru: Вы также можете просто нажать на диаграмму, чтобы применить кроссфильтр.

source: Cross-filtering is not enabled for this dashboard.
ru: Кроссфильтр не включена для этой панели приборной панели.

source: This visualization type does not support cross-filtering.
ru: Этот тип визуализации не поддерживает перекрестную фильтрацию.

source: You can't apply cross-filter on this data point.
ru: Вы не можете применить кроссфильтр в этой точке данных.

source: Remove cross-filter
ru: Снимите кроссфильтр

source: Add cross-filter
ru: Добавить кроссфильтр

source: Failed to load dimensions for drill by
ru: не удалось загрузить размеры для тренировки

source: Drill by is not yet supported for this chart type
ru: Drill By еще не поддерживается для этого типа диаграммы

source: Drill by is not available for this data point
ru: Drill By не доступна для этой точки данных

source: Search columns
ru: Поисковые столбцы

source: No columns found
ru: Колонны не найдены

source: Failed to generate chart edit URL
ru: Не удалось сгенерировать URL с редактированием диаграммы

source: You do not have sufficient permissions to edit the chart
ru: У вас нет достаточных разрешений для редактирования диаграммы

source: Edit chart
ru: Редактировать график

source: Close
ru: Закрыть

source: Failed to load chart data.
ru: Не удалось загрузить данные графика.

source: There was an error loading the chart data
ru: Была ошибка, загружающая данные диаграммы

source: Results %s
ru: Результаты %s

source: Drill to detail is disabled for this database. Change the database settings to enable it.
ru: Drill to detail отключен для этой базы данных.

source: Drill to detail is disabled because this chart does not group data by dimension value.
ru: Drill to detail отключен, потому что эта диаграмма не группирует данные по значению измерения.

source: Right-click on a dimension value to drill to detail by that value.
ru: Щелкните правой кнопкой мыши по значению измерения, чтобы тренировать, чтобы детализировать это значение.

source: Drill to detail by value is not yet supported for this chart type.
ru: Drill to detail по значению еще не поддерживается для этого типа графика.

source: Formatting
ru: Форматирование

source: Formatted value
ru: Форматированное значение

source: No rows were returned for this dataset
ru: Не было получено данных для этого датасета

source: Reload
ru: Обновить

source: Copy
ru: Копировать

source: Copy to clipboard
ru: Скопировать в буфер обмена

source: Copied to clipboard!
ru: Скопировано в буфер обмена!

source: Sorry, your browser does not support copying. Use Ctrl / Cmd + C!
ru: Извините, Ваш браузер не поддерживание копирование. Используйте сочетание клавиш [CTRL + C] для WIN или [CMD + C] для MAC!

source: every
ru: каждые

source: every month
ru: каждый месяц

source: every day of the month
ru: каждый день месяца

source: day of the month
ru: день месяца

source: every day of the week
ru: каждый день недели

source: day of the week
ru: день недели

source: every hour
ru: каждый час

source: every minute
ru: каждая минута

source: minute
ru: минута

source: reboot
ru: обновить

source: Every
ru: Каждый(ая)

source: in
ru: в

source: on
ru: По

source: or
ru: или

source: at
ru: в

source: minute(s)
ru: минут

source: Invalid cron expression
ru: Недопустимое CRON выражение

source: Clear
ru: Очистить

source: Sunday
ru: Воскресенье

source: Monday
ru: Понедельник

source: Tuesday
ru: Вторник

source: Wednesday
ru: Среда

source: Thursday
ru: Четверг

source: Friday
ru: Пятница

source: Saturday
ru: Суббота

source: January
ru: Январь

source: February
ru: Февраль

source: March
ru: Март

source: April
ru: Апрель

source: May
ru: Май

source: June
ru: Июнь

source: July
ru: Июль

source: August
ru: Август

source: September
ru: Сентябрь

source: October
ru: Октябрь

source: November
ru: Ноябрь

source: December
ru: Декабрь

source: SUN
ru: ВС

source: MON
ru: ПН

source: TUE
ru: ВТ

source: WED
ru: СР

source: THU
ru: ЧТ

source: FRI
ru: ПТ

source: SAT
ru: СБ

source: JAN
ru: ЯНВ

source: FEB
ru: ФЕВ

source: MAR
ru: МАР

source: APR
ru: АПР

source: MAY
ru: МАЙ

source: JUN
ru: ИЮН

source: JUL
ru: ИЮЛ

source: AUG
ru: АВГ

source: SEP
ru: СЕН

source: OCT
ru: ОКТ

source: NOV
ru: НОЯ

source: DEC
ru: ДЕК

source: There was an error loading the schemas
ru: Возникла ошибка при загрузке схем

source: There was an error loading the catalogs
ru: Произошла ошибка, загружающая каталоги

source: Select database or type to search databases
ru: Выберите базу данных и введите текст для поиска

source: Force refresh catalog list
ru: Принудительно обновить список каталогов

source: Select catalog or type to search catalogs
ru: Выберите значение

source: Catalog
ru: Каталог

source: No compatible catalog found
ru: Совместимый каталог не найден

source: Force refresh schema list
ru: Принудительно обновить список схем

source: Select schema or type to search schemas
ru: Выберите каталог или введите для поиска

source: No compatible schema found
ru: Не найдена совместимая схема

source: Warning! Changing the dataset may break the chart if the metadata does not exist.
ru: Внимание! Изменение датасета может привести к тому, что график станет нерабочим, если будут отсутствовать метаданные.

source: Changing the dataset may break the chart if the chart relies on columns or metadata that does not exist in the target dataset
ru: Изменение датасета может привести к тому, что график станет нерабочим, если график использует несуществующие в целевом датасете столбцы или метаданные

source: dataset
ru: датасет

source: Successfully changed dataset!
ru: Успешное изменение датасета!

source: Connection
ru: База данных

source: Swap dataset
ru: Сменить датасет

source: Proceed
ru: Продолжить

source: Warning!
ru: Предупреждение!

source: Search / Filter
ru: Поиск / Фильтр

source: Add item
ru: Добавить запись

source: STRING
ru: Строчный (STRING/VARCHAR)

source: NUMERIC
ru: Числовой (NUMERIC/DECIMAL)

source: DATETIME
ru: Дата/Время (DATETIME/TIMESTAMP)

source: BOOLEAN
ru: Булевый (BOOLEAN)

source: Physical (table or view)
ru: Физический (таблица или представление)

source: Virtual (SQL)
ru: Виртуальный (SQL)

source: Data type
ru: Тип данных

source: Advanced data type
ru: Расширенный тип данных

source: Advanced Data type
ru: Расширенный тип данных

source: Datetime format
ru: Формат даты/времени

source: The pattern of timestamp format. For strings use
ru: Шаблон формата отметки времени (таймштампа). Для строк используйте

source: Python datetime string pattern
ru: Шаблон строки даты и времени Python

source: expression which needs to adhere to the
ru: , который должен придерживаться

source: standard to ensure that the lexicographical ordering coincides with the chronological ordering. If the timestamp format does not adhere to the ISO 8601 standard you will need to define an expression and type for transforming the string into a date or timestamp. Note currently time zones are not supported. If time is stored in epoch format, put `epoch_s` or `epoch_ms`. If no pattern is specified we fall back to using the optional defaults on a per database/column name level via the extra parameter.
ru: Стандарт, чтобы гарантировать, что лексикографическое упорядочение совпадает с хронологическим упорядочением. стандарта для обеспечения того, чтобы лексикографический порядок совпадал с хронологическим порядком. Если формат временной метки не соответствует стандарту ISO 8601, вам нужно будет определить выражение и тип для преобразования строки в дату или временную метку. В настоящее время часовые пояса не поддерживаются. Если время хранится в формате эпохи, введите \`epoch_s\` или \`epoch_ms\`. Если шаблон не указан, будут использованы необязательные значения по умолчанию на уровне имен для каждой базы данных/столбца с помощью дополнительного параметра.

source: Certified By
ru: Кем утверждено

source: Person or group that has certified this metric
ru: Лицо или группа, которые утвердили этот показатель

source: Certified by
ru: Кем утверждено

source: Certification details
ru: Детали утверждения

source: Details of the certification
ru: Детали утверждения

source: Is dimension
ru: Является измерением

source: Default datetime
ru: Дата и время по умолчанию

source: Is filterable
ru: Фильтруемый

source: <new column>
ru: <новый столбец>

source: Select owners
ru: Выбрать владельцев

source: Modified columns: %s
ru: Изменённые столбцы: %s

source: Removed columns: %s
ru: Удалённые столбцы: %s

source: New columns added: %s
ru: Добавленные столбцы: %s

source: Metadata has been synced
ru: Метаданные синхронизированы

source: An error has occurred
ru: Произошла ошибка

source: Column name [%s] is duplicated
ru: Имя столбца [%s] является дубликатом

source: Metric name [%s] is duplicated
ru: Дубль имени меры [%s]

source: Calculated column [%s] requires an expression
ru: Для вычисляемого столбца [%s] требуется выражение

source: Invalid currency code in saved metrics
ru: Неверный код валюты в сохраненных метриках

source: Basic
ru: Базовая настройка

source: Default URL
ru: URL по умолчанию

source: Default URL to redirect to when accessing from the dataset list page
ru: URL по умолчанию, на который будет выполнен редирект при доступе из страницы со списком датасетов

source: Autocomplete filters
ru: Фильтры автозаполнения

source: Whether to populate autocomplete filters options
ru: Распространить настройки фильтров автозаполнения

source: Autocomplete query predicate
ru: Предикат запроса автозаполнения

source: When using "Autocomplete filters", this can be used to improve performance of the query fetching the values. Use this option to apply a predicate (WHERE clause) to the query selecting the distinct values from the table. Typically the intent would be to limit the scan by applying a relative time filter on a partitioned or indexed time-related field.
ru: Использование "Autocomplete Filters" может повысить производительность запроса, получая значения. Используйте эту опцию для настройки предиката (оператор WHERE) запроса для уникальных значений из таблицы. Обычно целью является ограничение сканирования путем применения относительного временного фильтра к секционированному или индексированному полю типа дата/время.

source: Extra data to specify table metadata. Currently supports metadata of the format: `{ "certification": { "certified_by": "Data Platform Team", "details": "This table is the source of truth." }, "warning_markdown": "This is a warning." }`.
ru: Дополнительные данные для указания метаданных таблиц. Дополнительные метаданные таблицы. В настоящий момент поддерживается следующий формат: `{ "certification": { "certified_by": "Руководитель отдела", "details": "Эта таблица - источник правды." }, "warning_markdown": "Это предупреждение." }`.

source: Cache timeout
ru: Время жизни кэша

source: The duration of time in seconds before the cache is invalidated. Set to -1 to bypass the cache.
ru: Продолжительность времени за несколько секунд до того, как кэш неверен.

source: Hours offset
ru: Смещение времени

source: The number of hours, negative or positive, to shift the time column. This can be used to move UTC time to local time.
ru: Количество часов, отрицательное или положительное, для сдвига столбца формата дата/время. Это может быть использовано для приведения часового пояса UTC к местному времени.

source: Normalize column names
ru: Нормализуйте имена столбцов

source: Always filter main datetime column
ru: Всегда фильтровать основной столбец времени даты

source: When the secondary temporal columns are filtered, apply the same filter to the main datetime column.
ru: Когда вторичные временные столбцы отфильтрованы, применить тот же фильтр к основному столбцу времени даты.

source: <new spatial>
ru: <новая пространственная мера>

source: <no type>
ru: <без типа>

source: Click the lock to make changes.
ru: Нажмите на замок для внесения изменений.

source: Click the lock to prevent further changes.
ru: Нажмите на замок для запрета на внос изменений.

source: virtual
ru: Виртуальный

source: Dataset name
ru: Имя датасета
