Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: A comma separated list of columns that should be parsed as dates
ru: Разделённый запятыми список столбцов, которые должны быть интерпретированы как даты.

source: Decimal Character
ru: Десятичный разделитель

source: Character to interpret as decimal point
ru: Символ десятичного разделителя

source: Null Values
ru: Пустые значения

source: Choose values that should be treated as null. Warning: Hive database supports only a single value
ru: Выберите значения, которые следует рассматривать как нулевые.

source: Skip spaces after delimiter
ru: Пропускать пробелы после разделителя

source: Skip blank lines rather than interpreting them as Not A Number values
ru: Пропускать пустые строки, вместо их перевода в пустые строки (NaN)

source: DD/MM format dates, international and European format
ru: даты формата DD/MM, международный и европейский формат

source: Adjust column settings such as specifying the columns to read, how duplicates are handled, column data types, and more.
ru: Настройте настройки столбцов, такие как указание столбцов для чтения, как обрабатываются дубликаты, типы данных столбцов и многое другое.

source: Columns To Read
ru: Столбцы для чтения

source: Choose columns to read
ru: Выберите столбцы для чтения

source: List of the column names that should be read
ru: Список имен столбцов, которые следует прочитать

source: Column Data Types
ru: Типы данных столбцов

source: A dictionary with column names and their data types if you need to change the defaults. Example: {"user_id":"int"}. Check Python's Pandas library for supported data types.
ru: Словарь с именами столбцов и типами данных, если вам нужно изменить значения по умолчанию.

source: Column data types
ru: Типы данных столбцов

source: Create dataframe index
ru: Создать индекс данных

source: Index Column
ru: Индексный столбец

source: Column to use as the index of the dataframe. If None is given, Index label is used.
ru: Столбец для использования в качестве индекса DataFrame.

source: Choose index column
ru: Выберите столбец индекса

source: Index Label
ru: Индексный ярлык

source: Label for the index column. Don't use an existing column name.
ru: Метка для столбца индекса.

source: Index label
ru: Индексный ярлык

source: Set header rows and the number of rows to read or skip.
ru: установите строки заголовка и количество рядов для чтения или пропуска.

source: Header Row
ru: Строка заголовка

source: Row containing the headers to use as column names (0 is first line of data).
ru: Строка, содержащая заголовки для использования в качестве имен столбцов (0 - первая строка данных).

source: Header row
ru: Заголовок заголовка

source: Rows to Read
ru: Строки для чтения

source: Number of rows of file to read. Leave empty (default) to read all rows
ru: Количество рядов файла для чтения.

source: Rows to read
ru: Строки для чтения

source: Skip Rows
ru: Пропуск строк

source: Number of rows to skip at start of file.
ru: Количество строк для пропуска в начале файла.

source: Skip rows
ru: Пропустить ряды

source: Duplicate dataset
ru: Дублировать датасет

source: Duplicate
ru: Дублировать

source: New dataset name
ru: Новое имя датасета

source: The passwords for the databases below are needed in order to import them together with the datasets. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ru: Для импорта их данных необходимы пароли для приведенных ниже баз данных. Пароли к базам данных требуются, чтобы импортировать их вместе с датасетами. Пожалуйста, обратите внимание, что разделы "Безопасность" и "Утверждение" конфигурации базы данных отсутствуют в экспортируемых файлах и должны быть добавлены после импорта вручную, если необходимо.

source: You are importing one or more datasets that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы импортируете один или несколько датасетов, которые уже существуют. Перезапись может привести к потере части вашей работы. Вы уверены, что хотите продолжить?

source: Refreshing columns
ru: Обновление столбцов

source: Table columns
ru: Столбцы таблицы

source: Loading
ru: Загрузка

source: This table already has a dataset associated with it. You can only associate one dataset with a table.
ru: Эта таблица уже имеет датасет, связанный с ней. С одной таблицей можно связать только один датасет.

source: View Dataset
ru: Посмотреть датасет

source: This table already has a dataset
ru: Эта таблица уже имеет набор данных

source: Datasets can be created from database tables or SQL queries. Select a database table to the left or
ru: Датасеты могут быть созданы из таблиц базы данных или SQL запросов. Выберите таблицу из базы данных слева или

source: create dataset from SQL query
ru: создайте датасет из SQL запроса

source: to open SQL Lab. From there you can save the query as a dataset.
ru: в Лаборатории SQL. Там вы сможете сохранить запрос как датасет.

source: Select dataset source
ru: Выберите источник датасета

source: No table columns
ru: Нет столбцов таблицы

source: This database table does not contain any data. Please select a different table.
ru: Эта таблица базы данных не содержит никаких данных.

source: An Error Occurred
ru: Произошла ошибка

source: Unable to load columns for the selected table. Please select a different table.
ru: Не удалось загрузить столбцы для выбранной таблицы. Пожалуйста, выберите другую таблицу.

source: The API response from %s does not match the IDatabaseTable interface.
ru: ответ API от %s не соответствует идатабасетируемому интерфейсу.

source: Usage
ru: Использование

source: Chart owners
ru: Владельцы графиков

source: Chart last modified
ru: диаграмма последней модифицированной

source: Chart last modified by
ru: График изменен в последний раз

source: Dashboard usage
ru: Использование дашборда

source: Create chart with dataset
ru: Создать диаграмму с набором данных

source: chart
ru: график

source: No charts
ru: Нет графиков

source: This dataset is not used to power any charts.
ru: Этот набор данных не используется для питания каких -либо диаграмм.

source: Select a database table.
ru: Выберите таблицу в базе данных.

source: Create dataset and create chart
ru: Создать датасет и построить график

source: New dataset
ru: Новый датасет

source: Select a database table and create dataset
ru: Выберите базу данных и создайте датасет

source: dataset name
ru: имя датасета

source: Not defined
ru: Не определено

source: There was an error fetching dataset
ru: Возникла ошибка при получении датасета

source: There was an error fetching dataset's related objects
ru: Возникла ошибка при получении связанных объектов набора данных

source: There was an error loading the dataset metadata
ru: Возникла ошибка при загрузке метаданных датасета

source: [Untitled]
ru: [Без названия]

source: Unknown
ru: Неизвестно

source: Viewed %s
ru: Просмотрено %s

source: Edited
ru: Редактировано

source: Created
ru: Создано

source: Viewed
ru: Просмотрено

source: Favorite
ru: Избранное

source: Mine
ru: Мои

source: View All »
ru: Смотреть все »

source: dashboard
ru: дашборд

source: An error occurred while fetching dashboards: %s
ru: Произошла ошибка при получении дашбордов: %s

source: charts
ru: графики(ов)

source: dashboards
ru: дашборды(ов)

source: recents
ru: недавние(их)

source: saved queries
ru: сохраненные(ых) запросы(ов)

source: No charts yet
ru: Нет графиков

source: No dashboards yet
ru: Нет дашбордов

source: No recents yet
ru: Нет недавних записей еще

source: No saved queries yet
ru: Нет сохраненных запросов

source: %(other)s charts will appear here
ru: %(other)s графики будут появляться тут

source: %(other)s dashboards will appear here
ru: %(other)s дашборды будут появляться тут

source: %(other)s recents will appear here
ru: %(other)s недавние записи будут появляться тут

source: %(other)s saved queries will appear here
ru: %(other)s сохраненные запросы будут появляться тут

source: Recently viewed charts, dashboards, and saved queries will appear here
ru: Недавно просмотренные графики, дашборды и сохраненные запросы

source: Recently created charts, dashboards, and saved queries will appear here
ru: Недавно созданные графики, дашборды и сохраненные запросы

source: Recently edited charts, dashboards, and saved queries will appear here
ru: Недавно измененные графики, дашборды и сохраненные запросы

source: SQL query
ru: SQL запрос

source: You don't have any favorites yet!
ru: У вас пока нет избранных!

source: See all %(tableName)s
ru: Список %(tableName)s

source: Connect database
ru: Подключиться к базе данных

source: Create dataset
ru: Создать датасет

source: Connect Google Sheet
ru: Подключить Google Таблицы

source: Upload CSV to database
ru: Загрузить файл CSV в базу данных

source: Upload Excel to database
ru: Загрузить файл Excel в базу данных

source: Upload Columnar file to database
ru: Загрузить файл столбчатого формата в базу данных

source: Enable 'Allow file uploads to database' in any database's settings
ru: Включите "Разрешить загрузку файлов в базу данных" в настройках любой базы данных

source: Onboarding
ru: Онбординг

source: Info
ru: Личные данные

source: Logout
ru: Выход из системы

source: About
ru: О программе

source: Powered by Apache Superset
ru: На базе Apache Superset

source: Build
ru: Сборка

source: Documentation
ru: Документация

source: Report a bug
ru: Сообщить об ошибке

source: Login
ru: Вход в систему

source: query
ru: запрос

source: Deleted: %s
ru: Удалено: %s

source: There was an issue deleting %s: %s
ru: Произошла ошибка при удалении %s: %s

source: This action will permanently delete the saved query.
ru: Это действие навсегда удалит сохранённый запрос.

source: Delete Query?
ru: Удалить запрос?

source: Saved queries
ru: Сохраненные запросы

source: Tab name
ru: Имя вкладки

source: User query
ru: Пользовательский запрос

source: Executed query
ru: Выполненный запрос

source: Query name
ru: Имя запроса

source: SQL Copied!
ru: SQL запрос скопирован!

source: Sorry, your browser does not support copying.
ru: Извините, Ваш браузер не поддерживание копирование. Используйте сочетание клавиш [CTRL + C] для WIN или [CMD + C] для MAC.

source: There was an issue fetching reports attached to this dashboard.
ru: Произошла ошибка с получением рассылок, связанных с этим дашбордом.

source: The report has been created
ru: Рассылка создана

source: Report updated
ru: Отчет обновлен

source: We were unable to active or deactivate this report.
ru: Не удалось включить или выключить эту рассылку.

source: Your report could not be deleted
ru: Не удается удалить рассылку

source: Weekly Report for %s
ru: Еженедельный отчет для %s

source: Weekly Report
ru: Еженедельный отчет

source: Edit email report
ru: Редактировать рассылку

source: Schedule a new email report
ru: Запланировать новую рассылку по почте

source: Message content
ru: Содержимое сообщения

source: Text embedded in email
ru: Текст, включенный в email

source: Image (PNG) embedded in email
ru: Изображение (PNG), встроенное в email

source: Formatted CSV attached in email
ru: Форматированный CSV, прикрепленный к письму

source: Report Name
ru: Имя отчета

source: Include a description that will be sent with your report
ru: Описание, которое будет отправлено вместе с вашим отчетом

source: The report will be sent to your email at
ru: Отчет будет отправлен на ваш адрес электронной почты по адресу

source: Failed to update report
ru: Не удалось обновить отчет

source: Failed to create report
ru: Не удалось создать рассылку

source: Set up an email report
ru: Запланировать рассылку по почте

source: Email reports active
ru: Включить рассылки

source: Delete email report
ru: Удалить рассылку по email

source: Schedule email report
ru: Запланировать рассылку по почте

source: This action will permanently delete %s.
ru: Это действие навсегда удалит %s.

source: Delete Report?
ru: Удалить рассылку?

source: rowlevelsecurity
ru: Безопасность на уровне строк

source: Rule added
ru: Правило добавлено

source: Edit Rule
ru: Редактировать правило

source: Add Rule
ru: Добавить правило

source: Rule Name
ru: Имя правила

source: The name of the rule must be unique
ru: Имя правила должно быть уникальным

source: Regular filters add where clauses to queries if a user belongs to a role referenced in the filter, base filters apply filters to all queries except the roles defined in the filter, and can be used to define what users can see if no RLS filters within a filter group apply to them.
ru: Регулярные фильтры добавляют, где положения, чтобы запросить, если пользователь принадлежит к роли, на которую ссылается фильтр, базовые фильтры применяют фильтры ко всем запросам, за исключением ролей, определенных в фильтре, и могут использоваться для определения того, какие пользователи могут видеть, не применяются ли RL -фильтры в группе фильтров.Обычные фильтры добавляют условия where к запросам, если пользователь принадлежит к роли указанной в фильтре, базовые фильтры применяют фильтры ко всем запросам кроме ролей, определенных в фильтре, и могут быть использованы для определения того, что пользователи могут видеть, если к ним не применяются фильтры RLS в группе фильтров.

source: Datasets
ru: Датасеты

source: These are the datasets this filter will be applied to.
ru: Это датасеты, к которым будет применяться данный фильтр.

source: Excluded roles
ru: Исключаемые роли роли

source: For regular filters, these are the roles this filter will be applied to. For base filters, these are the roles that the filter DOES NOT apply to, e.g. Admin if admin should see all data.
ru: Для обычных фильтров это роли, к которым будет применяться данный фильтр. Для базовых фильтров это роли, к которым фильтр НЕ применяется, например, Admin, если admin должен видеть все данные.

source: Group Key
ru: Ключ группы

source: Filters with the same group key will be ORed together within the group, while different filter groups will be ANDed together. Undefined group keys are treated as unique groups, i.e. are not grouped together. For example, if a table has three filters, of which two are for departments Finance and Marketing (group key = 'department'), and one refers to the region Europe (group key = 'region'), the filter clause would apply the filter (department = 'Finance' OR department = 'Marketing') AND (region = 'Europe').
ru: Фильтры с одним и тем же групповым ключом будут объединяться в группе, в то время как различные группы фильтров будут и будут вместе. Фильтры с одинаковым ключом группы будут объединены в группу по принципу OR, в то время как разные группы фильтров будут объединены AND. Неопределенные групповые «ключи рассматриваются как уникальные группы, т.е. не группируются вместе. Например, если в таблице есть три фильтра, два из которых предназначены для отделов Финансы и маркетинг (ключ группы = 'department'), а один относится к региону Европа (ключ группы = 'region'), то в пункте фильтрации будет применен фильтр (department = 'Финансы' ИЛИ department = 'Маркетинг') И (region = 'Европа')»

source: Clause
ru: Оператор

source: This is the condition that will be added to the WHERE clause. For example, to only return rows for a particular client, you might define a regular filter with the clause `client_id = 9`. To display no rows unless a user belongs to a RLS filter role, a base filter can be created with the clause `1 = 0` (always false).
ru: Это условие, которое будет добавлено в предложение о том, где. Это условие, которое будет добавлено к оператору WHERE. Например, чтобы возвращать строки только для определенного клиента, вы можете определить обычный фильтр с условием `client_id = 9`. Чтобы не отображать строки, если пользователь не принадлежит к роли фильтра RLS, можно создать базовый фильтр с предложением `1 = 0` (всегда false).

source: Regular
ru: Обычный

source: Base
ru: Базовый

source: %s items could not be tagged because you don’t have edit permissions to all selected objects.
ru: %s пункты не могут быть помечены, потому что у вас нет разрешений на редактирование для всех выбранных объектов.

source: Tagged %s %ss
ru: Протегировано %s %ss

source: Failed to tag items
ru: Не удалось установить тег на объект

source: Bulk tag
ru: Множественный выбор тегов

source: You are adding tags to %s %ss
ru: вы добавляете теги к %s %ss

source: tags
ru: теги

source: Select Tags
ru: Выберите теги

source: Tag updated
ru: Тег обновлен

source: Tag created
ru: Тег создан

source: Tag name
ru: Имя тега

source: Name of your tag
ru: Назовите ваш тег

source: Add description of your tag
ru: Добавить описание к вашему тегу

source: Select dashboards
ru: Выберите дашборды

source: Select saved queries
ru: Выберите сохраненные запросы

source: Chosen non-numeric column
ru: Выбран нечисловой столбец

source: UI Configuration
ru: Конфигурация UI

source: Filter value is required
ru: Требуется значение фильтра

source: User must select a value before applying the filter
ru: Для использования фильтра пользователь будет обязан выбрать значение

source: Single value
ru: Единственное значение

source: Use only a single value.
ru: Используйте только одно значение.

source: Range filter plugin using AntD
ru: Плагин фильтра диапазона с использованием ANTD

source: Experimental
ru: Экспериментальный

source: (excluded)
ru: (исключено)

source: %s option
ru: %s вариант

source: Check for sorting ascending
ru: Выберит для сортировки по возрастанию

source: Can select multiple values
ru: Можно выбрать несколько значений

source: Select first filter value by default
ru: Сделать первое значение фильтра значением по умолчанию

source: When using this option, default value can’t be set
ru: При включении этой опции нельзя установить значение по умолчанию

source: Inverse selection
ru: Выбрать противоположные значения

source: Exclude selected values
ru: Исключить выбранные значения

source: Dynamically search all filter values
ru: Динамически искать все значения фильтра

source: By default, each filter loads at most 1000 choices at the initial page load. Check this box if you have more than 1000 filter values and want to enable dynamically searching that loads filter values as users type (may add stress to your database).
ru: По умолчанию каждый фильтр загружает не более 1000 вариантов на начальной загрузке страницы. По умолчанию, каждый фильтр загружает не больше 1000 элементов выбора при начальной загрузке страницы. Установите этот флаг, если у вас больше 1000 значений фильтра и вы хотите включить динамический поиск, который загружает значения по мере их ввода пользователем (может увеличить нагрузку на вашу базу данных).

source: Select by id with translation filter plugin using AntD'
ru: Выберите ID с плагином фильтра «Перевод» с использованием ANTD '

source: Select by id filter plugin using AntD'
ru: Выберите плагин с ID Filter с помощью ANTD '

source: Select with translation filter plugin using AntD'
ru: Выберите с плагином фильтра «Перевод» с использованием ANTD '

source: Select filter plugin using AntD
ru: Выберите плагин фильтра, используя ANTD

source: Custom time filter plugin
ru: Пользовательский плагин фильтра времени

source: No time columns
ru: Нет столбцов формата дата/время

source: Time column filter plugin
ru: Плагин фильтра времени

source: Time grain filter plugin
ru: Плагин фильтра времени

source: Working
ru: Обрабатывается

source: Not triggered
ru: Условие не выполнялось

source: On Grace
ru: На перерыве

source: Alert
ru: Оповещение

source: reports
ru: рассылки

source: alerts
ru: оповещений

source: There was an issue deleting the selected %s: %s
ru: Произошла ошибка при удалении выбранных %s: %s

source: Last run
ru: Последнее изменение

source: Active
ru: Активен

source: Execution log
ru: Журнал выполнения

source: Bulk select
ru: Множественный выбор

source: No %s yet
ru: Пока нет %s

source: Owner
ru: Владелец

source: An error occurred while fetching owners values: %s
ru: Произошла ошибка при получении владельцев графика: %s

source: Status
ru: Статус

source: An error occurred while fetching dataset datasource values: %s
ru: Произошла ошибка при получении значений датасета: %s

source: Alerts & reports
ru: Оповещения и отчеты

source: Alerts
ru: Оповещения

source: Reports
ru: Отчеты

source: Delete %s?
ru: Удалить %s?

source: Are you sure you want to delete the selected %s?
ru: Вы уверены, что хотите удалить выбранные %s?

source: Error Fetching Tagged Objects
ru: Ошибка извлечения объектов с меткой

source: Edit Tag
ru: Редактировать тег

source: There was an issue deleting the selected layers: %s
ru: Произошла ошибка при удалении выбранных слоёв: %s

source: Edit template
ru: Редактировать шаблон

source: Delete template
ru: Удалить шаблон

source: Changed by
ru: Изменилось

source: No annotation layers yet
ru: Пока нет слоев аннотаций

source: This action will permanently delete the layer.
ru: Это действие навсегда удалит слой.

source: Delete Layer?
ru: Удалить слой?

source: Are you sure you want to delete the selected layers?
ru: Вы уверены, что хотите удалить выбранные слои?

source: There was an issue deleting the selected annotations: %s
ru: Произошла ошибка при удалении выбранных аннотаций: %s

source: Delete annotation
ru: Удалить аннотацию

source: Annotation
ru: Аннотация

source: No annotation yet
ru: Пока нет аннотаций

source: Annotation Layer %s
ru: Слой аннотаций %s

source: Back to all
ru: Вернуться ко всем

source: Are you sure you want to delete %s?
ru: Вы уверены, что хотите удалить %s?

source: Delete Annotation?
ru: Удалить аннотацию?

source: Are you sure you want to delete the selected annotations?
ru: Вы уверены, что хотите удалить выбранные аннотации?

source: Failed to load chart data
ru: Не удалось загрузить данные графика

source: view instructions
ru: смотреть инструкцию

source: Add a dataset
ru: Добавить датасет

source: Choose a dataset
ru: Выберите датасет

source: Choose chart type
ru: Выберите тип графика

source: Please select both a Dataset and a Chart type to proceed
ru: Пожалуйста, для продолжения выберите и датасет, и тип графика

source: The passwords for the databases below are needed in order to import them together with the charts. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ru: Для баз данных нужны пароли, чтобы импортировать их вместе с графиками. Пожалуйста, обратите внимание, что разделы "Безопасность" и "Утверждение" в настройках конфигурации базы данных отсутствуют в экспортируемых файлов и должны быть добавлены вручную после импорта, если необходимо.

source: You are importing one or more charts that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы импортируете один или несколько графиков, которые уже существуют. Перезапись может привести к потере части вашей работы. Вы уверены, что хотите перезаписать?

source: Chart imported
ru: График импортирован

source: There was an issue deleting the selected charts: %s
ru: Произошла ошибка при удалении выбранных графиков: %s

source: An error occurred while fetching dashboards
ru: Произошла ошибка при получении дашбордов

source: Tag
ru: Тег

source: An error occurred while fetching chart owners values: %s
ru: Произошла ошибка при получении владельцев графика: %s

source: Certified
ru: Утверждено

source: Alphabetical
ru: В алфавитном порядке

source: Recently modified
ru: Измененные недавно

source: Least recently modified
ru: Измененные давно

source: Import charts
ru: Импортировать графики

source: Are you sure you want to delete the selected charts?
ru: Вы уверены, что хотите удалить выбранные графики?
