Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Form data not found in cache, reverting to chart metadata.
ru: Данные формы не найдены в кэше, возвращение к метаданным графика.

source: Form data not found in cache, reverting to dataset metadata.
ru: Данные формы не найдены в кэше, возвращение к метаданным датасета.

source: [Missing Dataset]
ru: [отсутствующий датасет]

source: Onboarding parameters are invalid.
ru: Параметры по адаптации недействительны.

source: Onboarding could not be updated.
ru: Встроение не может быть обновлено.

source: Changing this Onboarding is forbidden
ru: Изменение этой адаптации запрещено

source: You don't have access to this Onboarding.
ru: У вас нет доступа к этой адаптации.

source: Saved queries could not be deleted.
ru: Не удалось удалить сохраненные запросы.

source: Saved query not found.
ru: Сохраненный запрос не найден.

source: Import saved query failed for an unknown reason.
ru: Не удалось импортировать сохраненный запрос по неизвестной причине

source: Saved query parameters are invalid.
ru: Сохраненные параметры запроса недопустимы.

source: Alert query returned more than one row. %(num_rows)s rows returned
ru: Запрос оповещения вернул более одного строки. %(num_rows)s строк возвращено

source: Alert query returned more than one column. %(num_cols)s columns returned
ru: Запрос оповещения вернул более одного столбца. %(num_cols)s столбцов возвращено

source: An error occurred when running alert query
ru: Произошла ошибка при запуске запроса оповещения

source: Invalid tab ids: %s(tab_ids)
ru: Неверные идентификаторы вкладок: %s(tab_ids)

source: Dashboard does not exist
ru: Дашборд не существует

source: Chart does not exist
ru: График не существует

source: Database is required for alerts
ru: Для оповещений требуется база данных

source: Type is required
ru: Поле обязательно

source: Choose a chart or dashboard not both
ru: Выберите график или дашборд, не обоих

source: Must choose either a chart or a dashboard
ru: Выберите график или дашборд

source: %(report_type)s schedule frequency exceeding limit. Please configure a schedule with a minimum interval of %(minimum_interval)d minutes per execution.
ru: %(report_type)s частота превышения графика. Пожалуйста, настройте расписание с минимальным интервалом в %(minimum_interval)d минут на выполнение.

source: Please save your chart first, then try creating a new email report.
ru: Пожалуйста, сначала сохраните график перед тем, как создавать новую рассылку.

source: Please save your dashboard first, then try creating a new email report.
ru: Пожалуйста, сначала сохраните дашборд перед тем, как создавать новую рассылку.

source: Report Schedule parameters are invalid.
ru: Параметры расписания отчета неверны.

source: Report Schedule could not be created.
ru: Невозможно удалить расписание отчета.

source: Report Schedule could not be updated.
ru: Невозможно обновить расписание отчета

source: Report Schedule not found.
ru: Расписание отчета не найдено

source: Report Schedule delete failed.
ru: Ошибка при удалении расписания отчета.

source: Report Schedule log prune failed.
ru: отчет о графике.

source: Report Schedule execution failed when generating a screenshot.
ru: Возникла ошибка при создании скриншота для отправки отчета

source: Report Schedule execution failed when generating a pdf.
ru: Выполнение расписания отчетов не удалось при генерации PDF.

source: Report Schedule execution failed when generating a csv.
ru: Возникла ошибка при создании csv для отправки отчета

source: Report Schedule execution failed when generating a dataframe.
ru: Возникла ошибка при создании датафрейма для отправки отчета

source: Report Schedule execution got an unexpected error.
ru: Возникла неожиданная ошибка при отправке отчета

source: Report Schedule is still working, refusing to re-compute.
ru: Планировщик отчетов все еще работает, не имея возможности отправить отчет

source: Report Schedule reached a working timeout.
ru: Расписание отчетов достигло рабочего таймаута.

source: A report named "%(name)s" already exists
ru: Рассылка с именем "%(name)s" уже существует

source: An alert named "%(name)s" already exists
ru: Оповещение с именем "%(name)s" уже существует

source: Resource already has an attached report.
ru: Для этого компонента уже создан отчет.

source: Alert query returned more than one row.
ru: Запрос оповещения вернул больше, чем одну строку.

source: Alert validator config error.
ru: Неверная конфигурация валидатора оповещений.

source: Alert query returned more than one column.
ru: Запрос оповещения вернул больше, чем один столбец.

source: Alert query returned a non-number value.
ru: Запрос оповещения вернул нечисловое значение.

source: Alert found an error while executing a query.
ru: Возникла ошибка при выполнении запроса для оповещения.

source: A timeout occurred while executing the query.
ru: Вышло время исполнения запроса.

source: A timeout occurred while taking a screenshot.
ru: Вышло время создания скриншота.

source: A timeout occurred while generating a csv.
ru: Вышло время создания CSV файла.

source: A timeout occurred while generating a dataframe.
ru: Вышло время создания датафрейма.

source: Alert fired during grace period.
ru: Оповещение сработало во время перерыва

source: Alert ended grace period.
ru: У оповещения закончился перерыв.

source: Alert on grace period
ru: Оповещение во время перерыва

source: Report Schedule state not found
ru: Состояние расписания отчета не найдено

source: Report schedule system error
ru: Возникла ошибка расписания отчета на стороне системы

source: Report schedule client error
ru: Возникла ошибка расписания отчета на стороне клиента

source: Report schedule unexpected error
ru: Неожиданная ошибка расписания отчета

source: Changing this report is forbidden
ru: Запрещено изменять эту рассылку

source: An error occurred while pruning logs
ru: Произошла ошибка при удалении журналов

source: RLS Rule not found.
ru: Правило RLS не найдено.

source: RLS rules could not be deleted.
ru: Правила RLS не могут быть удалены.

source: Statement parameters are invalid.
ru: Параметры оператора недействительны.

source: Statements could not be created.
ru: Заявления не могут быть созданы.

source: Statement could not be updated.
ru: Заявление не может быть обновлено.

source: Changing this Statement is forbidden
ru: Изменение этого утверждения запрещено

source: You don't have access to this Statement.
ru: У вас нет доступа к этому утверждению.

source: Tag parameters are invalid.
ru: Параметры тега недействительны.

source: Tag could not be created.
ru: Тэг не может быть создан.

source: Tag could not be updated.
ru: Тег не может быть обновлен.

source: Tag could not be deleted.
ru: Тэг не может быть удален.

source: Tagged Object could not be deleted.
ru: Tagged Object не может быть удален.

source: Team parameters are invalid.
ru: Параметры команды недействительны.

source: Teams could not be created.
ru: Команды не могли быть созданы.

source: Team could not be updated.
ru: Команда не может быть обновлена.

source: Team could not be deleted.
ru: Команда не может быть удалена.

source: Changing this Team is forbidden
ru: Изменение этой команды запрещено

source: You don't have access to this Team.
ru: У вас нет доступа к этой команде.

source: An error occurred while creating the value.
ru: Произошла ошибка при создании значения

source: An error occurred while accessing the value.
ru: Произошла ошибка при доступе к значению

source: An error occurred while deleting the value.
ru: Произошла ошибка при удалении значения

source: An error occurred while updating the value.
ru: Произошла ошибка при обновлении значения

source: You don't have permission to modify the value.
ru: Недостаточно прав для редактирования этого значения.

source: Resource was not found.
ru: Источник не был найден.

source: Invalid result type: %(result_type)s
ru: Недопустимый тип ответа: %(result_type)s

source: Columns missing in dataset: %(invalid_columns)s
ru: Столбцы отсутствуют в датасете: %(invalid_columns)s

source: Time Grain must be specified when using Time Shift.
ru: Временное зерно должно быть указано при использовании временного смены.

source: The chart does not exist
ru: График не существует

source: The chart datasource does not exist
ru: Источник данных графика не существует

source: The chart query context does not exist
ru: Контекст запроса диаграммы не существует

source: Duplicate column/metric labels: %(labels)s. Please make sure all columns and metrics have a unique label.
ru: Дубликат наименования столбца/метрики: %(labels)s. Пожалуйста, убедитесь, что все столбцы и меры имеют уникальную метку.

source: `operation` property of post processing object undefined
ru: `operation` свойство объекта постобработки не определено

source: Unsupported post processing operation: %(operation)s
ru: Неподдерживаемая операция постобработки: %(operation)s

source: Error in jinja expression in RLS filters: %(msg)s
ru: Ошибка в jinja выражении в RLS фильтрах: %(msg)s

source: Error in jinja expression in fetch values predicate: %(msg)s
ru: Ошибка в jinja выражении в предикате выборки значений: %(msg)s

source: Virtual dataset query must be read-only
ru: Запрос виртуального датасета должен быть доступен только для чтения

source: Metric '%(metric)s' does not exist
ru: Мера '%(metric)s' не существует

source: Db engine did not return all queried columns
ru: Драйвер базы данных вернул не все запрошенные столбцы

source: Virtual dataset query cannot be empty
ru: Запрос виртуального датасета не может быть пустым

source: Only `SELECT` statements are allowed
ru: Доступны только SELECT запросы

source: Only single queries supported
ru: Поддерживаются только одиночные запросы

source: Columns
ru: Столбцы

source: Show Column
ru: Показать столбец

source: Add Column
ru: Добавить столбец

source: Edit Column
ru: Редактировать столбец

source: Whether to make this column available as a [Time Granularity] option, column has to be DATETIME or DATETIME-like
ru: Чтобы сделать этот столбец доступным в качестве опции [Time Granularity], столбец должен быть DATETIME или DATETIME-like

source: Whether this column is exposed in the `Filters` section of the explore view.
ru: Разоблачен ли этот столбец в разделе «Фильтры» представления «Исследование».

source: The data type that was inferred by the database. It may be necessary to input a type manually for expression-defined columns in some cases. In most case users should not need to alter this.
ru: Тип данных, который был выведен в базе данных.

source: Column
ru: Столбец

source: Verbose Name
ru: Удобочитаемое имя

source: Description
ru: Описание

source: Groupable
ru: Группируемый

source: Filterable
ru: Фильтруемый

source: Table
ru: Таблица

source: Expression
ru: Выражение

source: Is temporal
ru: Содержит дату/время

source: Datetime Format
ru: Формат даты и времени

source: Type
ru: Тип

source: Business Data Type
ru: Тип данных бизнеса

source: Invalid date/timestamp format
ru: Недопустимый формат дата/время

source: Metrics
ru: Меры

source: Show Metric
ru: Показатель меру

source: Add Metric
ru: Добавить меру

source: Edit Metric
ru: Редактировать меру

source: Metric
ru: Мера

source: SQL Expression
ru: SQL выражение

source: D3 Format
ru: Формат даты/времени

source: Extra
ru: Дополнительные параметры

source: Warning Message
ru: Предупреждение

source: Tables
ru: Таблицы

source: Show Table
ru: Показать таблицу

source: Import a table definition
ru: импортируйте определение таблицы

source: Edit Table
ru: Редактировать таблицу

source: The list of charts associated with this table. By altering this datasource, you may change how these associated charts behave. Also note that charts need to point to a datasource, so this form will fail at saving if removing charts from a datasource. If you want to change the datasource for a chart, overwrite the chart from the 'explore view'
ru: Список диаграмм, связанных с этой таблицей.

source: Timezone offset (in hours) for this datasource
ru: Смещение часового пояса (в часах) для этого источника данных

source: Name of the table that exists in the source database
ru: Имя таблицы, которая существует в базе данных

source: Schema, as used only in some databases like Postgres, Redshift and DB2
ru: Схема, используемая только в некоторых базах данных, таких как Postgres, Redshift и DB2

source: This fields acts a Superset view, meaning that Superset will run a query against this string as a subquery.
ru: Это поля действует в суперсет, что означает, что Superset будет запускать запрос против этой строки в качестве подразделения.

source: Predicate applied when fetching distinct value to populate the filter control component. Supports jinja template syntax. Applies only when `Enable Filter Select` is on.
ru: Предикат, применяемый при получении различного значения для заполнения компонента управления фильтром.

source: Redirects to this endpoint when clicking on the table from the table list
ru: Перенаправление в эту конечную точку при нажатии на таблицу из списка таблиц

source: Whether to populate the filter's dropdown in the explore view's filter section with a list of distinct values fetched from the backend on the fly
ru: Заполнить ли раскрывающийся список фильтра в разделе фильтра Explore View список различных значений, извлеченных из бэкэнд на лету

source: Whether the table was generated by the 'Visualize' flow in SQL Lab
ru: Была ли таблица сгенерирована путем «визуализации» в SQL Lab

source: A set of parameters that become available in the query using Jinja templating syntax
ru: Набор параметров, которые доступны в запросе через шаблонизацию Jinja.

source: Duration (in seconds) of the caching timeout for this table. A timeout of 0 indicates that the cache never expires. Note this defaults to the database timeout if undefined.
ru: Продолжительность (в секундах) тайм -аута кэширования для этой таблицы. Продолжительность (в секундах) таймаута кэша для этой таблицы. Обратите внимание, что если значение не задано, применяется значение базы данных.

source: Allow column names to be changed to case insensitive format, if supported (e.g. Oracle, Snowflake).
ru: Разрешите изменять имена столбцов на нечувствительный формат, если он поддерживается (например, Oracle, Snowflake).Позволить изменять имена столбцов на нечувствительные к регистру, если это поддерживается (например, Oracle, Snowflake).

source: Datasets can have a main temporal column (main_dttm_col), but can also have secondary time columns. When this attribute is true, whenever the secondary columns are filtered, the same filter is applied to the main datetime column.
ru: Наборы данных могут иметь основной временный столбец (main_dttm_col), но также могут иметь вторичные временные столбцы.

source: Associated Charts
ru: Связанные графики

source: Changed By
ru: Кем изменено

source: Database
ru: База данных

source: Last Changed
ru: Дата изменения

source: Enable Filter Select
ru: Включите выбор фильтра

source: Schema
ru: Схема

source: Default Endpoint
ru: Эндпоинт по умолчанию

source: Offset
ru: Смещение

source: Cache Timeout
ru: Время жизни кэша

source: Table Name
ru: Имя таблицы

source: Fetch Values Predicate
ru: Значения получения предиката

source: Owners
ru: Владельцы

source: Main Datetime Column
ru: Основной столбец с временем

source: Template parameters
ru: Параметры шаблона

source: Modified
ru: Изменено

source: The table was created. As part of this two-phase configuration process, you should now click the edit button by the new table to configure it.
ru: Таблица была создана. В рамках этого двухфазного процесса настройки теперь следует нажать кнопку редактирования новой таблицы, чтобы настроить ее.

source: Deleted %(num)d css template
ru: Удален %(num)d CSS шаблон

source: Dataset schema is invalid, caused by: %(error)s
ru: Схема датасета невалидна, причина: %(error)s

source: Tab schema is invalid, caused by: %(error)s
ru: Схема вкладок недействительна, вызванная: %(error)s

source: Deleted %(num)d dashboard
ru: Удален %(num)d дашборд

source: Title or Slug
ru: Название

source: Role
ru: Роль

source: Invalid state.
ru: неверное состояние.

source: Table name undefined
ru: Имя таблицы не определено

source: Upload Enabled
ru: Загрузка включена

source: Invalid connection string, a valid string usually follows: backend+driver://user:password@database-host/database-name
ru: Недопустимая строка подключения, правильная строка обычно следует: Backend Driver: // Пользователь: Password@Database-Host/Database-NameНедопустимая строка для подключения, валидная строка соответствует шаблону: драйвер://имя-пользователя:пароль@хост/имя-базы-данных

source: Field cannot be decoded by JSON. %(msg)s
ru: Поле не может быть декодировано с помощью JSON. %(msg)s

source: The metadata_params in Extra field is not configured correctly. The key %(key)s is invalid.
ru: Metadata_params в дополнительном поле настроено неправильно. Ключ %(key)s некорректный.

source: An engine must be specified when passing individual parameters to a database.
ru: Движок должен быть указан при передаче индивидуальных параметров к базе.

source: Engine spec "InvalidEngine" does not support being configured via individual parameters.
ru: Спецификация двигателя \ "Invalidengine " не поддерживает настройку с помощью отдельных параметров.

source: File extension is not allowed.
ru: Расширение файла не допускается.

source: File size exceeds the maximum allowed size.
ru: Размер файла превышает максимально допустимый размер.

source: Deleted %(num)d dataset
ru: Удален %(num)d датасет

source: Null or Empty
ru: Null или Пусто

source: Unknown Presto Error
ru: Неизвестная ошибка Presto

source: Samples for datasource could not be retrieved.
ru: Не удалось получить примеры записей для источника данных.

source: Changing this datasource is forbidden
ru: Запрещено изменять этот источник данных

source: An error occurred while parsing the key.
ru: Произошла ошибка при парсинге ключа.

source: An error occurred while upserting the value.
ru: Произошла ошибка при вставке значения.

source: Unable to encode value
ru: Невозможно кодировать значение

source: Unable to decode value
ru: Невозможно декодировать значение

source: Invalid permalink key
ru: Недействительный ключ для постоянной ссылки

source: Error while rendering virtual dataset query: %(msg)s
ru: Произошла ошибка при выполнении запроса виртуального датасета: %(msg)s

source: Virtual dataset query cannot consist of multiple statements
ru: Запрос виртуального датасета не может содержать несколько запросов

source: Datetime column not provided as part table configuration and is required by this type of chart
ru: Столбец DateTime не предоставлен в качестве конфигурации таблицы деталей и требуется этим типом диаграммыСтолбец даты/времени не предусмотрен в настройках таблицы и является обязательным для этого типа графика

source: Empty query?
ru: Пустой запрос?

source: Unknown column used in orderby: %(col)s
ru: Неизвестный столбец использован для упорядочивания: %(col)s

source: Time column "%(col)s" does not exist in dataset
ru: Столбец формата дата/время "%(col)s" не существует в датасете

source: Filter value list cannot be empty
ru: Список для фильтрации не может быть пуст

source: Must specify a value for filters with comparison operators
ru: Необходимо указать значение для фильтров с операторами сравнения

source: Invalid filter operation type: %(op)s
ru: Неверный тип работы фильтра: %(op)s

source: Error in jinja expression in WHERE clause: %(msg)s
ru: Ошибка в jinja выражении в операторе WHERE: %(msg)s

source: Error in jinja expression in HAVING clause: %(msg)s
ru: Ошибка в jinja выражении в операторе HAVING: %(msg)s

source: Database does not support subqueries
ru: База данных не поддерживает подзапросы

source: Deleted %(num)d saved query
ru: Удален %(num)d сохраненный запрос

source: Deleted %(num)d report schedule
ru: Удалено %(num)d расписание рассылок

source: Value must be greater than 0
ru: Значение должно быть больше 0

source: Custom width of the screenshot in pixels
ru: Пользовательская ширина скриншота в пикселях

source: Screenshot width must be between %(min)spx and %(max)spx
ru: Ширина скриншота должна быть между %(min)spx и %(max)spx

source: Value must be 0 or greater
ru: Значение должно быть 0 или выше

source: Deleted %(num)d rules
ru: Удалено %(num)d правило

source: %(dialect)s cannot be used as a data source for security reasons.
ru: %(dialect)s не может использоваться в качестве источника данных по соображениям безопасности.

source: Guest user cannot modify chart payload
ru: Пользователь гостя не может изменить полезную нагрузку диаграммы

source: You don't have the rights to alter %(resource)s
ru: Недостаточно прав для изменения %(resource)s

source: Failed to execute %(query)s
ru: Не удалось выполнить %(query)s

source: The parameter %(parameters)s in your query is undefined.
ru: Параметр %(parameters)s в вашем запросе неопределен.

source: finished
ru: закончил

source: id
ru: идентификатор

source: Tag name is invalid (cannot contain ':')
ru: Имя тега недействительно (не может содержать ':')

source: Tag could not be found.
ru: Тег не может быть найден.

source: Is custom tag
ru: Это пользовательский тег

source: Is tagged
ru: Помечено

source: Scheduled task executor not found
ru: Исполнитель регулярных отчетов не найден

source: Name
ru: Имя

source: Slug
ru: Читаемый URL

source: External
ru: Внешний

source: Record Count
ru: Кол-во записей

source: No records found
ru: Записи не найдены

source: Filter List
ru: Список фильтров

source: Search
ru: Поиск

source: Refresh
ru: Обновить

source: Import dashboards
ru: Импортировать дашборды

source: Import Dashboard(s)
ru: Импортировать дашборд(ы)

source: File
ru: Файл

source: Choose File
ru: Выберите файл

source: Upload
ru: Загрузить

source: Use the edit button to change this field
ru: Используйте кнопку редактирования для изменения поля

source: Test Connection
ru: Тестовое соединение

source: Unable to calculate such a date delta
ru: Невозможно рассчитать такую ​​дату дельту

source: Unable to find such a holiday: [%(holiday)s]
ru: Не удалось найти такой праздник: [%(holiday)s]

source: DB column %(col_name)s has unknown type: %(value_type)s
ru: DB column %(col_name)s имеет неизвестный тип: %(value_type)s

source: percentiles must be a list or tuple with two numeric values, of which the first is lower than the second value
ru: Проценли должны быть списком или кортежом с двумя числовыми значениями, из которых первое ниже второго значения

source: `compare_columns` must have the same length as `source_columns`.
ru: `compare_columns` должен иметь ту же длину, что и` source_columns`.

source: `compare_type` must be `difference`, `percentage` or `ratio`
ru: `compare_type` должен быть` differe`, `процент 'или` отношение

source: Column "%(column)s" is not numeric or does not exists in the query results.
ru: Столбец "%(column)s" не является числовым или отсутствует в результатах запроса.

source: `rename_columns` must have the same length as `columns` + `time_shift_columns`.
ru: `rename_columns` должен иметь ту же длину, что и` columns` `time_shift_columns`.

source: Invalid cumulative operator: %(operator)s
ru: Недействительный кумулятивный оператор: %(operator)s

source: Invalid geohash string
ru: Неверная строка geohash

source: Invalid longitude/latitude
ru: Недопустимые долгота/широта

source: Invalid geodetic string
ru: Неверная geodetic строка

source: Pivot operation requires at least one index
ru: операция поворота требует как минимум одного индекса

source: Pivot operation must include at least one aggregate
ru: операция поворота должна включать как минимум один заполнитель

source: `prophet` package not installed
ru: `Пакет Пророк не установлен

source: Time grain missing
ru: Единица времени отсутствует
