Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Y-Axis Sort Ascending
ru: Ось оси сортировки

source: X-Axis Sort Ascending
ru: Сортировать по возрастанию оси X

source: Whether to sort ascending or descending on the base Axis.
ru: Сортировать ли поднимание или спуск по базовой оси.

source: Force categorical
ru: Категориальная сила

source: Treat values as categorical.
ru: Рассматривать значения как категориальные.

source: Decides which measure to sort the base axis by.
ru: Решает, какая измерение для сортировки базовой оси по.

source: Dimensions
ru: Измерения

source: Dimensions contain qualitative values such as names, dates, or geographical data. Use dimensions to categorize, segment, and reveal the details in your data. Dimensions affect the level of detail in the view.
ru: Размеры содержат качественные значения, такие как имена, даты или географические данные.

source: Add dataset columns here to group the pivot table columns.
ru: Добавьте столбцы набора данных здесь, чтобы сгруппировать столбцы таблицы Pivot.

source: Dimension
ru: Измерение

source: Defines the grouping of entities. Each series is represented by a specific color in the chart.
ru: определяет группировку сущностей.

source: Entity
ru: Элемент

source: This defines the element to be plotted on the chart
ru: Элемент, который будет отражен на графике

source: Filters
ru: Фильтры

source: Select one or many metrics to display. You can use an aggregation function on a column or write custom SQL to create a metric.
ru: Выберите один или много метрик для отображения. Выберите одну или несколько метрик для отображения. Вы можете использовать функцию агрегирования на столбце или написать собственный SQL для создания метрики.

source: Select a metric to display. You can use an aggregation function on a column or write custom SQL to create a metric.
ru: Выберите метрику для отображения. Для создания метрики можно использовать агрегатную функцию для столбца или написать собственный SQL.

source: Right Axis Metric
ru: Мера для правой оси

source: Select a metric to display on the right axis
ru: Выберите метрику для отображения на правой оси

source: Sort by
ru: Сортировка

source: This metric is used to define row selection criteria (how the rows are sorted) if a series or row limit is present. If not defined, it reverts to the first metric (where appropriate).
ru: Этот показатель используется для определения критериев выбора строк (как строки отсортируются), если присутствует предел ряда или строки. Эта метрика используется для определения критериев отбора строк (как сортируются строки), если присутствует ограничение на набор или строку. Если она не определена, она возвращается к первой метрике (где это уместно).

source: Bubble Size
ru: Размер пузыря

source: Metric used to calculate bubble size
ru: Мера, используемая для расчета размера пузыря

source: The dataset column/metric that returns the values on your chart's x-axis.
ru: Столбец/метрика набора данных, который возвращает значения по оси X в диаграмме.

source: The dataset column/metric that returns the values on your chart's y-axis.
ru: Столбец/метрика набора данных, который возвращает значения по оси Y диаграммы.

source: Color Metric
ru: Цвет меры

source: A metric to use for color
ru: Показатель, используемый для расчета цвета

source: The time column for the visualization. Note that you can define arbitrary expression that return a DATETIME column in the table. Also note that the filter below is applied against this column or expression
ru: Столбец времени для визуализации. Столбец данных формата дата/время. Вы можете определить произвольное выражение, которое будет возвращать столбец даты/времени в таблице. Фильтр ниже будет применён к этому столбцу или выражению

source: Drop a temporal column here or click
ru: Перетащите столбец формата дата/время сюда

source: Y-axis
ru: Ось Y

source: Dimension to use on y-axis.
ru: Измерение для использования на оси Y.

source: X-axis
ru: Ось X

source: Dimension to use on x-axis.
ru: Измерение для использования на оси X.

source: The type of visualization to display
ru: Выберите необходимый тип визуализации

source: Fixed Color
ru: Фиксированный цвет

source: Use this to define a static color for all circles
ru: Этот цвет используется для заливки

source: Linear Color Scheme
ru: Линейная цветовая схема

source: all
ru: Все

source: 5 seconds
ru: 5 секунд

source: 30 seconds
ru: 30 секунд

source: 1 minute
ru: 1 минута

source: 5 minutes
ru: 5 минут

source: 30 minutes
ru: 30 минут

source: 1 hour
ru: 1 час

source: 6 hour
ru: 6 часов

source: 1 day
ru: 1 день

source: 7 days
ru: 7 дней

source: week
ru: неделя

source: week starting Sunday
ru: неделя, начинающаяся в воскресенье

source: week ending Saturday
ru: неделя, заканчивающаяся в субботу

source: month
ru: месяц

source: quarter
ru: Квартал

source: year
ru: год

source: The time granularity for the visualization. Note that you can type and use simple natural language as in `10 seconds`, `1 day` or `56 weeks`
ru: Время гранулярность для визуализации. Интервал времени, в границах которого строится график. Обратите внимание, что для определения диапазона времени, вы можете использовать естественный язык. Например, можно указать словосочетания - «10 seconds», «1 day» или «56 weeks»

source: Select a time grain for the visualization. The grain is the time interval represented by a single point on the chart.
ru: Выберите зерно времени для визуализации.

source: This control filters the whole chart based on the selected time range. All relative times, e.g. "Last month", "Last 7 days", "now", etc. are evaluated on the server using the server's local time (sans timezone). All tooltips and placeholder times are expressed in UTC (sans timezone). The timestamps are then evaluated by the database using the engine's local timezone. Note one can explicitly set the timezone per the ISO 8601 format if specifying either the start and/or end time.
ru: Этот элемент управления фильтровал всю диаграмму на основе выбранного временного диапазона.

source: Row limit
ru: Лимит строк

source: Limits the number of the rows that are computed in the query that is the source of the data used for this chart.
ru: ограничивает количество строк, которые вычисляются в запросе, который является источником данных, используемых для этой диаграммы.

source: Sort Descending
ru: Сортировать по убыванию

source: If enabled, this control sorts the results/values descending, otherwise it sorts the results ascending.
ru: Если включено, этот элемент управления сортирует результаты/значения, спускающиеся, в противном случае он сортирует результаты восходящими.

source: Series limit
ru: Лимит кол-ва категорий

source: Limits the number of series that get displayed. A joined subquery (or an extra phase where subqueries are not supported) is applied to limit the number of series that get fetched and rendered. This feature is useful when grouping by high cardinality column(s) though does increase the query complexity and cost.
ru: ограничивает количество отображаемых серий. Ограничивает количество отображаемых категорий. Эта опция полезна для столбцов с большим количеством уникальных значений, т.к. уменьшает сложность и стоимость запроса.

source: Y Axis Format
ru: Формат Оси Y

source: Currency format
ru: Формат валюты

source: Time format
ru: Формат даты/времени

source: The color scheme for rendering chart
ru: Цветовая схема, применяемая для раскрашивания графика

source: Truncate Metric
ru: Убрать имя меры

source: Whether to truncate metrics
ru: Нужно ли усекать метрики

source: Show empty columns
ru: Показывать пустые столбцы

source: Sort by metric
ru: Сортировка по мере

source: Whether to sort results by the selected metric in descending order.
ru: Сортировка результатов по выбранной мере в порядке убывания.

source: D3 format syntax: https://github.com/d3/d3-format
ru: Формат D3: https://github.com/d3/d3-format.

source: Only applies when "Label Type" is set to show values.
ru: Применяется только тогда, когда \ "метка типа " установлен для отображения значений.

source: Only applies when "Label Type" is not set to a percentage.
ru: Применяется только тогда, когда \ "метка типа " не установлен на процент.

source: With space
ru: С отступом

source: Rounded
ru: Округленный

source: With space rounded 1
ru: С пробелом округл. 1

source: With space rounded 2
ru: С пробелом округл. 2

source: With space rounded 3
ru: С пробелом округл. 3

source: Adaptive formatting
ru: Адаптивное форматирование

source: Original value
ru: Оригинальное значение

source: Duration in ms (66000 => 1m 6s)
ru: Продолжительность в мс (66000 => 1m 6s)

source: Duration in ms (1.40008 => 1ms 400µs 80ns)
ru: Продолжительность в мс (1.40008 => 1ms 400µs 80ns)

source: D3 time format syntax: https://github.com/d3/d3-time-format
ru: Формат времени D3: https://github.com/d3/d3-time-format

source: Oops! An error occurred!
ru: Произошла ошибка!

source: No results were returned for this query. If you expected results to be returned, ensure any filters are configured properly and the datasource contains data for the selected time range.
ru: Результаты не были возвращены для этого запроса. По этому запросу не было возвращено данных. Если вы ожидали увидеть результаты, убедитесь, что все фильтры настроены правильно и источник данных содержит записи для заданного временного интервала.

source: No Results
ru: Нет результатов

source: ERROR
ru: ОШИБКА

source: Found invalid orderby options
ru: Найдено неверные варианты заказа

source: Unknown error
ru: Неизвестная ошибка

source: Invalid input
ru: Недопустимые входные данные

source: Unexpected error:
ru: Неожиданная ошибка:

source: (no description, click to see stack trace)
ru: (нет описания, нажмите для просмотра трассировки стека)

source: Network error
ru: Ошибка сети

source: Request timed out
ru: Вышло время запроса

source: Issue 1000 - The dataset is too large to query.
ru: Ошибка 1000 - Источник данных слишком велик для запроса.

source: Issue 1001 - The database is under an unusual load.
ru: Ошибка 1001 - Нетипичная загрузка базы данных.

source: An error occurred
ru: Произошла ошибка

source: Sorry, an unknown error occurred.
ru: Извините, произошла неизвестная ошибка.

source: Sorry, there was an error saving this %s: %s
ru: Извините, была ошибка, которая спасала этот %s: %s

source: You do not have permission to edit this %s
ru: У вас нет разрешения на редактирование этого %s

source: No data
ru: Нет данных

source: is expected to be an integer
ru: Ожидается целое число

source: is expected to be a number
ru: Ожидается число

source: is expected to be a Mapbox URL
ru: ожидается, что будет Mapbox URL

source: Value cannot exceed %s
ru: Значение не может превышать %s

source: cannot be empty
ru: Необходимо заполнить

source: Filters for comparison must have a value
ru: фильтры для сравнения должны иметь значение

source: Domain
ru: Домен

source: hour
ru: час

source: day
ru: день

source: The time unit used for the grouping of blocks
ru: Единица времени для группировки блоков

source: Subdomain
ru: Подблок

source: min
ru: Минимум

source: The time unit for each block. Should be a smaller unit than domain_granularity. Should be larger or equal to Time Grain
ru: время времени для каждого блока. Единица времени для каждого подблока. Должна быть меньшей единицей, чем единица времени блока. Должно быть больше или равно единице времени

source: Chart Options
ru: Свойства графика

source: Cell Size
ru: Размер ячейки

source: The size of the square cell, in pixels
ru: Размер квадратной ячейки (в пикселях)

source: Cell Padding
ru: Расстояние между ячейками

source: The distance between cells, in pixels
ru: Расстояние между ячейками (в пикселях)

source: Cell Radius
ru: Радиус ячейки

source: The pixel radius
ru: Радиус ячейки (в пикселях)

source: Color Steps
ru: Количество цветов

source: The number color "steps"
ru: Количество цветов в цветовой схеме

source: Time Format
ru: Формат даты/времени

source: Legend
ru: Легенда

source: Whether to display the legend (toggles)
ru: Отображать легенду (переключатель)

source: Show Values
ru: Показать значения

source: Whether to display the numerical values within the cells
ru: Отображение числовых значений в ячейках

source: Show Metric Names
ru: Показать имена мер

source: Whether to display the metric name as a title
ru: Отображать имя меры как названия

source: Number Format
ru: Числовой формат

source: Correlation
ru: Корреляция

source: Visualizes how a metric has changed over a time using a color scale and a calendar view. Gray values are used to indicate missing values and the linear color scheme is used to encode the magnitude of each day's value.
ru: Визуализирует, как метрика изменилась за время, используя цветовой шкалу и календарный вид. Визуализирует, как показатель изменился с течением времени, используя цветовую шкалу и календарь. Значения серого цвета используются для обозначения отсутствующих значений, а линейная цветовая схема используется для отображения величины значения каждого дня.

source: Business
ru: Бизнес

source: Comparison
ru: Сравнение

source: Intensity
ru: Насыщенность

source: Pattern
ru: Паттерн

source: Report
ru: Отчет

source: Trend
ru: Тенденция

source: less than {min} {name}
ru: меньше, чем {min} {name}

source: between {down} and {up} {name}
ru: между {down} и {up} {name}

source: more than {max} {name}
ru: больше, чем {max} {name}

source: Number format
ru: Числовой формат

source: Choose a number format
ru: Выберите числовой формат

source: Source
ru: Источник

source: Choose a source
ru: Выберите источник

source: Target
ru: Цель

source: Choose a target
ru: Выберите цель

source: Flow
ru: Поток

source: Showcases the flow or link between categories using thickness of chords. The value and corresponding thickness can be different for each side.
ru: демонстрирует поток или связь между категориями, используя толщину аккордов.

source: Relationships between community channels
ru: отношения между каналами сообщества

source: Chord Diagram
ru: Хордовая диаграмма

source: Circular
ru: Круглая форма

source: Legacy
ru: Устарел

source: Proportional
ru: Пропорция

source: Relational
ru: Относительный

source: Country
ru: Страна

source: Which country to plot the map for?
ru: Выбор страны для графика

source: ISO 3166-2 Codes
ru: Коды ISO 3166-2

source: Column containing ISO 3166-2 codes of region/province/department in your table.
ru: Столбец, содержащий коды ISO 3166-2 региона/республики/области в вашей таблице.

source: Metric to display bottom title
ru: Мера для отображения нижнего заголовка

source: Map
ru: Карта

source: Visualizes how a single metric varies across a country's principal subdivisions (states, provinces, etc) on a choropleth map. Each subdivision's value is elevated when you hover over the corresponding geographic boundary.
ru: Визуализирует, как единственная метрика варьируется в основных подразделениях страны (штаты, провинции и т. Д.) На карте чороплат.

source: 2D
ru: 2D карты

source: Geo
ru: Карта

source: Range
ru: Интервал

source: Stacked
ru: С наполнением

source: Sorry, there appears to be no data
ru: Извините, похоже, что данные отсутствуют

source: Event definition
ru: Определение события

source: Event Names
ru: Имена событий

source: Columns to display
ru: Столбцы для отображения

source: Order by entity id
ru: Сортировку по идентификатору объекта

source: Important! Select this if the table is not already sorted by entity id, else there is no guarantee that all events for each entity are returned.
ru: Важно! Выберите этот вариант, если таблица еще не отсортирована по идентификатору сущности, иначе нет гарантии, что будут возвращены все события для каждой сущности.

source: Minimum leaf node event count
ru: Минимальное количество событий листового узла

source: Leaf nodes that represent fewer than this number of events will be initially hidden in the visualization
ru: Листовые узлы, которые представляют меньше этого количества событий, будут изначально скрыты в визуализации

source: Additional metadata
ru: Дополнительные метаданные

source: Metadata
ru: Метаданные

source: Select any columns for metadata inspection
ru: Выберите любые столбцы для проверки метаданных

source: Entity ID
ru: ID элемента

source: e.g., a "user id" column
ru: например, столбец "идентификатор пользователя"

source: Max Events
ru: Лимит событий

source: The maximum number of events to return, equivalent to the number of rows
ru: Максимальное количество возвращаемых событий, эквивалентно количеству строк

source: Compares the lengths of time different activities take in a shared timeline view.
ru: Сравнивает продолжительность времени, которые различные действия принимают в общий вид сроки.

source: Event Flow
ru: Поток событий

source: Progressive
ru: Постепенный

source: Axis ascending
ru: Ось по возрастанию

source: Axis descending
ru: Ось по убыванию

source: Metric ascending
ru: Мера по возрастанию

source: Metric descending
ru: Мера по убыванию

source: Heatmap Options
ru: Настройки тепловой карты

source: XScale Interval
ru: XScale интервал

source: Number of steps to take between ticks when displaying the X scale
ru: Количество шагов, которые необходимо предпринять между клещами при отображении X Scale

source: YScale Interval
ru: интервал YSCALE

source: Number of steps to take between ticks when displaying the Y scale
ru: Количество шагов, которые необходимо предпринять между клещами при отображении шкалы Y

source: Rendering
ru: Отрисовка

source: pixelated (Sharp)
ru: пикселированный (Sharp)

source: auto (Smooth)
ru: Автоматически (плавно)

source: image-rendering CSS attribute of the canvas object that defines how the browser scales up the image
ru: Атрибут CSS-Rendering-Rendering изображения объекта Canvas, который определяет, как браузер масштабирует изображение

source: Normalize Across
ru: Нормализовать по всему

source: heatmap
ru: тепловая карта

source: Color will be shaded based the normalized (0% to 100%) value of a given cell against the other cells in the selected range:
ru: Цвет будет затенен на основе нормализованного (от 0% до 100%) значения данной ячейки против других ячеек в выбранном диапазоне:

source: x: values are normalized within each column
ru: x: значения нормализованы внутри каждого столбца

source: y: values are normalized within each row
ru: y: значения нормализованы внутри каждой строки

source: heatmap: values are normalized across the entire heatmap
ru: тепловая карта: значения нормализованы внутри всей карты

source: Left Margin
ru: Левый отступ

source: auto
ru: Автоматически

source: Left margin, in pixels, allowing for more room for axis labels
ru: Левый отступ (в пикселях), дает больше пространства меткам оси

source: Bottom Margin
ru: Нижний отступ

source: Bottom margin, in pixels, allowing for more room for axis labels
ru: Нижний отступ (в пикселях), дает больше пространства меткам оси

source: Value bounds
ru: Ограничения для значения

source: Hard value bounds applied for color coding. Is only relevant and applied when the normalization is applied against the whole heatmap.
ru: Жесткие границы значений, применяемые для цветового кодирования. Применяется только в том случае, если нормализация применяется ко всей тепловой карте.

source: Sort X Axis
ru: Сортировка оси X

source: Sort Y Axis
ru: Сортировка оси Y

source: Show percentage
ru: Показывать долю

source: Whether to include the percentage in the tooltip
ru: Отображение процентной доли во всплывающей подсказке

source: Normalized
ru: Нормализовать

source: Whether to apply a normal distribution based on rank on the color scale
ru: Применять нормальное распределение на основе ранга в цветовой схеме

source: Value Format
ru: Формат значения

source: Visualize a related metric across pairs of groups. Heatmaps excel at showcasing the correlation or strength between two groups. Color is used to emphasize the strength of the link between each pair of groups.
ru: Визуализируйте связанную метрику между парами групп. Тепловые карты отлично демонстрируют корреляцию или силу связи между двумя группами. Цвет используется для того, чтобы подчеркнуть силу связи между каждой парой групп.

source: Sizes of vehicles
ru: Размеры транспортных средств

source: Employment and education
ru: Трудоустройство и образование

source: Density
ru: Концентрация

source: Predictive
ru: Прогноз

source: Single Metric
ru: Одна мера

source: Deprecated
ru: Устарело

source: to
ru: по

source: count
ru: количество

source: cumulative
ru: кумулятивно

source: percentile (exclusive)
ru: Перцентиль (исключая)

source: Select the numeric columns to draw the histogram
ru: Выберите числовые столбцы для отрисовки гистограммы

source: No of Bins
ru: Количество столбцов

source: Select the number of bins for the histogram
ru: Выберите количество столбцов для гистограммы

source: X Axis Label
ru: Метка оси X

source: Y Axis Label
ru: Метка оси Y

source: Whether to normalize the histogram
ru: Нормализовать гистограмму

source: Cumulative
ru: С накоплением

source: Whether to make the histogram cumulative
ru: Сделать гистограмму нарастающей

source: Distribution
ru: Распределение

source: Take your data points, and group them into "bins" to see where the densest areas of information lie
ru: Возьмите свои точки данных и группируйте их в \ "Bins ", чтобы увидеть, где лежат самые плотные области информации

source: Population age data
ru: Lанные по возрасту населения

source: Histogram (legacy)
ru: Гистограмма (legacy)

source: Contribution
ru: Режим относительных значений

source: Compute the contribution to the total
ru: Вычислить вклад в общую сумму (долю)

source: Series Height
ru: Высота рядов

source: Pixel height of each series
ru: Высота каждого ряда (в пикселях)

source: Value Domain
ru: Домен значения

source: series
ru: категории

source: overall
ru: в целом

source: change
ru: изменение

source: series: Treat each series independently; overall: All series use the same scale; change: Show changes compared to the first data point in each series
ru: серии: Относитесь к каждой серии независимо; общий: Во всех сериях используется одна и та же шкала; изменение: Показать изменения по сравнению с первой точкой данных в каждой серии.

source: Compares how a metric changes over time between different groups. Each group is mapped to a row and change over time is visualized bar lengths and color.
ru: Сравнивает, как изменяется метрика с течением времени между различными группами. Каждая группа отображается в строке, а изменения с течением времени визуализируются длиной и цветом столбцов.

source: Dark Cyan
ru: Темно-голубой

source: Purple
ru: Фиолетовый

source: Gold
ru: Золотой

source: Dim Gray
ru: Тускло-серый

source: Crimson
ru: Малиновый

source: Forest Green
ru: Лесной зеленый

source: Longitude
ru: Долгота

source: Column containing longitude data
ru: Столбец, содержащий данные о долготе

source: Latitude
ru: Широта

source: Column containing latitude data
ru: Столбец, содержащий данные о широте

source: Clustering Radius
ru: Радиус кластера

source: The radius (in pixels) the algorithm uses to define a cluster. Choose 0 to turn off clustering, but beware that a large number of points (>1000) will cause lag.
ru: Радиус (в пикселях), который алгоритм использует для определения кластера.

source: Points
ru: Точки

source: Point Radius
ru: Радиус маркера

source: The radius of individual points (ones that are not in a cluster). Either a numerical column or `Auto`, which scales the point based on the largest cluster
ru: Радиус отдельных точек (те, которые не находятся в кластере). Радиус маркеров (не находящихся в кластере). Выберите числовой столбец или `Автоматически`, который отмасштабирует маркеры по наибольшему маркеру

source: Auto
ru: Автоматически

source: Point Radius Unit
ru: Единица измерения радиуса маркера
