Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Unsupported time grain: %(time_grain)s
ru: Неподдерживаемая единица времени: %(time_grain)s

source: Periods must be a whole number
ru: Периоды должны быть целым числом

source: Confidence interval must be between 0 and 1 (exclusive)
ru: Доверительный интервал должен быть между 0 и 1 (не включая концы)

source: DataFrame must include temporal column
ru: Датафрейм должен включать временной столбец

source: DataFrame include at least one series
ru: DataFrame включает как минимум одну серию

source: Label already exists
ru: Метка уже существует

source: Resample operation requires DatetimeIndex
ru: Для ресемплирования требуется индекс формата дата/время

source: Resample method should be in
ru: Метод повторного примера должен быть в

source: Undefined window for rolling operation
ru: Неопределенное окно для скольжения

source: Window must be > 0
ru: Окно должно быть > 0

source: Invalid rolling_type: %(type)s
ru: Неверный rolling_type: %(type)s

source: Invalid options for %(rolling_type)s: %(options)s
ru: Недопустимые настройки для %(rolling_type)s: %(options)s

source: Referenced columns not available in DataFrame.
ru: Столбцы с ссылками недоступны в DataFrame.

source: Column referenced by aggregate is undefined: %(column)s
ru: Столбец, на который ссылается агрегат, не определен: %(column)s

source: Operator undefined for aggregator: %(name)s
ru: Оператор не определен для агрегатора: %(name)s

source: Invalid numpy function: %(operator)s
ru: Недопустимая numpy функция: %(operator)s

source: Unexpected time range: %(error)s
ru: Неожиданный диапазон времени: %(error)s

source: Is favorite
ru: В избранном

source: You don't have the rights to download as csv
ru: Недостаточно прав для скачивания в CSV

source: Error: permalink state not found
ru: Ошибка: состояние постоянной ссылки не найдено

source: You don't have the rights to alter this chart
ru: Недостаточно прав для изменения графика

source: You don't have the rights to create a chart
ru: Недостаточно прав для создания графика

source: Explore - %(table)s
ru: Исследовать - %(table)s

source: Explore
ru: Исследовать

source: Chart [{}] has been saved
ru: График [{}] сохранен

source: Chart [{}] has been overwritten
ru: График [{}] перезаписан

source: You don't have the rights to alter this dashboard
ru: Недостаточно прав для изменения дашборда

source: Chart [{}] was added to dashboard [{}]
ru: График [{}] добавлен в дашборд [{}]

source: You don't have the rights to create a dashboard
ru: Недостаточно прав для создания дашборда

source: Dashboard [{}] just got created and chart [{}] was added to it
ru: Дашборд [{}] был только что создан и график [{}] был добавлен в него

source: permalink state not found
ru: состояние постоянной ссылки не найдено

source: A human-friendly name
ru: Человекочитаемое имя

source: Used internally to identify the plugin. Should be set to the package name from the pluginʼs package.json
ru: Используется внутренне для идентификации плагина.

source: A full URL pointing to the location of the built plugin (could be hosted on a CDN for example)
ru: Полный URL, указывающий на местоположение плагина (например, ссылка на CDN)

source: Custom Plugins
ru: Пользовательские плагины

source: Custom Plugin
ru: Пользовательский плагин

source: Add a Plugin
ru: Добавить плагин

source: Edit Plugin
ru: Редактировать плагин

source: The dataset associated with this chart no longer exists
ru: Датасет, связанный с этим графиком, больше не существует

source: Could not determine datasource type
ru: Не удалось определить тип источника данных

source: Could not find viz object
ru: Не удалось найти объект визуализации

source: Charts
ru: Графики

source: Show Chart
ru: Показать график

source: Add Chart
ru: Добавить график

source: Edit Chart
ru: Редактировать график

source: These parameters are generated dynamically when clicking the save or overwrite button in the explore view. This JSON object is exposed here for reference and for power users who may want to alter specific parameters.
ru: Эти параметры генерируются динамически при нажатии кнопки «Сохранить» или «Перезапись» в представлении «Исследование». Эти параметры генерируются автоматически при нажатии кнопки сохранения. Опытные пользователи могут изменить определенные объекты в формате JSON.

source: Duration (in seconds) of the caching timeout for this chart. Note this defaults to the datasource/table timeout if undefined.
ru: Продолжительность (в секундах) тайм -аута кэширования для этой таблицы. Продолжительность (в секундах) таймаута кэша для этого графикаОбратите внимание, что если значение не задано, применяется значение источника данных/таблицы.

source: Creator
ru: Автор

source: Dashboards
ru: Дашборды

source: Datasource
ru: Источник данных

source: Last Modified
ru: Дата изменения

source: Parameters
ru: Параметры

source: Chart
ru: График

source: Visualization Type
ru: Тип визуализации

source: Show Dashboard
ru: Показать дашборд

source: Add Dashboard
ru: Добавить дашборд

source: Edit Dashboard
ru: Изменить

source: This json object describes the positioning of the widgets in the dashboard. It is dynamically generated when adjusting the widgets size and positions by using drag & drop in the dashboard view
ru: Этот объект JSON описывает позиционирование виджетов на приборной панели. Этот JSON объект описывает расположение графиков в дашборде. Он генерируется динамически при изменении и перемещении графиков в дашборде

source: The CSS for individual dashboards can be altered here, or in the dashboard view where changes are immediately visible
ru: CSS для отдельных панелей можно изменять здесь или в представлении панели, где изменения видны сразу

source: To get a readable URL for your dashboard
ru: Для получения читаемого URL-адреса дашборда

source: This JSON object is generated dynamically when clicking the save or overwrite button in the dashboard view. It is exposed here for reference and for power users who may want to alter specific parameters.
ru: Этот JSON-объект генерируется автоматически при сохранении или перезаписи дашборда. Он размещён здесь справочно и для опытных пользователей.

source: Owners is a list of users who can alter the dashboard.
ru: Владельцы – это список пользователей, которые могут изменять дашборд.

source: Roles is a list which defines access to the dashboard. Granting a role access to a dashboard will bypass dataset level checks.If no roles are defined, regular access permissions apply.
ru: Роли - это список, определяющий доступ к дашборду. Предоставление роли доступа к дашборду позволяет обойти проверки на уровне датасета. Если роли не определены, применяются обычные права доступа.

source: Determines whether or not this dashboard is visible in the list of all dashboards
ru: Определяет, виден ли этот дашборд в списке всех дашбордов

source: Dashboard
ru: Дашборд

source: Title
ru: Название

source: Roles
ru: Роли

source: Published
ru: Опубликовано

source: Position JSON
ru: Позиция JSON

source: JSON Metadata
ru: JSON Метаданные

source: Databases
ru: Базы данных

source: Show Database
ru: Показать базу данных

source: Add Database
ru: Добавить базу данных

source: Edit Database
ru: Редактировать Базу Данных

source: Expose this DB in SQL Lab
ru: Предоставить доступ к базе в Лаборатории SQL

source: Operate the database in asynchronous mode, meaning that the queries are executed on remote workers as opposed to on the web server itself. This assumes that you have a Celery worker setup as well as a results backend. Refer to the installation docs for more information.
ru: Работа с базой данных в асинхронном режиме означает, что запросы исполняются на удалённых воркерах, а не на веб-сервере Superset. Это подразумевает, что у вас есть установка с воркерами Celery. Обратитесь к документации по настройке за дополнительной информацией.

source: Allow CREATE TABLE AS option in SQL Lab
ru: Разрешить CREATE TABLE AS в Лаборатории SQL

source: Allow CREATE VIEW AS option in SQL Lab
ru: Разрешить CREATE VIEW AS в Лаборатории SQL

source: Allow users to run non-SELECT statements (UPDATE, DELETE, CREATE, ...) in SQL Lab
ru: Разрешить управление базой данных, используя запросы UPDATE, DELETE, CREATE и т.п. в Лаборатории SQL

source: When allowing CREATE TABLE AS option in SQL Lab, this option forces the table to be created in this schema
ru: При включении опции CREATE TABLE AS в Лаборатории SQL, новые таблицы будут добавлены в эту схему

source: If Presto, all the queries in SQL Lab are going to be executed as the currently logged on user who must have permission to run them.<br/>If Hive and hive.server2.enable.doAs is enabled, will run the queries as service account, but impersonate the currently logged on user via hive.server2.proxy.user property.
ru: Если Presto, все запросы в SQL Lab будут выполнены в качестве в настоящее время зарегистрированного пользователя, который должен иметь разрешение на их запуск.Если вы используете Presto, все запросы в Лаборатории SQL будут выполняться от авторизованного пользователя, который должен иметь разрешение на их выполнение. <br/> Если включены Hive и hive.server2.enable.doAs, то запросы будут выполняться через техническую учетную запись, но имперсонировать зарегистрированного пользователя можно через свойство hive.server2.proxy.user.

source: Duration (in seconds) of the caching timeout for charts of this database. A timeout of 0 indicates that the cache never expires. Note this defaults to the global timeout if undefined.
ru: Продолжительность (в секундах) тайм -аута кэширования для диаграмм этой базы данных. Продолжительность (в секундах) таймаута кэша для графиков этой базы данных. Таймаут 0 означает, что кэш никогда не очистится. Обратите внимание, что если значение не задано, применяется значение по умолчанию из основной конфигурации.

source: If selected, please set the schemas allowed for csv upload in Extra.
ru: Если выбрано, пожалуйста, установите схемы, разрешенные для загрузки CSV в дополнительной.Если установлено, выберите схемы, в которые разрешена загрузка CSV на вкладке "Дополнительно".

source: Expose in SQL Lab
ru: Доступен в SQL редакторе

source: Allow CREATE TABLE AS
ru: Разрешить CREATE TABLE AS

source: Allow CREATE VIEW AS
ru: Разрешить CREATE VIEW AS

source: Allow DDL/DML
ru: Разрешить DDL/DML

source: CTAS Schema
ru: Схема CTAS

source: Chart Cache Timeout
ru: Время жизни кэша графика

source: Secure Extra
ru: Доп. безопасность

source: Root certificate
ru: Корневой сертификат

source: Async Execution
ru: Асинхронное выполнение

source: Impersonate the logged on user
ru: Имперсонировать пользователя

source: Allow Csv Upload
ru: Разрешить загрузку CSV

source: Backend
ru: Драйвер

source: Extra field cannot be decoded by JSON. %(msg)s
ru: Дополнительное поле не может быть декодировано с помощью JSON. %(msg)s

source: Invalid connection string, a valid string usually follows:'DRIVER://USER:PASSWORD@DB-HOST/DATABASE-NAME'<p>Example:'postgresql://user:password@your-postgres-db/database'</p>
ru: Недопустимая строка подключения, правильная строка обычно следует: 'Driver: // пользователь: пароль@db-host/database-name' <p> Пример: 'postgresql: // user: password@your-postgres-db/database' </p>Недопустимая строка для подключения, валидная строка соответствует шаблону:'ДРАЙВЕР://ИМЯ-ПОЛЬЗОВАТЕЛЯ:ПАРОЛЬ@ХОСТ/ИМЯ-БАЗЫ-ДАННЫХ'<p>Пример:'postgresql://user:password@postgres-db/database'</p>

source: Request missing data field.
ru: В запросе отсутствует поле с данными.

source: Duplicate column name(s): %(columns)s
ru: Повторяющееся имя столбца(ов): %(columns)s

source: Logs
ru: Записи

source: Show Log
ru: Показать запись

source: Add Log
ru: Добавить запись

source: Edit Log
ru: Редактировать запись

source: User
ru: Пользователь

source: Action
ru: Действие

source: dttm
ru: Дата/время

source: Statements
ru: Заявления

source: Show Statement
ru: Показать заявление

source: Add Statement
ru: Добавить заявку

source: Edit Statement
ru: Редактировать заявление

source: Team
ru: Команда

source: Team slug
ru: Читаемый URL команды

source: Finished
ru: закончил

source: Request roles
ru: Запрашиваемые роли

source: Created datetime
ru: Создано DateTime

source: Last changed datetime
ru: Последнее изменение DateTime

source: Show Team
ru: Показать команду

source: Add Team
ru: Добавить команду

source: Edit Team
ru: Редактировать команду

source: Participants
ru: участники

source: Time Range
ru: Временной интервал

source: Time Column
ru: Столбец даты/времени

source: Time Grain
ru: Единица времени

source: Time Granularity
ru: Гранулярность времени

source: Time
ru: Время

source: A reference to the [Time] configuration, taking granularity into account
ru: Ссылка на конфигурацию [Time], учитывая гранулярность

source: Aggregate
ru: Агрегация

source: Raw records
ru: Сырые записи

source: Category name
ru: Название категории

source: Total value
ru: Итоговое значение

source: Minimum value
ru: Минимальное значение

source: Maximum value
ru: Максимальное значение

source: Average value
ru: Среднее значение

source: Count
ru: Количество

source: Count Unique Values
ru: Количество уникальных значений

source: List Unique Values
ru: Список уникальных значений

source: Sum
ru: Сумма

source: Average
ru: Среднее

source: Median
ru: Медиана

source: Sample Variance
ru: Выборочная дисперсия

source: Sample Standard Deviation
ru: Стандартное отклонение

source: Minimum
ru: Минимум

source: Maximum
ru: Максимум

source: First
ru: Первый

source: Last
ru: Последний

source: Sum as Fraction of Total
ru: Сумма как доля целого

source: Sum as Fraction of Rows
ru: Сумма как доля строк

source: Sum as Fraction of Columns
ru: Сумма как доля столбцов

source: Count as Fraction of Total
ru: Количество, как доля от целого

source: Count as Fraction of Rows
ru: Количество, как доля от строк

source: Count as Fraction of Columns
ru: Количество, как доля от столбцов

source: Certified by %s
ru: Утверждено: %s

source: description
ru: описание

source: bolt
ru: болт

source: Changing this control takes effect instantly
ru: Изменение этого элемента применяется сразу

source: Show info tooltip
ru: Показать информационную подсказку

source: SQL expression
ru: Выражение SQL

source: Column type
ru: Тип столбца

source: Column name
ru: Имя столбца

source: Label
ru: Метка

source: Metric name
ru: Имя меры

source: unknown type icon
ru: значок неизвестного типа

source: function type icon
ru: значок типа функции

source: string type icon
ru: значок типа строки

source: numeric type icon
ru: значок числового типа

source: boolean type icon
ru: значок логического типа

source: temporal type icon
ru: значок временного типа

source: Advanced analytics
ru: Расширенная аналитика

source: This section contains options that allow for advanced analytical post processing of query results
ru: Этот раздел содержит варианты, которые позволяют проводить расширенную аналитическую пост -обработку результатов запросаВ этом разделе содержатся параметры, которые позволяют производить аналитическую постобработку результатов запроса

source: Rolling window
ru: Скользящее окно

source: Rolling function
ru: Скользящая средняя

source: None
ru: Пусто

source: Defines a rolling window function to apply, works along with the [Periods] text box
ru: Определяет функцию прокатного окна для применения, работает вместе с текстовым поле [периоды]Определяет функцию скользящего окна для применения, работает вместе с текстовым полем [Периоды]

source: Periods
ru: Периоды

source: Defines the size of the rolling window function, relative to the time granularity selected
ru: Определяет размер функции прокатного окна по сравнению с выбранной гранулярностью времениОпределяет размер функции скользящего окна относительно выбранной детализации по времени

source: Min periods
ru: Минимальный период

source: The minimum number of rolling periods required to show a value. For instance if you do a cumulative sum on 7 days you may want your "Min Period" to be 7, so that all data points shown are the total of 7 periods. This will hide the "ramp up" taking place over the first 7 periods
ru: Минимальное количество периодов прокатки, необходимых для показа значения. Минимальное количество скользящих периодов, необходимое для отображения значения. Например, если вы делаете накопительную сумму за 7 дней, вы можете указать, чтобы "Минимальный период" был равен 7, так что все показанные точки данных представляют собой общее количество 7 периодов

source: Time comparison
ru: Столбец с датой

source: Time shift
ru: Временной сдвиг

source: 1 day ago
ru: 1 день назад

source: 1 week ago
ru: 1 неделя назад

source: 28 days ago
ru: 28 дней назад

source: 30 days ago
ru: 30 дней назад

source: 52 weeks ago
ru: 52 недели назад

source: 1 year ago
ru: 1 год назад

source: 104 weeks ago
ru: 104 недели назад

source: 2 years ago
ru: 2 года назад

source: 156 weeks ago
ru: 156 недель назад

source: 3 years ago
ru: 3 года назад

source: Overlay one or more timeseries from a relative time period. Expects relative time deltas in natural language (example: 24 hours, 7 days, 52 weeks, 365 days). Free text is supported.
ru: Наложение одной или нескольких временных рядов из относительного периода времени.

source: Calculation type
ru: Тип расчёта

source: Actual values
ru: Фактические значения

source: Difference
ru: Разница

source: Percentage change
ru: Процентное изменение

source: Ratio
ru: Отношение

source: How to display time shifts: as individual lines; as the difference between the main time series and each time shift; as the percentage change; or as the ratio between series and time shifts.
ru: Как отображать смены времени: как отдельные строки; Как отображать смещения во времени: как отдельные линии; как абсолютную разницу между основным временным рядом и каждым смещением; как процентное изменение; или как соотношение между рядами и смещениями.

source: Resample
ru: Ресемплирование (изменение частоты данных)

source: Rule
ru: Правило

source: 1 minutely frequency
ru: Минутная частота

source: 1 hourly frequency
ru: Часовая частота

source: 1 calendar day frequency
ru: Дневная частота

source: 7 calendar day frequency
ru: Недельная частота

source: 1 month start frequency
ru: Месячная частота (начало месяца)

source: 1 month end frequency
ru: Месячная частота (конец месяца)

source: 1 year start frequency
ru: Годовая частота (начало года)

source: 1 year end frequency
ru: Годовая частота (конец года)

source: Pandas resample rule
ru: Правило ресемплирования данных библиотеки Pandas

source: Fill method
ru: Метод заполнения пропусков

source: Null imputation
ru: Пустые значения

source: Zero imputation
ru: Нулевые значения

source: Linear interpolation
ru: Линейная интерполяция

source: Forward values
ru: Будущие значения

source: Backward values
ru: Предыдущие значения

source: Median values
ru: Медианные значения

source: Mean values
ru: Средние значения

source: Sum values
ru: Суммарные значения

source: Pandas resample method
ru: Метод ресемплирования данных библиотеки Pandas

source: Annotations and Layers
ru: Аннотации и слои

source: Annotation Layers
ru: Слои аннотаций

source: Left
ru: Слева

source: Top
ru: Сверху

source: Chart Title
ru: Название графика

source: X Axis
ru: Ось X

source: X Axis Title
ru: Название оси X

source: X AXIS TITLE BOTTOM MARGIN
ru: Отступ снизу названия оси X

source: Y Axis
ru: Ось Y

source: Y Axis Title
ru: Название оси Y

source: Y Axis Title Margin
ru: Отступ от заголовка оси Y

source: Y Axis Title Position
ru: Заглавная позиция оси Y

source: Query
ru: Запрос

source: Predictive Analytics
ru: Предиктивная аналитика

source: Enable forecast
ru: Включить прогноз в график

source: Enable forecasting
ru: Включить прогнозирование данных

source: Forecast periods
ru: Кол-во прогнозных периодов

source: How many periods into the future do we want to predict
ru: На сколько периодов в будущем предсказывать

source: Confidence interval
ru: Доверительный интервал

source: Width of the confidence interval. Should be between 0 and 1
ru: Ширина доверительного интервала. Должна быть между 0 и 1

source: Yearly seasonality
ru: Годовая сезонность

source: default
ru: по умолчанию

source: Yes
ru: Да

source: No
ru: Нет

source: Should yearly seasonality be applied. An integer value will specify Fourier order of seasonality.
ru: Должен быть применен ежегодный сезонность. Применяется годовая сезонность. Целочисленное значение будет указывать порядок сезонности Фурье.

source: Weekly seasonality
ru: Недельная сезонность

source: Should weekly seasonality be applied. An integer value will specify Fourier order of seasonality.
ru: Должен быть применен еженедельный сезонность. Применяется недельная сезонность. Целочисленное значение будет указывать порядок сезонности Фурье.

source: Daily seasonality
ru: Дневная сезонность

source: Should daily seasonality be applied. An integer value will specify Fourier order of seasonality.
ru: Должен применяться ежедневная сезонность. Применяется дневная сезонность. Целочисленное значение будет указывать порядок сезонности Фурье.

source: Time related form attributes
ru: Параметры, связанные со временем

source: Datasource & Chart Type
ru: Источник данных и Тип графика

source: Chart ID
ru: ID графика

source: The id of the active chart
ru: Идентификатор активного графика

source: Cache Timeout (seconds)
ru: Время жизни кэша (секунды)

source: The number of seconds before expiring the cache
ru: Количество секунд до истечения срока действия кэша

source: URL Parameters
ru: Параметры URL

source: Extra url parameters for use in Jinja templated queries
ru: Дополнительные url параметры для запросов, использующих шаблонизацию Jinja

source: Extra Parameters
ru: Доп. параметры

source: Extra parameters that any plugins can choose to set for use in Jinja templated queries
ru: Дополнительные параметры, которые любые плагины могут выбрать для использования в шаблонных запросах джинджиДополнительные параметры для шаблонизации Jinja, которые могут быть использованы в графиках

source: Color Scheme
ru: Цветовая схема

source: 1 month ago
ru: 1 месяц назад

source: Custom date
ru: Пользовательская дата

source: Inherit range from time filter
ru: Наследуйте диапазон от фильтра времени

source: Time Comparison
ru: Сравнение по времени

source: Compare results with other time periods.
ru: Сравните результаты с другими временными периодами.

source: Select or type a custom value...
ru: Выберите или введите пользовательское значение...

source: Overlay results from a relative time period. Expects relative time deltas in natural language (example: 24 hours, 7 days, 52 weeks, 365 days). Free text is supported. Use "Inherit range from time filters" to shift the comparison time range by the same length as your time range and use "Custom" to set a custom comparison range.
ru: результаты наложения относительного периода времени. Наложение результатов относительного периода времени. Ожидает относительных временных дельт на естественном языке (пример: 24 часа, 7 дней, 52 недели, 365 дней). Поддерживается свободный текст. Используйте "Inherit range from time filters", чтобы сместить временной диапазон сравнения на ту же длину, что и ваш временной диапазон, и используйте "Custom", чтобы задать пользовательский диапазон сравнения.

source: shift start date
ru: дата начала смены

source: Contribution Mode
ru: Режим относительных значений

source: Row
ru: Строка

source: Series
ru: Ряд

source: Calculate contribution per series or row
ru: Рассчитайте взнос на серию или строкуВычислить вклад в общую сумму (долю) по категории или строке. Установливает формат показателя в проценты

source: Y-Axis Sort By
ru: оси y сортируют

source: X-Axis Sort By
ru: Сортировка оси X

source: Decides which column to sort the base axis by.
ru: Решает, какой столбец сортирует базовую ось.
