Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: X Axis Format
ru: Формат оси X

source: Y Log Scale
ru: Логарифмическая ось Y

source: Use a log scale for the Y-axis
ru: Использовать логарифмическую шкалу для оси Y

source: Y Axis Bounds
ru: Границы оси Y

source: Bounds for the Y-axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ru: Границы для оси Y. Границы для оси Y. Если оставить поле пустым, границы динамически определяются на основе минимального/максимального значения данных. Обратите внимание, что эта функция только расширит диапазон осей. Она не изменит размер графика.

source: Y Axis 2 Bounds
ru: Границы оси Y 2

source: X bounds
ru: Показывать границы оси X

source: Whether to display the min and max values of the X-axis
ru: Отображать минимальное и максимальное значение на оси X

source: Bar Values
ru: Значения столбцов

source: Show the value on top of the bar
ru: Показать значение в верхней части столбца

source: Stacked Bars
ru: Столбцы с накоплением

source: Reduce X ticks
ru: Уменьшить кол-во делений оси X

source: Reduces the number of X-axis ticks to be rendered. If true, the x-axis will not overflow and labels may be missing. If false, a minimum width will be applied to columns and the width may overflow into an horizontal scroll.
ru: Уменьшает количество отрисованных делений на оси X. Если флажок установлен, некоторые метки могут быть не отображены.

source: You cannot use 45° tick layout along with the time range filter
ru: Вы не можете использовать расположение делений под углом 45° при использовании временного фильтра

source: Stacked Style
ru: Складированный стиль

source: stack
ru: стек

source: stream
ru: поток

source: expand
ru: развернуть

source: Evolution
ru: Динамика

source: A time series chart that visualizes how a related metric from multiple groups vary over time. Each group is visualized using a different color.
ru: Диаграмма временного ряда, которая визуализирует, как связанная метрика из нескольких групп изменяется с течением времени. Для каждой группы используется свой цвет.

source: Stretched style
ru: Растянутый стиль

source: Stacked style
ru: Сложный стиль

source: Video game consoles
ru: Игровые приставки

source: Vehicle Types
ru: Типы транспортных средств

source: Continuous
ru: Непрерывный

source: Line
ru: Линейный

source: nvd3
ru: Графики nvd3

source: Series Limit Sort By
ru: Сортировка категорий по

source: Metric used to order the limit if a series limit is present. If undefined reverts to the first metric (where appropriate).
ru: Метрика, используемая для упорядочения предела, если присутствует предел последовательности.

source: Series Limit Sort Descending
ru: Предельная сортировка серии по убыванию

source: Whether to sort descending or ascending if a series limit is present
ru: Сортировка по убыванию или по возрастанию, если есть ограничение на количество категорий

source: Visualize how a metric changes over time using bars. Add a group by column to visualize group level metrics and how they change over time.
ru: Визуализирует изменение меры с течением времени, используя столбцы. Добавьте столбец для группировки, чтобы визуализировать показатели уровня группы и то, как они меняются с течением времени.

source: Time-series Bar Chart (legacy)
ru: Столбчатая диаграмма (устарело)

source: Bar
ru: Столбчатая

source: X Log Scale
ru: Логарифмическая ось X

source: Use a log scale for the X-axis
ru: Использовать логарифмическую шкалу для оси X

source: Visualizes a metric across three dimensions of data in a single chart (X axis, Y axis, and bubble size). Bubbles from the same group can be showcased using bubble color.
ru: Визуализирует метрику в трех измерениях данных на одной диаграмме (ось x, ось Y и размер пузырьков).

source: Bubble Chart (legacy)
ru: Таблица пузырьков (наследие)

source: Ranges
ru: Диапазоны

source: Ranges to highlight with shading
ru: Диапазоны для выделения с помощью затенения

source: Range labels
ru: Метки диапазона

source: Labels for the ranges
ru: Метки для диапазонов

source: Markers
ru: Маркеры

source: List of values to mark with triangles
ru: Список числовых значений для отображения в виде треугольников на графике. Например, 10,20,30

source: Marker labels
ru: Метки маркера

source: Labels for the markers
ru: Метки для маркеров

source: Marker lines
ru: Линии маркеров

source: List of values to mark with lines
ru: Список числовых значений для отображения в виде линий на графике. Например, 10,20,30

source: Marker line labels
ru: Метки линий маркера

source: Labels for the marker lines
ru: Метки для линий маркера

source: Showcases the progress of a single metric against a given target. The higher the fill, the closer the metric is to the target.
ru: Демонстрирует прогресс одного показателя по отношению к заданной цели. Чем больше заполнение, тем ближе показатель к целевому показателю.

source: Visualizes many different time-series objects in a single chart. This chart is being deprecated and we recommend using the Time-series Chart instead.
ru: Визуализирует множество разных объектов временных рядов в одной диаграмме.

source: Time-series Percent Change
ru: Процентное изменение (временные ряды)

source: Sort Bars
ru: Сортировать столбцы

source: Sort bars by x labels.
ru: Сортировать столбцы по меткам на оси X.

source: Breakdowns
ru: Сбои

source: Defines how each series is broken down
ru: Определяет разложение каждой категории

source: Compares metrics from different categories using bars. Bar lengths are used to indicate the magnitude of each value and color is used to differentiate groups.
ru: Сравнивает метрики из разных категорий с помощью столбиков. Длина столбиков используется для обозначения величины каждого значения, а цвет - для различения групп.

source: Bar Chart (legacy)
ru: Столбчатая диаграмма (устарело)

source: Additive
ru: Смешанный

source: Propagate
ru: Распространение

source: Send range filter events to other charts
ru: Отправить события фильтра диапазона в другие диаграммы

source: Classic chart that visualizes how metrics change over time.
ru: Классическая диаграмма для визуализации изменения показателей со временем.

source: Battery level over time
ru: Уровень заряда батареи с течением времени

source: Time-series Line Chart (legacy)
ru: Линейная диаграмма временных рядов (Legacy)

source: Label Type
ru: Тип метки

source: Category Name
ru: Имя категории

source: Value
ru: Значение

source: Percentage
ru: Процентная доля

source: Category and Value
ru: Категория и значение

source: Category and Percentage
ru: Категория и процентная доля

source: Category, Value and Percentage
ru: Категория, значение и процентная доля

source: What should be shown on the label?
ru: Текст, отображаемый на метке?

source: Donut
ru: Кольцевая диаграмма

source: Do you want a donut or a pie?
ru: Вы хотите пончик или пирог?

source: Show Labels
ru: Показывать метки

source: Whether to display the labels. Note that the label only displays when the 5% threshold.
ru: Отображать этикетки.

source: Put labels outside
ru: Вынести метки наружу

source: Put the labels outside the pie?
ru: Вынести метки за пределы диаграммы

source: Pie Chart (legacy)
ru: круговая диаграмма (наследие)

source: Frequency
ru: Частота

source: Year (freq=AS)
ru: Год (част=AS)

source: 52 weeks starting Monday (freq=52W-MON)
ru: 52 недели с началом в Понедельник (част=52W-MON)

source: 1 week starting Sunday (freq=W-SUN)
ru: 1 неделя с началом в Воскресенье (част=W-SUN)

source: 1 week starting Monday (freq=W-MON)
ru: 1 неделя с началом в Понедельник (част=W-MON)

source: Day (freq=D)
ru: День (част=D)

source: 4 weeks (freq=4W-MON)
ru: 4 недели (част=4W-MON)

source: The periodicity over which to pivot time. Users can provide "Pandas" offset alias. Click on the info bubble for more details on accepted "freq" expressions.
ru: Периодичность для группировки по времени. Пользователи могут задавать собственную частоту. Для этого нажмите на иконку с информацией.

source: Formula
ru: Формула

source: Event
ru: Событие

source: Interval
ru: Интервал

source: Stream
ru: Поток

source: Expand
ru: Расширить

source: Show legend
ru: Показывать легенду

source: Whether to display a legend for the chart
ru: Отображать легенду для графика

source: Margin
ru: Отступ

source: Additional padding for legend.
ru: Дополнительный отступ для легенды.

source: Scroll
ru: Прокрутка

source: Plain
ru: Отобразить все

source: Legend type
ru: Тип легенды

source: Orientation
ru: Ориентация

source: Bottom
ru: Снизу

source: Right
ru: Справа

source: Legend Orientation
ru: Ориентация легенды

source: Show Value
ru: Показать значение

source: Show series values on the chart
ru: Показать значения категорий на графике

source: Stack series on top of each other
ru: Совместить столбцы в один с накоплением

source: Only Total
ru: Только общий итог

source: Only show the total value on the stacked chart, and not show on the selected category
ru: Показывать только общий итог для столбцов с накоплением, и не показывать промежуточные итоги для каждой категории внутри столбца.

source: Percentage threshold
ru: Процентный порог

source: Minimum threshold in percentage points for showing labels.
ru: Минимальный порог в процентных пунктах для отображения меток.

source: Rich tooltip
ru: Расширенная всплывающая подсказка

source: Shows a list of all series available at that point in time
ru: Показывает список всех данных, доступных в определенный момент времени

source: Tooltip time format
ru: Формат времени всплывающей подсказки

source: Tooltip sort by metric
ru: Сортировка данных подсказки по мере

source: Whether to sort tooltip by the selected metric in descending order.
ru: Сортировка выбранных мер по убыванию во всплывающей подсказке.

source: Show total
ru: Показывать всего

source: Whether to display the total value in the tooltip
ru: Отображать общее значение в подсказке

source: Whether to display the percentage value in the tooltip
ru: Отображать процентное значение в подъеме инструментов

source: Tooltip
ru: Всплывающая подсказка

source: Sort Series By
ru: Сортировать серии по

source: Based on what should series be ordered on the chart and legend
ru: Исходя из того, что следует заказать серии на графике и легенде

source: Sort Series Ascending
ru: Сортировка серии по возрастанию

source: Sort series in ascending order
ru: Сортировки серий в порядке возрастания

source: Rotate x axis label
ru: Повернуть метку оси X

source: Input field supports custom rotation. e.g. 30 for 30°
ru: Поле для ввода поддерживает пользовательские значения, например 30 для 30°

source: Series Order
ru: Порядок серий

source: Truncate X Axis
ru: Усеченная x ось

source: Truncate X Axis. Can be overridden by specifying a min or max bound. Only applicable for numercal X axis.
ru: Усечение оси X. Можно переопределить, указав минимальное или максимальное ограничение. Применяется только для числовой оси X.

source: X Axis Bounds
ru: Границы по оси X

source: Bounds for numerical X axis. Not applicable for temporal or categorical axes. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ru: Границы для численной оси x.

source: Minor ticks
ru: Второстепенные засечки

source: Show minor ticks on axes.
ru: Показать незначительные клещи на топорах.

source: Make the x-axis categorical
ru: Сделайте категорию оси X

source: Last available value seen on %s
ru: Последнее доступное значение: %s

source: Not up to date
ru: Не актуально

source: No data after filtering or data is NULL for the latest time record
ru: Нет данных после фильтрации или данные отсутствуют за последний отрезок времени

source: Try applying different filters or ensuring your datasource has data
ru: Попробуйте использовать другие фильтры или убедитесь, что в вашем источнике данных есть данные

source: Big Number Font Size
ru: Размер шрифта числа

source: Tiny
ru: Крошечный

source: Small
ru: Маленький

source: Normal
ru: Обычный

source: Large
ru: Большой

source: Huge
ru: Огромный

source: Subheader Font Size
ru: Размер шрифта подзаголовка

source: Default
ru: По умолчанию

source: Data for %s
ru: Данные для %s

source: Value difference between the time periods
ru: Разница в значениях между периодами времени

source: Percentage difference between the time periods
ru: Процентная разница между периодами времени

source: Percent Difference format
ru: Процентный формат различий

source: Comparison font size
ru: Сравнение размер шрифта

source: Add color for positive/negative change
ru: Добавить цвет для положительного/отрицательного изменений

source: color scheme for comparison
ru: цветовая схема для сравнения

source: Adds color to the chart symbols based on the positive or negative change from the comparison value.
ru: Добавляет цвет к символам диаграммы на основе положительного или отрицательного изменения от значения сравнения.

source: Display settings
ru: Настройки отображения

source: Subheader
ru: Подзаголовок

source: Description text that shows up below your Big Number
ru: Описание, отображаемое под Карточкой

source: Date format
ru: Форматы даты

source: Force date format
ru: Принудительный перевод к формату дата/время

source: Use date formatting even when metric value is not a timestamp
ru: Использовать перевод к формату дата/время даже если мера представляет другой тип данных

source: Export a numeric value as number of days
ru: Экспорт числового значения в виде количества дней

source: Showcases a single metric front-and-center. Big number is best used to call attention to a KPI or the one thing you want your audience to focus on.
ru: Отображает один показатель по центру. Карточку лучше всего использовать, чтобы привлечь внимание к KPI.

source: A Big Number
ru: Карточка

source: With a subheader
ru: С подзаголовком

source: Big Number
ru: Карточка

source: Comparison Period Lag
ru: Временной лаг для сравнения

source: Based on granularity, number of time periods to compare against
ru: Основываясь на группировке времени, количество периодов времени для сравнения

source: Comparison suffix
ru: Текст рядом с процентным изменением

source: Suffix to apply after the percentage display
ru: Текст после отображения процентной доли

source: Show Timestamp
ru: Показать метку времени

source: Whether to display the timestamp
ru: Отображение временную метку

source: Show Trend Line
ru: Показать трендовую линию

source: Whether to display the trend line
ru: Отображение трендовой линии

source: Start y-axis at 0
ru: Начать ось Y с 0

source: Start y-axis at zero. Uncheck to start y-axis at minimum value in the data.
ru: Начать ось Y в нуле. Снимите флаг, чтобы ось Y начиналась на минимальном значении данных

source: Fix to selected Time Range
ru: Выбрать временной интервал

source: Fix the trend line to the full time range specified in case filtered results do not include the start or end dates
ru: Фиксирует линию тренда в полном временном интервале, указанном в случае, если отфильтрованные результаты не включают даты начала или окончания

source: TEMPORAL X-AXIS
ru: ВРЕМЕННАЯ ОСЬ X

source: Showcases a single number accompanied by a simple line chart, to call attention to an important metric along with its change over time or other dimension.
ru: Отображает один показатель, сопровождаемый простой линейной диаграммой, чтобы привлечь внимание к KPI наряду с его изменением с течением времени или другим измерением.

source: Big Number with Trendline
ru: Карточка с трендовой линией

source: N/A
ru: Пусто

source: Whisker/outlier options
ru: Настройки усов/выбросов

source: Determines how whiskers and outliers are calculated.
ru: Определяет формулу расчета "усов" и выбросов.

source: Min/max (no outliers)
ru: Мин/макс (без выбросов)

source: 2/98 percentiles
ru: 2/98 перцентели

source: 9/91 percentiles
ru: 9/91 перцентели

source: Categories to group by on the x-axis.
ru: Категории для группировки по оси x

source: Distribute across
ru: Распространять через

source: Columns to calculate distribution across.
ru: Столбцы для расчета распределения по всему.

source: Also known as a box and whisker plot, this visualization compares the distributions of a related metric across multiple groups. The box in the middle emphasizes the mean, median, and inner 2 quartiles. The whiskers around each box visualize the min, max, range, and outer 2 quartiles.
ru: Также известный как график коробки и визита, эта визуализация сравнивает распределения связанной метрики по нескольким группам.

source: ECharts
ru: Графики Apache

source: Bubble size number format
ru: Числовой формат размера пузырьков

source: Bubble Opacity
ru: Пузырьковая непрозрачность

source: Opacity of bubbles, 0 means completely transparent, 1 means opaque
ru: Непрозрачность пузырьков, 0 означает полностью прозрачный, 1 означает непрозрачный

source: X AXIS TITLE MARGIN
ru: ОТСТУП ОТ ЗАГОЛОВКА ОСИ X

source: Logarithmic x-axis
ru: Логарифмическая ось X

source: Rotate y axis label
ru: Повернуть метку оси y

source: Y AXIS TITLE MARGIN
ru: Отступ названия оси Y

source: Logarithmic y-axis
ru: Логарифмическая ось Y

source: Truncate Y Axis
ru: Урезать интервал оси Y

source: Truncate Y Axis. Can be overridden by specifying a min or max bound.
ru: Уменьшить интервал по умолчанию для оси Y. Необходимо задать минимальную и максимальную границы. Обратите внимание, что некоторые линии могут пропасть из области видимости.

source: Values align
ru: значения выравниваются

source: Whether to sort descending or ascending
ru: Сортировка по убыванию или по возрастанию

source: Show values total
ru: Показать значения Всего

source: Show total value for the chart without hovering
ru: Показать общее значение для диаграммы без пари

source: Show values separately
ru: Показать значения отдельно

source: Show values for the chart without hovering
ru: Показать значения для диаграммы без паря

source: Stack series
ru: Использовать накопление

source: Show zoom controls
ru: Показать элементы управления Zoom

source: Data Zoom Y
ru: Данные Zoom y

source: Enable data zooming controls (Y)
ru: Включить элементы управления масштабированием данных (Y)

source: Data Zoom X
ru: Данные Zoom x

source: Enable data zooming controls (X)
ru: Включить элементы управления масштабированием данных (x)

source: Popular
ru: Популярно

source: Conditional Formatting
ru: Условное форматирование

source: Apply conditional color formatting to metric
ru: Применить условное форматирование цвета к метрике

source: Conditional formatting message
ru: Сообщение условного форматирования

source: Show conditional color formatting message
ru: Показать сообщение о форматировании условного цвета

source: Chart description
ru: описание диаграммы

source: Tooltip text that shows up below this chart on dashboard
ru: Текст для подъема инструментов, который отображается ниже этой диаграммы на панели инструментов

source: Conditional message Font Size
ru: Условный размер шрифта сообщения

source: Alignment
ru: Выравнивание

source: Value to show
ru: Значение, чтобы показать

source: Conditional formatting
ru: Условное форматирование

source: Comparison period conditional Formatting
ru: условное форматирование периода сравнения

source: Apply comporation period conditional color formatting
ru: Применить период кондиционирования.

source: % calculation
ru: % расчет

source: Display percents in the label and tooltip as the percent of the total value, from the first step of the funnel, or from the previous step in the funnel.
ru: Отображение каких -либо викцентов на этикетке и всплеске инструментов как процент от общей стоимости, с первого этапа воронки или с предыдущего шага в воронке.

source: Calculate from first step
ru: Рассчитайте с первого шага

source: Calculate from previous step
ru: Рассчитайте с предыдущего шага

source: Percent of total
ru: Процент от общего числа

source: Labels
ru: Метки

source: Label Contents
ru: Содержимое этикетки

source: Value and Percentage
ru: Значение и процент

source: What should be shown as the label
ru: Что должно быть показано как этикетка

source: Tooltip Contents
ru: Содержимое подъема инструментов

source: What should be shown as the tooltip label
ru: Что должно быть показано в качестве метки подъема инструментов

source: Whether to display the labels.
ru: Отображать метки

source: Show Tooltip Labels
ru: Показать этикетки подсказки

source: Whether to display the tooltip labels.
ru: Отображать ли метки подсказки.

source: Showcases how a metric changes as the funnel progresses. This classic chart is useful for visualizing drop-off between stages in a pipeline or lifecycle.
ru: Отображает изменение показателя по мере сужения воронки. Эта классическая диаграмма полезна для визуализации перехода между этапами процесса или жизненного цикла.

source: Sequential
ru: Последовательность

source: Columns to group by
ru: Столбцы для группировки

source: General
ru: Основные свойства

source: Min
ru: Минимум

source: Minimum value on the gauge axis
ru: Минимальное значение индикатора

source: Max
ru: Максимум

source: Maximum value on the gauge axis
ru: Максимальное значение индикатора

source: Start angle
ru: Начальный угол

source: Angle at which to start progress axis
ru: Угол, с которого начинается ось прогресса

source: End angle
ru: Конечный угол

source: Angle at which to end progress axis
ru: Угол, под которым заканчивается ось прогресса

source: Font size
ru: Размер шрифта

source: Font size for axis labels, detail value and other text elements
ru: Размер шрифта для меток осей, значений деталей и других текстовых элементов

source: Value format
ru: Формат значения

source: Additional text to add before or after the value, e.g. unit
ru: Дополнительный текст перед значением, например, единица измерения

source: Show pointer
ru: Показывать указатель

source: Whether to show the pointer
ru: Отображение указателя

source: Animation
ru: Анимация

source: Whether to animate the progress and the value or just display them
ru: Анимировать прогресс и значение или просто отображать их

source: Axis
ru: Ось

source: Show axis line ticks
ru: Показывать деления на оси

source: Whether to show minor ticks on the axis
ru: Отображение мелких отметок на оси

source: Show split lines
ru: Показывать разделительные линии

source: Whether to show the split lines on the axis
ru: Отображение линий разделения на оси

source: Split number
ru: Количество разделителей

source: Number of split segments on the axis
ru: Количество разделенных сегментов на индикаторе

source: Progress
ru: Прогресс

source: Show progress
ru: Показывать прогресс

source: Whether to show the progress of gauge chart
ru: Нужно ли показывать ход выполнения графика gauge

source: Overlap
ru: Перекрывание

source: Whether the progress bar overlaps when there are multiple groups of data
ru: Индикатор прогресса накладывается при наличии нескольких групп данных

source: Round cap
ru: Закругление на концах

source: Style the ends of the progress bar with a round cap
ru: Оформление концов индикатора круглыми заглушками

source: Intervals
ru: Интервалы

source: Interval bounds
ru: Граница интервала

source: Comma-separated interval bounds, e.g. 2,4,5 for intervals 0-2, 2-4 and 4-5. Last number should match the value provided for MAX.
ru: Границы интервала, разделенные запятой, например, 2,4,5 для интервалов 0-2, 2-4 и 4-5. Последнее число должно быть равно заданному максиму.

source: Interval colors
ru: Цвета интервала
