Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: undo
ru: отмены

source: button (cmd + z) until you save your changes.
ru: (CTRL + Z), пока вы не сохраните изменения.

source: CANCEL
ru: ОТМЕНА

source: Divider
ru: Разделитель

source: Header
ru: Заголовок

source: Text / Markdown
ru: Текст / отметка

source: Tabs
ru: Вкладки

source: background
ru: Фон

source: Preview
ru: Предпросмотр

source: Sorry, something went wrong. Try again later.
ru: Извините, что-то пошло не так. Попробуйте еще раз позже.

source: The screenshot is being generated. Please, do not leave the page.
ru: Снимки экрана генерируются.

source: The screenshot could not be downloaded. Please, try again later.
ru: Скриншот нельзя загрузить.

source: The screenshot has been downloaded.
ru: Скриншот был загружен.

source: Add/Edit Filters
ru: Добавить/изменить фильтры

source: No filters are currently added to this dashboard.
ru: Не применено ни одного фильтра к данному дашборду.

source: No global filters are currently added
ru: В настоящее время глобальные фильтры не добавляются

source: Click on "+Add/Edit Filters" button to create new dashboard filters
ru: Нажмите кнопку «Добавить/изменить фильтры» \ », чтобы создать новые фильтры на дашборде

source: All filters (%(filterCount)d)
ru: Все фильтры (%(filterCount)d)

source: Filter sets (%(filterSetCount)d)
ru: Сохраненные (%(filterSetCount)d)

source: Apply filters
ru: Применить

source: Clear all
ru: Очистить

source: Locate the chart
ru: Найдите диаграмму

source: Cross-filters
ru: Кроссфильтерные фильмы

source: Add custom scoping
ru: Добавьте пользовательскую обзор

source: All charts/global scoping
ru: Все диаграммы/глобальная область

source: Select chart
ru: Выберите диаграмму

source: Cross-filtering is not enabled in this dashboard
ru: Поперечная фильтрация не включена на этой приборной панели

source: Select the charts to which you want to apply cross-filters when interacting with this chart. You can select "All charts" to apply filters to all charts that use the same dataset or contain the same column name in the dashboard.
ru: Выберите диаграммы, к которым вы хотите применять кроссфильтры при взаимодействии с этой диаграммой.

source: Select the charts to which you want to apply cross-filters in this dashboard. Deselecting a chart will exclude it from being filtered when applying cross-filters from any chart on the dashboard. You can select "All charts" to apply cross-filters to all charts that use the same dataset or contain the same column name in the dashboard.
ru: Выберите диаграммы, к которым вы хотите применять кроссфильтерные фильмы на этой панели приборной панели.

source: All charts
ru: Все графики

source: Enable cross-filtering
ru: Включить кроссфильтр

source: Orientation of filter bar
ru: Ориентация фильтра

source: Vertical (Left)
ru: Вертикально (слева)

source: Horizontal (Top)
ru: Горизонтально (сверху)

source: More filters
ru: Больше фильтров

source: No applied filters
ru: Фильтры не применены

source: Applied filters: %s
ru: Применены фильтры: %s

source: Cannot load filter
ru: Невозможно загрузить фильтр

source: Filters out of scope (%d)
ru: Неприменяемые фильтры (%d)

source: Dependent on
ru: Зависит от

source: Filter only displays values relevant to selections made in other filters.
ru: Фильтр отображает только значения, относящиеся к выборам, сделанным в других фильтрах.

source: Scope
ru: Область применения

source: Filter type
ru: Тип фильтра

source: Title is required
ru: Название обязательно

source: (Removed)
ru: (Удалено)

source: Undo?
ru: Отменить?

source: Add filters and dividers
ru: Добавить фильтры и разделители

source: [untitled]
ru: [без названия]

source: Cyclic dependency detected
ru: Обнаружена циклическая зависимость

source: Add and edit filters
ru: Создать/изменить фильтры

source: Column select
ru: Выбор столбца

source: Select a column
ru: Выберите столбец

source: No compatible columns found
ru: Не найдено подходящих столбцов

source: No compatible datasets found
ru: Совместимые наборы данных не найдено

source: Select a dataset
ru: Выберите набор данных

source: Value is required
ru: Значение обязательно

source: (deleted or invalid type)
ru: (удалено или невалидный тип)

source: Limit type
ru: Тип ограничения

source: No available filters.
ru: Нет доступных фильтров.

source: Add filter
ru: Добавить фильтр

source: Values are dependent on other filters
ru: Значения зависят от других фильтров

source: Values selected in other filters will affect the filter options to only show relevant values
ru: Значения, выбранные в других фильтрах, повлияют на параметры фильтра, чтобы показать только соответствующие значения

source: Values dependent on
ru: Значения зависят от

source: Scoping
ru: Область применения

source: Filter Configuration
ru: Конфигурация фильтра

source: Filter Settings
ru: Настройки фильтра

source: Select filter
ru: Фильтр выбора

source: Range filter
ru: Диапазон

source: Numerical range
ru: Числовой диапазон

source: Time filter
ru: Фильтр по времени

source: Time range
ru: Фильтр по времени

source: Time column
ru: Столбец даты/времени

source: Time grain
ru: Единица времени

source: Group By
ru: Группировать по

source: Group by
ru: Группировать по

source: Select by id filter
ru: Фильтр по ID

source: Filter by ID
ru: Фильтр по ID

source: Select with translation
ru: Фильтр выбора с переводом

source: Value with translation
ru: Значение с переводом

source: Select by id with translation
ru: Фильтр по ID с переводом

source: Filter by ID with translation
ru: Фильтр по ID c переводом

source: This filter is used if there are two columns with values in different languages. For example, Delivery and Доставка
ru: Данный фильтр используется, если существуют две колонки со значениями на разных языках. Например, Delivery и Доставка

source: Dashboard time range filters apply to temporal columns in chart filters. Add temporal columns to apply the dashboard filter
ru: Фильтры по интервалу времени применяются к временным столбцам в фильтрах графиков. Добавьте временные столбцы для применения фильтра

source: Pre-filter is required
ru: Предварительная фильтрация обязательна

source: Time column to apply dependent temporal filter to
ru: Столбец времени для применения зависимого временного фильтра к

source: Time column to apply time range to
ru: Временный столбец для применения диапазона времени к

source: Name is required
ru: Имя обязательно

source: Filter Type
ru: Тип фильтра

source: Datasets do not contain a temporal column
ru: Датасет не содержит столбца формата дата/время

source: Filter name
ru: Имя фильтра

source: Dataset is required
ru: Требуется датасет

source: Use it with caution
ru: Используйте с осторожностью

source: Not a valid integer
ru: Не целое число

source: Pre-filter available values
ru: Предварительно выбрать доступные значения для фильтра

source: Add filter clauses to control the filter's source query, though only in the context of the autocomplete i.e., these conditions do not impact how the filter is applied to the dashboard. This is useful when you want to improve the query's performance by only scanning a subset of the underlying data or limit the available values displayed in the filter.
ru: Добавьте предложения фильтра, чтобы управлять исходным запросом фильтра, хотя только в контексте автозаполнения, то есть эти условия \ n не влияют на то, как фильтр применяется к панели панели.

source: Pre-filter
ru: Предварительная фильтрация

source: No filter
ru: Без фильтра

source: Sort filter values
ru: Сортировать отфильтрованные значения

source: Sort type
ru: Тип сортировки

source: Sort ascending
ru: Сортировать по возрастанию

source: Sort Metric
ru: Мера для сортировки

source: If a metric is specified, sorting will be done based on the metric value
ru: Если мера задана, сортировка будет произведена на основании значений меры

source: Sort metric
ru: Показатель для сортировки

source: Single Value
ru: Одиночное значение

source: Single value type
ru: Тип одиночного значения

source: Exact
ru: Точное

source: Filter has default value
ru: Фильтр имеет значение по умолчанию

source: Default Value
ru: Значение по умолчанию

source: Default value is required
ru: Требуется значение по умолчанию

source: Refresh the default values
ru: Обновить значения по умолчанию

source: Fill all required fields to enable "Default Value"
ru: Укажите все необходимые поля

source: You have removed this filter.
ru: Вы удалили фильтр.

source: Restore Filter
ru: Восстановить фильтр

source: Column is required
ru: Столбец обязателен

source: Populate "Default value" to enable this control
ru: Заполнение \ "Значение по умолчанию "

source: Default value set automatically when "Select first filter value by default" is checked
ru: Значение по умолчанию задается автоматически, когда установлен флаг "Сделать первое значение фильтра значением по умолчанию"

source: Default value must be set when "Filter value is required" is checked
ru: Значение по умолчанию должно быть выбрано, когда установлен флаг "Требуется значение фильтра"

source: Default value must be set when "Filter has default value" is checked
ru: Значение по умолчанию должно быть выбрано, когда установлен флаг "Фильтр имеет значение по умолчанию"

source: Apply to all panels
ru: Применить ко всем панелям

source: Apply to specific panels
ru: Применить к выбранным панелям

source: Only selected panels will be affected by this filter
ru: Фильтр будет применён только к выбранным панелям

source: All panels with this column will be affected by this filter
ru: Фильтр будет применён ко всем панелям с этим столбцом

source: All panels
ru: Все панели

source: This chart might be incompatible with the filter (datasets don't match)
ru: Этот график может быть несовместим с этим фильтром (датасеты не совпадают)

source: Keep editing
ru: Продолжить редактирование

source: Yes, cancel
ru: Да, отменить

source: There are unsaved changes.
ru: У вас есть несохраненные изменения.

source: Are you sure you want to cancel?
ru: Вы уверены, что хотите отменить?

source: Error loading chart datasources. Filters may not work correctly.
ru: Ошибка загрузки источников данных для графиков. Фильтры могут работать некорректно.

source: Error loading chart filter sets. Primary filter set won't be applied.
ru: Наборы фильтров с ошибкой загрузки.

source: Transparent
ru: Прозрачный

source: White
ru: Белый

source: All filters
ru: Все фильтры

source: Click to edit %s.
ru: Нажмите для редактирования %s.

source: Click to edit chart.
ru: Нажмите для редактирования графика.

source: Use %s to open in a new tab.
ru: Используйте %s для открытия в отдельной вкладке.

source: Medium
ru: Средний

source: New header
ru: Новый заголовок

source: Tab title
ru: Имя вкладки

source: This page is intended to be embedded in an iframe, but it looks like that is not the case.
ru: Эта страница предназначена для включения в iframe, но похоже, что это не так.

source: This session has encountered an interruption, and some controls may not work as intended. If you are the developer of this app, please check that the guest token is being generated correctly.
ru: Эта сессия столкнулась с перерывом, и некоторые элементы управления могут не работать, как предполагалось.

source: Something went wrong with embedded authentication. Check the dev console for details.
ru: Что -то пошло не так со встроенной аутентификацией.

source: Equal to (=)
ru: Равен (=)

source: Not equal to (≠)
ru: Не равно (≠)

source: Less than (<)
ru: Меньше, чем (<)

source: Less or equal (<=)
ru: Меньше или равных (<=)

source: Greater than (>)
ru: Больше, чем (>)

source: Greater or equal (>=)
ru: Больше или равен (> =)

source: In
ru: В

source: Not in
ru: не в

source: Like
ru: Как

source: Like (case insensitive)
ru: Like (нечувствительна к регистру)

source: Is not null
ru: не нулевой

source: Is null
ru: Это null

source: use latest_partition template
ru: используйте шаблон latest_partition

source: Is true
ru: Это правда

source: Is false
ru: Это false

source: Time granularity
ru: Гранулярность времени

source: One or many columns to group by. High cardinality groupings should include a series limit to limit the number of fetched and rendered series.
ru: один или много столбцов для группы. Один или несколько столбцов для группировки. Столбцы с множеством уникальных значений должны включать порог количества категорий для снижения нагрузку на базу данных и на ускорения отображения графика.

source: One or many metrics to display
ru: Выберите одну или несколько мер для отображения

source: Fixed color
ru: Фиксированный цвет

source: Right axis metric
ru: Мера для правой оси

source: Choose a metric for right axis
ru: Выберите меру для правой оси

source: Linear color scheme
ru: Линейная цветовая схема

source: Color metric
ru: Мера для цвета

source: One or many controls to pivot as columns
ru: один или много элементов управления Pivot в качестве столбцов

source: The time granularity for the visualization. Note that you can type and use simple natural language as in `10 seconds`,`1 day` or `56 weeks`
ru: Время гранулярность для визуализации. Интервал времени, в границах которого строится график. Обратите внимание, что для определения диапазона времени, вы можете использовать естественный язык. Например, можно указать словосочетания - «10 seconds», «1 day» или «56 weeks»

source: The time granularity for the visualization. This applies a date transformation to alter your time column and defines a new time granularity. The options here are defined on a per database engine basis in the Superset source code.
ru: Время гранулярности для визуализации. Детализация времени для визуализации. Применяется преобразование столбца с датой/временем и определяется новая детализация (минута, день, год, и т.п.). Доступные варианты заданы в исходном коде Superset для каждого типа драйвера базы данных.

source: The time range for the visualization. All relative times, e.g. "Last month", "Last 7 days", "now", etc. are evaluated on the server using the server's local time (sans timezone). All tooltips and placeholder times are expressed in UTC (sans timezone). The timestamps are then evaluated by the database using the engine's local timezone. Note one can explicitly set the timezone per the ISO 8601 format if specifying either the start and/or end time.
ru: Диапазон времени для визуализации. Все относительные времена, например «Последний месяц», «Последние 7 дней», «Сейчас» и т. д., оцениваются на сервере по местному времени сервера (без учета часового пояса). Все всплывающие подсказки и временные метки выражаются в UTC (без учета часового пояса). Временные метки затем оцениваются базой данных с использованием локального часового пояса движка. Обратите внимание, что при указании начального и/или конечного времени можно явно задать часовой пояс в соответствии с форматом ISO 8601.

source: Limits the number of rows that get displayed.
ru: Ограничивает количество отображаемых строк

source: Metric used to define how the top series are sorted if a series or row limit is present. If undefined reverts to the first metric (where appropriate).
ru: Мера, используемая для определения того, как сортируются верхние категории, если присутствует ограничение по категории или строке. Если не определено, возвращается к первой мере (где это уместно).

source: Defines the grouping of entities. Each series is shown as a specific color on the chart and has a legend toggle
ru: Группировка в ряды данных. Каждая категория отображается в виде определенного цвета на графике и имеет легенду

source: Metric assigned to the [X] axis
ru: Показатель, отраженный на оси X

source: Metric assigned to the [Y] axis
ru: Показатель, отраженный на оси Y

source: Bubble size
ru: Размер маркера

source: When `Calculation type` is set to "Percentage change", the Y Axis Format is forced to `.1%`
ru: Когда `Тип расчёта` установлен в "Процентное изменение", формат оси Y устанавливается в `.1%`

source: An error occurred while starring this chart
ru: Произошла ошибка при добавлении графика в избранное

source: Chart [%s] has been saved
ru: График [%s] сохранен

source: Chart [%s] has been overwritten
ru: График [%s] перезаписан

source: Dashboard [%s] just got created and chart [%s] was added to it
ru: Дашборд [%s] был только что создан и график [%s] был добавлен в него

source: Chart [%s] was added to dashboard [%s]
ru: График [%s] добавлен в дашборд [%s]

source: Use this section if you want a query that aggregates
ru: Используйте этот раздел, если вам нужен запрос, который агрегирует

source: NOT GROUPED BY
ru: не сгруппировано

source: Use this section if you want to query atomic rows
ru: Используйте этот раздел, если вы хотите запросить атомные ряды

source: Advanced analytics post processing
ru: Advanced Analytics после обработки

source: Shift start date
ru: Дата начала смены

source: The X-axis is not on the filters list
ru: Ось X не в списке фильтров.

source: The X-axis is not on the filters list which will prevent it from being used in time range filters in dashboards. Would you like to add it to the filters list?
ru: Ось X не находится в списке фильтров, который предотвратит его использование в фильтрах временного диапазона на дашбордах.

source: You cannot delete the last temporal filter as it's used for time range filters in dashboards.
ru: Вы не можете удалить последний височный фильтр, поскольку он используется для фильтров диапазона времени на панели мониторинга.

source: This section contains validation errors
ru: В этом разделе содержатся ошибки валидации

source: Keep control settings?
ru: Оставить прежние настройки?

source: You've changed datasets. Any controls with data (columns, metrics) that match this new dataset have been retained.
ru: Вы изменили датасеты. Все элементы управления с данными (столбцами, мерами), которые соответствуют новому датасету, были сохранены.

source: Continue
ru: Продолжить

source: Clear form
ru: Очистить форму

source: No form settings were maintained
ru: Конфигурация графика не сохранилась

source: We were unable to carry over any controls when switching to this new dataset.
ru: Не удалось перенести настройки прошлого графика при переключении датасета.

source: Data
ru: Данные

source: Customize
ru: Кастомизация

source: Generating link, please wait..
ru: Генерация ссылки, пожалуйста, ждите...

source: Chart height
ru: Высота графика

source: Chart width
ru: Ширина графика

source: An error occurred while loading dashboard information.
ru: Произошла ошибка при загрузке информации о панели инструментов.

source: Save (Overwrite)
ru: Сохранить (Перезаписать)

source: Save as...
ru: Сохранить как...

source: Chart name
ru: Имя графика

source: Dataset Name
ru: Имя датасета

source: A reusable dataset will be saved with your chart.
ru: Переиспользуемый датасет будет сохранен с вашим графиком.

source: Add to dashboard
ru: Добавить в дашборд

source: Select a dashboard
ru: Выбрать дашборд

source: Select
ru: Выбрать

source: a dashboard OR
ru: дашборд или

source: create
ru: создать

source: a new one
ru: новый

source: A new chart and dashboard will be created.
ru: будет создан новый диаграмма и панель панели.

source: A new chart will be created.
ru: будет создан новый график.

source: A new dashboard will be created.
ru: будет создана новая панель инструментов.

source: Save & go to dashboard
ru: Сохранить и перейти к дашборду

source: Save chart
ru: Сохранить график

source: Formatted date
ru: Форматированная дата

source: Column Formatting
ru: Форматирование столбца(ов)

source: Collapse data panel
ru: Свернуть панель управления

source: Expand data panel
ru: Расширить панель данных

source: Samples
ru: Примеры данных

source: No samples were returned for this dataset
ru: Не было получено данных для этого датасета

source: No results
ru: Нет результатов

source: Showing %s of %s
ru: Отображено %s из %s

source: %s ineligible item(s) are hidden
ru: %s неконкулируемые предметы (ы) скрыты

source: Show less...
ru: Показать меньше...

source: Show all...
ru: Показать все...

source: Search Metrics & Columns
ru: Поиск по мерам и столбцам

source: Create a dataset
ru: Создать датасет

source: to edit or add columns and metrics.
ru: для редактирования или добавления столбцов и мер.

source: Unable to retrieve dashboard colors
ru: Не удалось получать цветовую схему дашборда

source: Added to 1 dashboard
ru: Добавлено к 1 дашборд

source: Not added to any dashboard
ru: Не добавлен ни в один дашборд

source: You can preview the list of dashboards in the chart settings dropdown.
ru: Вы можете предварительно просмотреть список панелей мониторинга в раскрывающемся списке настройки диаграммы.

source: Add the name of the chart
ru: Задайте имя графика

source: Chart title
ru: Название графика

source: Add required control values to save chart
ru: Добавьте обязательные значения для сохранения графика

source: Chart type requires a dataset
ru: Для данного типа графика необходим датасет

source: to visualize your data.
ru: для визуализации ваших данных.

source: Required control values have been removed
ru: Обязательные значения были удалены

source: Your chart is not up to date
ru: Ваш график не актуален

source: You updated the values in the control panel, but the chart was not updated automatically. Run the query by clicking on the "Update chart" button or
ru: Вы обновили значения в панели управления, но график не был обновлен автоматически. Сделайте запрос, нажав на кнопку "Обновить график" или

source: Controls labeled
ru: Значения с именами

source: Control labeled
ru: Значение с именем

source: Chart Source
ru: Источник данных

source: Open Datasource tab
ru: Открыть вкладку источника данных

source: Original
ru: Исходные данные

source: Pivoted
ru: Сводные данные

source: You do not have permission to edit this chart
ru: У вас нет прав на редактирование этого графика

source: Chart properties updated
ru: Свойства графика обновлены

source: Edit Chart Properties
ru: Редактировать свойства графика

source: This chart is managed externally, and can't be edited in Superset
ru: Эта диаграмма управляется внешне и не может быть отредактирована в Superset

source: The description can be displayed as widget headers in the dashboard view. Supports markdown.
ru: Описание может быть отображено как заголовок графика в дашборде. Поддерживает markdown-разметку

source: Person or group that has certified this chart.
ru: Лицо или группа, которые утвердили этот график

source: Configuration
ru: Конфигурация

source: Duration (in seconds) of the caching timeout for this chart. Set to -1 to bypass the cache. Note this defaults to the dataset's timeout if undefined.
ru: Продолжительность (в секундах) тайм -аута кэширования для этой диаграммы.

source: A list of users who can alter the chart. Searchable by name or username.
ru: Список пользователей, которые могут изменять график. Можно искать по имени или имени пользователя.

source: The row limit set for the chart was reached. The chart may show partial data.
ru: Достигнут лимит строк, установленный для графика. На графике могут отображаться неполные данные.

source: Create chart
ru: Создать график

source: Update chart
ru: Обновить график

source: Actual range for comparison
ru: Фактический диапазон для сравнения

source: Invalid lat/long configuration.
ru: Неверная конфигурация широты и долготы.

source: Reverse lat/long
ru: Поменять местами широту и долготу

source: Longitude & Latitude columns
ru: Долгота и Широта

source: Delimited long & lat single column
ru: Долгота и широта в одном столбце

source: Multiple formats accepted, look the geopy.points Python library for more details
ru: Для уточнения форматов и получения более подробной информации, посмотрите Python-библиотеку geopy.points

source: textarea
ru: текстовая область

source: in modal
ru: в модальном окне
