Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: The datasource is too large to query.
ru: Источник данных слишком велик для запроса.

source: The database is under an unusual load.
ru: База данных испытывает необычную нагрузку.

source: The database returned an unexpected error.
ru: База данных вернула неожиданную ошибку.

source: There is a syntax error in the SQL query. Perhaps there was a misspelling or a typo.
ru: В запросе SQL есть синтаксическая ошибка. В SQL-запросе имеется синтаксическая ошибка. Возможно, это орфографическая ошибка или опечатка.

source: The column was deleted or renamed in the database.
ru: Столбец был удален или переименован в базе данных.

source: The table was deleted or renamed in the database.
ru: Таблица была удалена или переименована в базе данных.

source: One or more parameters specified in the query are missing.
ru: Один или несколько параметров, указанных в запросе, отсутствуют

source: The hostname provided can't be resolved.
ru: Не удалось обнаружить хост.

source: The port is closed.
ru: Порт закрыт.

source: The host might be down, and can't be reached on the provided port.
ru: Хост возможно, отключен, и с ним невозможно связаться по заданному порту.

source: Superset encountered an error while running a command.
ru: Суперсет столкнулся с ошибкой во время выполнения команды.

source: Superset encountered an unexpected error.
ru: Суперсет столкнулся с неожиданной ошибкой.

source: The username provided when connecting to a database is not valid.
ru: Имя пользователя, указанное при подключении к базе данных, недействительно

source: The password provided when connecting to a database is not valid.
ru: Неверный пароль для базы данных.

source: Either the username or the password is wrong.
ru: Неверное имя пользователя или пароль.

source: Either the database is spelled incorrectly or does not exist.
ru: Неверное или несуществующее имя базы данных.

source: The schema was deleted or renamed in the database.
ru: Схема была удалена или переименована в базе данных.

source: User doesn't have the proper permissions.
ru: У пользователя нет надлежащего доступа.

source: One or more parameters needed to configure a database are missing.
ru: Один или несколько параметров, необходимых для настройки базы данных, отсутствуют

source: The submitted payload has the incorrect format.
ru: Загруженные данные имеют некорректный формат.

source: The submitted payload has the incorrect schema.
ru: Загруженные данные имеют некорректную схему.

source: Results backend needed for asynchronous queries is not configured.
ru: Сервер, необходимый для асинхронных запросов, не настроен.

source: Database does not allow data manipulation.
ru: База данных не позволяет изменять свои данные.

source: The CTAS (create table as select) doesn't have a SELECT statement at the end. Please make sure your query has a SELECT as its last statement. Then, try running your query again.
ru: CTAS (Create Table As Select) не имеет оператора SELECT в конце. CTAS (CREATE TABLE AS SELECT) не содержит SELECT запрос в конце. Пожалуйста, убедитесь, что ваш запрос имеет SELECT запрос в конце. Затем попробуйте повторно выполнить запрос.

source: CVAS (create view as select) query has more than one statement.
ru: CVAS (CREATE VIEW AS SELECT) запрос содержит больше одного запроса.

source: CVAS (create view as select) query is not a SELECT statement.
ru: CVAS (CREATE VIEW AS SELECT) запрос не является SELECT запросом.

source: Query is too complex and takes too long to run.
ru: Запрос слишком тяжелый для выполнения и займет много времени.

source: The database is currently running too many queries.
ru: В настоящий момент база данных обрабатывает слишком много запросов.

source: One or more parameters specified in the query are malformed.
ru: Один или несколько параметров, указанных в запросе, являются искаженными.

source: The object does not exist in the given database.
ru: Объект не существует в этой базе данных.

source: The query has a syntax error.
ru: Запрос имеет синтаксическую ошибку.

source: The results backend no longer has the data from the query.
ru: Сервер не сохранил данные из этого запроса.

source: The query associated with the results was deleted.
ru: Запрос, связанный с результатами, был удален.

source: The results stored in the backend were stored in a different format, and no longer can be deserialized.
ru: Данные, сохраненные на сервере, имели другой формат, и не могут быть распознаны.

source: The port number is invalid.
ru: Недействительный порт.

source: Failed to start remote query on a worker.
ru: Не удалось запустить удаленный запрос на сервере.

source: The database was deleted.
ru: База данных была удалена.

source: Custom SQL fields cannot contain sub-queries.
ru: Пользовательские поля SQL не могут содержать подзапросы.

source: The submitted payload failed validation.
ru: отправленная полезная нагрузка не удалась.

source: Invalid certificate
ru: Неверный сертификат

source: The schema of the submitted payload is invalid.
ru: Схема представленной полезной нагрузки недействительна.

source: Error parsing
ru: Ошибка диапазона

source: near '%(highlight)s'
ru: почти ‘%(highlight)s'

source: at line %(line)d
ru: в линии %(line)d

source: Unsafe return type for function %(func)s: %(value_type)s
ru: Небезопасный возвращаемый тип для функции %(func)s: %(value_type)s

source: Unsupported return value for method %(name)s
ru: Неподдерживаемое значение для метода %(name)s

source: Unsafe template value for key %(key)s: %(value_type)s
ru: Небезопасное значение шаблона для ключа %(key)s: %(value_type)s

source: Unsupported template value for key %(key)s
ru: Неподдерживаемое значение шаблона для ключа %(key)s

source: Please specify the Dataset ID for the ``%(name)s`` metric in the Jinja macro.
ru: Укажите идентификатор Датасета для метрики ``%(name)s`` в макросе Jinja.

source: Metric ``%(metric_name)s`` not found in %(dataset_name)s.
ru: Метрика `` %(metric_name) s`` не найдена в %(dataset_name)s.

source: Viz is missing a datasource
ru: У визуализации отсутствует источник данных

source: Applied rolling window did not return any data. Please make sure the source query satisfies the minimum periods defined in the rolling window.
ru: Применяемое окно проката не вернуло никаких данных. Применное скользязее окно не вернуло данных. Убедитесь, что исходный запрос удовлетворяет минимальному количеству периодов скользящего окна.

source: From date cannot be larger than to date
ru: Дата начала не может быть позже даты конца

source: Cached value not found
ru: Кэшированное значение не найдено

source: Columns missing in datasource: %(invalid_columns)s
ru: Столбцы отсутствуют в источнике данных: %(invalid_columns)s

source: Time Table View
ru: Предпросмотр временной таблицы

source: Pick at least one metric
ru: Выберите хотя бы одну меру

source: When using 'Group By' you are limited to use a single metric
ru: При использовании 'GROUP BY' вы ограничены использованием одной меры

source: Calendar Heatmap
ru: Календарная тепловая карта

source: Bubble Chart
ru: Пузырьковая диаграмма

source: Please use 3 different metric labels
ru: Пожалуйста, используйте 3 разных названия метрики

source: Pick a metric for x, y and size
ru: Выберите меру для x, y и размера

source: Bullet Chart
ru: Диаграмма-шкала

source: Pick a metric to display
ru: Выберите меру для отображения

source: Time Series - Line Chart
ru: Линейная диаграмма (временные ряды)

source: An enclosed time range (both start and end) must be specified when using a Time Comparison.
ru: При условии использования временного сравнения должен быть указан закрытый временной диапазон.При использовании сравнения времени необходимо указать закрытый временной интервал (как начало, так и конец).

source: Time Series - Bar Chart
ru: Столбчатая диаграмма (временные ряды)

source: Time Series - Period Pivot
ru: Парный t-test (временные ряды)

source: Time Series - Percent Change
ru: Периодическая сводка (временные ряды)

source: Time Series - Stacked
ru: Диаграмма с накоплением (временные ряды)

source: Histogram
ru: Гистограмма

source: Must have at least one numeric column specified
ru: Должен быть указан хотя бы один числовой столбец

source: Distribution - Bar Chart
ru: Распределение - Столбчатая диаграмма

source: Can't have overlap between Series and Breakdowns
ru: Нельзя иметь пересечение между Сериями и Разбивками

source: Pick at least one field for [Series]
ru: Выберите хотя бы одно поле для [Серии]

source: Sankey
ru: Санкей

source: Pick exactly 2 columns as [Source / Target]
ru: Выберите ровно 2 столбца как [Источник / Цель]

source: There's a loop in your Sankey, please provide a tree. Here's a faulty link: {}
ru: В вашем Санки есть петля, пожалуйста, предоставьте дерево. В вашем Санкее обнаружен цикл, пожалуйста, предоставьте дерево. Вот неправильная связь: {}

source: Directed Force Layout
ru: Ориентированная сила размещения

source: Country Map
ru: Карта Стран

source: World Map
ru: Карта Мира

source: Parallel Coordinates
ru: Параллельные координаты

source: Heatmap
ru: Тепловая карта

source: [Longitude] and [Latitude] must be set
ru: [Долгота] и [Широта] должны быть заданы

source: Must have a [Group By] column to have 'count' as the [Label]
ru: Должен быть столбец [Группировать по], чтобы использовать 'количество' как [Метку]

source: Choice of [Label] must be present in [Group By]
ru: [Метка] должна присутствовать в [Группировать по]

source: Choice of [Point Radius] must be present in [Group By]
ru: [Радиус точки] должен присутствовать в [Группировать по]

source: [Longitude] and [Latitude] columns must be present in [Group By]
ru: Столбцы [Долгота] и [Широта] должны присутствовать в [Группировать по]

source: Bad spatial key
ru: Неподходящий пространственный ключ

source: Invalid spatial point encountered: %(latlong)s
ru: Обнаружен недопустимый пространственный пункт: %(latlong)s

source: Encountered invalid NULL spatial entry, please consider filtering those out
ru: Встретились недопустимые пространственные записи NULL, пожалуйста, рассмотрите возможность фильтрации таких записей

source: Time Series - Paired t-test
ru: Парный t-test (временные ряды)

source: Time Series - Nightingale Rose Chart
ru: Диаграмма Найтингейл (временные ряды)

source: Please choose at least one groupby
ru: Выберите хотя бы один параметр группировки

source: Invalid advanced data type: %(advanced_data_type)s
ru: Невалидный расширенный тип данных: %(advanced_data_type)s

source: Deleted %(num)d annotation layer
ru: Удалален %(num)d слой аннотаций

source: All Text
ru: Весь текст

source: Deleted %(num)d annotation
ru: Удалалена %(num)d аннотация

source: Deleted %(num)d chart
ru: Удален %(num)d график

source: Is certified
ru: Одобрено

source: Has created by
ru: Создан(а)

source: Created by me
ru: Создано мной

source: Owned Created or Favored
ru: Принадлежащий созданный или любимый

source: `confidence_interval` must be between 0 and 1 (exclusive)
ru: `confidence_interval` должен быть между 0 и 1 (не включая концы)

source: lower percentile must be greater than 0 and less than 100. Must be lower than upper percentile.
ru: более низкий процентиль должен быть больше 0 и менее 100. должен быть ниже, чем в верхнем процентиле.Нижний процентиль должен быть больше 0 и меньше 100. Должен быть ниже верхнего процентиля

source: upper percentile must be greater than 0 and less than 100. Must be higher than lower percentile.
ru: Верхний процентиль должен быть превышает 0 и менее 100. должен быть выше, чем более низкий процентиль.верхний процентиль должен быть больше 0 и меньше 100. Должен быть выше нижнего процентиля.

source: `width` must be greater or equal to 0
ru: `width` должeн быть больше или равна 0

source: `row_limit` must be greater than or equal to 0
ru: `row_limit` должно быть больше или равно 0

source: `row_offset` must be greater than or equal to 0
ru: `row_offset` должно быть больше или равно 0

source: orderby column must be populated
ru: Порядок столбца должен быть заполнен

source: Chart has no query context saved. Please save the chart again.
ru: На графике не сохранен контекст запроса. Пожалуйста, сохраните диаграмму еще раз.

source: Request is incorrect: %(error)s
ru: Неверный запрос: %(error)s

source: Request is not JSON
ru: Запрос не является JSON

source: Empty query result
ru: Пустой ответ запроса

source: Owners are invalid
ru: Неверный список владельцев

source: Some roles do not exist
ru: Некоторые роли не существуют

source: Datasource type is invalid
ru: Тип источниках данных неверный

source: Datasource does not exist
ru: Источник данных не существует

source: Query does not exist
ru: Запрос не существует

source: Annotation layer parameters are invalid.
ru: Параметры слоя аннотаций недействительны

source: Annotation layer could not be created.
ru: Не удалось создать слой аннотации.

source: Annotation layer could not be updated.
ru: Не удалось обновить слой аннотации.

source: Annotation layer not found.
ru: Слой аннотации не найден.

source: Annotation layers could not be deleted.
ru: Аннотация нельзя удалить.

source: Annotation layer has associated annotations.
ru: Слои аннотаций имеет связанные аннотации.

source: Name must be unique
ru: Имя должно быть уникальным

source: End date must be after start date
ru: Дата окончания должна быть позже даты начала

source: Short description must be unique for this layer
ru: Содержимое аннотации должно быть уникальным внутри слоя

source: Annotation not found.
ru: Аннотация не найдена.

source: Annotation parameters are invalid.
ru: Параметры аннотации недействительны.

source: Annotation could not be created.
ru: Не удалось создать аннотацию

source: Annotation could not be updated.
ru: Не удалось обновить аннотацию

source: Annotations could not be deleted.
ru: Не удалось удалить аннотации.

source: There are associated alerts or reports: %(report_names)s
ru: Существуют связанные оповещения или отчеты: %(report_names)s

source: Time string is ambiguous. Please specify [%(human_readable)s ago] or [%(human_readable)s later].
ru: Строка времени неоднозначна. Временная строка неоднозначна. Пожалуйста, укажите [%(human_readable)s до] или [%(human_readable)s после].

source: Cannot parse time string [%(human_readable)s]
ru: Не удается разобрать временную строку [%(human_readable)s]

source: Time delta is ambiguous. Please specify [%(human_readable)s ago] or [%(human_readable)s later].
ru: Время Дельта неоднозначна. Неоднозначный временной сдвиг. Пожалуйста, укажите [%(human_readable)s до] или [%(human_readable)s после].

source: Database does not exist
ru: База данных не существует

source: Dashboards do not exist
ru: Дашборды не существуют

source: Datasource type is required when datasource_id is given
ru: Тип данных требуется, когда дается dataSource_idТип источника данных обязателен, когда дан идентификатор источника данных (datasource_id)

source: Chart parameters are invalid.
ru: Параметры графика недопустимы.

source: Chart could not be created.
ru: Не удалось создать график

source: Chart could not be updated.
ru: Не удалось обновить график

source: Charts could not be deleted.
ru: Не удалось удалить графики.

source: There are associated alerts or reports
ru: Есть связанные оповещения или отчеты

source: You don't have access to this chart.
ru: Недостаточно прав для доступа к этому графику.

source: Changing this chart is forbidden
ru: Запрещено изменять этот график

source: Import chart failed for an unknown reason
ru: Не удалось импортировать график по неизвестной причине

source: Changing one or more of these dashboards is forbidden
ru: Изменение одной или нескольких из этих мониторинга запрещено

source: Chart not found
ru: График не найден

source: Error faving chart
ru: Ошибка блюда

source: Error unfaving chart
ru: Ошибка удаления графика из избранного

source: Error: %(error)s
ru: Ошибка: %(error)s

source: CSS templates could not be deleted.
ru: Шаблоны CSS не могут быть удалены.

source: CSS template not found.
ru: CSS шаблон не найден.

source: Must be unique
ru: Должно быть уникальным

source: Dashboard parameters are invalid.
ru: Неверные параметры дашборда.

source: Dashboards could not be created.
ru: Монитонные панели не могут быть созданы.

source: Dashboard could not be updated.
ru: Не удалось обновить дашборд

source: Dashboard could not be deleted.
ru: Не удалось удалить дашборд

source: Embedded dashboard could not be deleted.
ru: встроенная панель мониторинга не может быть удалена.

source: Changing this Dashboard is forbidden
ru: Запрещено изменять этот дашборд

source: Import dashboard failed for an unknown reason
ru: Не удалось импортировать дашборд по неизвестной причине

source: You don't have access to this dashboard.
ru: Недостаточно прав для доступа к этому дашборду.

source: Dashboard cannot be copied due to invalid parameters.
ru: Панель панели не может быть скопирована из -за неверных параметров.

source: Dashboard cannot be favorited.
ru: Панель панели не может быть влюблена.

source: Dashboard cannot be unfavorited.
ru: Панель панели не может быть не поддержана.

source: You don't have access to this embedded dashboard config.
ru: У вас нет прав на редактирование этого встраиваемого дашборда.

source: No data in file
ru: В файле нет данных

source: Database parameters are invalid.
ru: Параметры базы данных недействительны.

source: A database with the same name already exists.
ru: База данных с таким же именем уже существует

source: Field is required
ru: Поле обязательно к заполнению

source: Field cannot be decoded by JSON. %(json_error)s
ru: Поле не может быть декодировано с помощью JSON. %(json_error)s

source: The metadata_params in Extra field is not configured correctly. The key %{key}s is invalid.
ru: Metadata_Params в дополнительном поле настроено неправильно. Ключ %{key}s некорректный.

source: Database not found.
ru: База данных не найдена.

source: Database schema is not allowed for csv uploads.
ru: Схема базы данных не допускается для загрузки CSV.

source: Database type does not support file uploads.
ru: Тип базы данных не поддерживает загрузки файлов.

source: Database upload file failed
ru: Файл загрузки базы данных не удался

source: Database upload file failed, while saving metadata
ru: Файл загрузки базы данных не удался, при сохранении метаданных

source: Database could not be created.
ru: Не удалось создать базу данных.

source: Database could not be updated.
ru: Не удалось обновить базу данных.

source: Connection failed, please check your connection settings
ru: Сбой подключения, пожалуйста, проверьте настройки вашего подключения

source: Cannot delete a database that has datasets attached
ru: Невозможно удалить базу данных с подключенными датасетами

source: Database could not be deleted.
ru: Не удалось удалить базу данных.

source: Stopped an unsafe database connection
ru: остановил небезопасное соединение базы данных

source: Could not load database driver
ru: Не удалось загрузить драйвер базы данных

source: Unexpected error occurred, please check your logs for details
ru: Произошла неожиданная ошибка, пожалуйста, проверьте свои журналы для получения подробной информацииВозникла неожиданная ошибка, пожалуйста, проверьте историю действий для уточнения деталей

source: no SQL validator is configured
ru: не настроен ни один SQL валидатор

source: No validator found (configured for the engine)
ru: Не найден валидатор (сконфигурированный для драйвера)

source: Was unable to check your query
ru: Не удалось проверить запрос

source: An unexpected error occurred
ru: Произошла неожиданная ошибка

source: Import database failed for an unknown reason
ru: Не удалось импортировать базу данных по неизвестной причине

source: Could not load database driver: {}
ru: Не удалось загрузить драйвер базы данных: {}

source: SSH Tunnel could not be deleted.
ru: Не удалось удалить SSH туннель.

source: SSH Tunnel not found.
ru: SSH туннель не найден.

source: SSH Tunnel parameters are invalid.
ru: Параметры SSH туннеля недопустимы.

source: A database port is required when connecting via SSH Tunnel.
ru: При подключении через туннель SSH требуется порт базы данных.

source: SSH Tunnel could not be updated.
ru: Не удалось обновить SSH туннель.

source: Creating SSH Tunnel failed for an unknown reason
ru: Не удалось создать SSH туннель по неизвестной причине

source: SSH Tunneling is not enabled
ru: туннелирование SSH не включено

source: Must provide credentials for the SSH Tunnel
ru: Должен предоставить учетные данные для туннеля SSH

source: Cannot have multiple credentials for the SSH Tunnel
ru: не может иметь несколько учетных данных для туннеля SSH

source: Table already exists. You can change your 'if table already exists' strategy to append or replace or provide a different Table Name to use.
ru: Таблица уже существует. Вы можете изменить стратегию «если таблица уже существует» на добавление или замену или указать другое имя таблицы для использования.

source: Parsing error: %(error)s
ru: Ошибка Парсинга: %(error)s

source: Error reading Columnar file
ru: Ошибка загрузки Columnar

source: Unexpected no file extension found
ru: Неожиданно не найдено расширение файла

source: Not a valid ZIP file
ru: Не действительный zip -файл

source: ZIP file contains multiple file types
ru: zip -файл содержит несколько типов файлов

source: Error reading CSV file
ru: Ошибка чтения файла CSV

source: Error reading Excel file
ru: Ошибка чтения файла Excel

source: Excel file format cannot be determined
ru: Формат файла Excel не может быть определен

source: Dataset %(table)s already exists
ru: Дотаяет %(table)s уже существует

source: Database not allowed to change
ru: База данных недоступна для изменений

source: One or more columns do not exist
ru: Один или несколько столбцов не существуют

source: One or more columns are duplicated
ru: Один или несколько столбцов дублируются

source: One or more columns already exist
ru: Один или несколько столбцов уже существуют

source: One or more metrics do not exist
ru: Одна или несколько мер не существуют

source: One or more metrics are duplicated
ru: Одна или несколько мер дублируются

source: One or more metrics already exist
ru: Одна или несколько мер уже существуют

source: Table [%(table)s] could not be found, please double check your database connection, schema, and table name
ru: Таблица [%(table)s] не может быть найдена, пожалуйста, дважды проверьте соединение базы данных, схема и имя таблицы

source: Dataset does not exist
ru: Датасет не существует

source: Dataset parameters are invalid.
ru: Параметры датасета неверны.

source: Dataset could not be created.
ru: Не удалось создать датасет

source: Dataset could not be updated.
ru: Не удалось обновить датасет

source: Datasets could not be deleted.
ru: Наборы данных не могут быть удалены.

source: Samples for dataset could not be retrieved.
ru: Не удалось получить примеры записей датасета.

source: Changing this dataset is forbidden
ru: Запрещено изменять этот датасет

source: Import dataset failed for an unknown reason
ru: Не удалось импортировать датасет по неизвестной причине

source: You don't have access to this dataset.
ru: Недостаточно прав для доступа к этому датасету.

source: Dataset could not be duplicated.
ru: Датасет не может быть дублирован.

source: Data URI is not allowed.
ru: Data URI не допускается.

source: The provided table was not found in the provided database
ru: Предоставленная таблица не была найдена в предоставленной базе данных

source: Dataset column not found.
ru: Столбец датасета не найден.

source: Dataset column delete failed.
ru: Не удалось удалить столбец датасета

source: Changing this dataset is forbidden.
ru: Запрещено изменять данный датасет.

source: Dataset metric not found.
ru: Мера датасета не найдена.

source: Dataset metric delete failed.
ru: Не удалось удалить меру датасета.
