Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Condition
ru: Условие

source: Customize data source, filters, and layout.
ru: Настройте источник данных, фильтры и макет.

source: Content type
ru: Тип содержания

source: Select content type
ru: Выбрать тип содержания

source: Select chart to use
ru: Выберать график

source: Select dashboard
ru: Выбрать дашборд

source: Select dashboard to use
ru: Выбрать дашборд

source: Content format
ru: Формат содержания

source: Select format
ru: Выбрать формат

source: Screenshot width
ru: Ширина скриншота

source: Input custom width in pixels
ru: Ввод пользовательской ширины в пикселях

source: Ignore cache when generating report
ru: Игнорировать кэш при создании отчета

source: Define delivery schedule, timezone, and frequency settings.
ru: Определить расписание доставки, часовой пояс и настройки частоты.

source: Timezone
ru: Часовой пояс

source: Log retention
ru: Хранение журнала

source: Working timeout
ru: Время на рассылку

source: Time in seconds
ru: Время в секундах

source: seconds
ru: секунд

source: Grace period
ru: Перерыв между оповещением

source: Choose notification method and recipients.
ru: Выберите способ уведомления и получателей.

source: Recurring (every)
ru: Повторяющийся (каждый раз)

source: CRON Schedule
ru: CRON расписание

source: Schedule type
ru: Тип расписания

source: CRON expression
ru: CRON выражение

source: Report sent
ru: Отчет отправлен

source: Alert triggered, notification sent
ru: Сработало оповещение, уведомление отправлено

source: Report sending
ru: Отчет выполняется

source: Alert running
ru: Выполняется оповещение

source: Report failed
ru: Рассылка не удалась

source: Alert failed
ru: Оповещение не сработало

source: Nothing triggered
ru: Не срабатывало

source: Alert Triggered, In Grace Period
ru: Оповещение сработало во время перерыва

source: CC recipients
ru: Получатели CC

source: BCC recipients
ru: BCC получатели

source: Email subject name (optional)
ru: Название темы электронного письма (необязательно)

source: Please enter valid text. Spaces alone are not permitted.
ru: Пожалуйста, введите действительный текст.

source: Private Channels (Bot in channel)
ru: частные каналы (бот в канале)

source: Notification Method
ru: Способ уведомления

source: Delivery method
ru: Способ оповещения

source: Select Delivery Method
ru: Выберите способ оповещения

source: %s recipients
ru: %s получателей

source: Recipients are separated by "," or ";"
ru: Получатели, разделенные "," или ";"

source: Select channels
ru: Выберать каналы

source: Add CC Recipients
ru: Добавить получателей CC

source: Add BCC Recipients
ru: Добавить получателей BCC

source: Queries
ru: Запросы

source: No entities have this tag currently assigned
ru: Ни одной сущности не присвоен этот тег

source: Add tag to entities
ru: Добавить тег к сущности

source: annotation_layer
ru: слой_аннотации

source: Annotation template updated
ru: Шаблон аннотации обновлен

source: Annotation template created
ru: Шаблон аннотации создан

source: Edit annotation layer properties
ru: Редактировать свойства слоя аннотаций

source: Annotation layer name
ru: Имя слоя аннотаций

source: Description (this can be seen in the list)
ru: Описание (будет видно в списке)

source: annotation
ru: аннотация

source: The annotation has been updated
ru: Аннотация обновлена

source: The annotation has been saved
ru: Аннотация сохранена

source: Edit annotation
ru: Редактировать аннотацию

source: Add annotation
ru: Добавить аннотацию

source: date
ru: дата

source: Additional information
ru: Дополнительная информация

source: Please confirm
ru: Пожалуйста, подтвердите действие

source: Are you sure you want to delete
ru: Вы уверены, что хотите удалить

source: Export
ru: Экспортировать

source: Modified %s
ru: Изменено %s

source: Edit CSS template properties
ru: Редактировать свойств CSS шаблона

source: Add CSS template
ru: Добавить CSS шаблоны

source: published
ru: опубликовано

source: draft
ru: черновик

source: SQL Lab
ru: Лаборатория SQL

source: Adjust how this database will interact with SQL Lab.
ru: Настройка взаимодействия базы данных с Лабораторией SQL

source: Expose database in SQL Lab
ru: Предоставить доступ к базе в Лаборатории SQL

source: Allow this database to be queried in SQL Lab
ru: Разрешить запросы к этой базе данных в Лаборатории SQL

source: Allow creation of new tables based on queries
ru: Разрешить создание новых таблиц на основе запросов

source: Allow creation of new views based on queries
ru: Разрешить создание новых представлений на основе запросов

source: CTAS & CVAS SCHEMA
ru: СХЕМА CTAS & CVAS

source: Create or select schema...
ru: Создать или выбрать схему...

source: Force all tables and views to be created in this schema when clicking CTAS or CVAS in SQL Lab.
ru: Принудить создание новых таблиц через CTAS или CVAS в Лаборатории SQL в этой схеме при нажатии соответствующих кнопок

source: Allow DDL and DML
ru: Разрешить DDL и DML

source: Allow the execution of DDL (Data Definition Language: CREATE, DROP, TRUNCATE, etc.) and DML (Data Modification Language: INSERT, UPDATE, DELETE, etc)
ru: Разрешить выполнение DDL (Data Definition Language: CREATE, DROP, TRUNCATE и т.д.) и DML (Data Modification Language: INSERT, UPDATE, DELETE и т.д.).

source: Enable query cost estimation
ru: Разрешить оценку стоимости запроса

source: For Bigquery, Presto and Postgres, shows a button to compute cost before running a query.
ru: Для Bigquery, Presto и Postgres, показывать кнопку подсчета стоимости запроса перед его выполнением.

source: Allow this database to be explored
ru: Разрешить изучение этой базы данных

source: When enabled, users are able to visualize SQL Lab results in Explore.
ru: Если этот параметр включен, пользователи могут смотреть ответ запросов Лаборатории SQL в режиме исследования.

source: Disable SQL Lab data preview queries
ru: Отключить предпросмотр данных в Лаборатории SQL

source: Disable data preview when fetching table metadata in SQL Lab. Useful to avoid browser performance issues when using databases with very wide tables.
ru: Отключить предварительный просмотр данных при извлечении метаданных таблицы в SQL Lab. Отключить предварительный просмотр данных при извлечении метаданных таблицы в SQL Lab. Полезно для избежания проблем с производительностью браузера при использовании баз данных с очень широкими таблицами.

source: Enable row expansion in schemas
ru: Включить расширение строк в схемах

source: For Trino, describe full schemas of nested ROW types, expanding them with dotted paths
ru: Для Trino опишите полные схемы вложенных типов ROW, расширяя их с помощью пунктирных линий

source: Performance
ru: Производительность

source: Adjust performance settings of this database.
ru: Настроить параметры производительности этой базы данных.

source: Chart cache timeout
ru: Время жизни кэша графика

source: Enter duration in seconds
ru: Введите время в секундах

source: Duration (in seconds) of the caching timeout for charts of this database. A timeout of 0 indicates that the cache never expires, and -1 bypasses the cache. Note this defaults to the global timeout if undefined.
ru: Продолжительность (в секундах) тайм -аута кэширования для диаграмм этой базы данных. Длительность (в секундах) таймаута кэширования для графиков этой базы данных. Таймаут 0 означает, что кэш никогда не истекает, а -1 обходит кэш. Если значение не определено, по умолчанию используется глобальный таймаут.

source: Schema cache timeout
ru: Время жизни кэша схемы

source: Duration (in seconds) of the metadata caching timeout for schemas of this database. If left unset, the cache never expires.
ru: Продолжительность (в секундах) таймаута кэша для схем этой базы данных. Обратите внимание, что если значение не задано, кэш никогда не очистится.

source: Table cache timeout
ru: Время жизни кэша таблицы

source: Asynchronous query execution
ru: Асинхронное выполнение запросов

source: This option has been disabled by the administrator.
ru: Администратор отключен этот вариант.

source: Cancel query on window unload event
ru: Отменять запрос при закрытии вкладки

source: Terminate running queries when browser window closed or navigated to another page. Available for Presto, Hive, MySQL, Postgres and Snowflake databases.
ru: Завершать выполнение запросов после закрытия браузерной вкладки или пользователь переключился на другую вкладку. Доступно для баз данных Presto, Hive, MySQL, Postgres и Snowflake.

source: Security
ru: Безопасность

source: Add extra connection information.
ru: Добавить дополнительную информация по подключению.

source: Secure extra
ru: Безопасность

source: JSON string containing additional connection configuration. This is used to provide connection information for systems like Hive, Presto and BigQuery which do not conform to the username:password syntax normally used by SQLAlchemy.
ru: строка JSON, содержащая дополнительную конфигурацию соединения. JSON строка, содержащая дополнительную информацию о соединении. Это используется для указания информации о соединении с такими системами как Hive, Presto и BigQuery, которые не укладываются в шаблон "пользователь:пароль", который обычно используется в SQLAlchemy.

source: Enter CA_BUNDLE
ru: Введите CA_BUNDLE

source: Optional CA_BUNDLE contents to validate HTTPS requests. Only available on certain database engines.
ru: Необязательное содержимое CA_BUNDLE для валидации HTTPS запросов. Доступно только в определенных драйверах баз данных.

source: Impersonate logged in user (Presto, Trino, Drill, Hive, and GSheets)
ru: Имперсонировать пользователя (Presto, Trino, Drill, Hive, и Google Таблицы)

source: If Presto or Trino, all the queries in SQL Lab are going to be executed as the currently logged on user who must have permission to run them. If Hive and hive.server2.enable.doAs is enabled, will run the queries as service account, but impersonate the currently logged on user via hive.server2.proxy.user property.
ru: Если Presto или Trino, все запросы в SQL Lab будут выполнены в качестве в настоящее время зарегистрированного пользователя, который должен иметь разрешение на их запуск. Если вы используете Presto или Trino, все запросы в Лаборатории SQL будут выполняться от авторизованного пользователя, который должен иметь разрешение на их выполнение. Если включены Hive и hive.server2.enable.doAs, то запросы будут выполняться через техническую учетную запись, но имперсонировать зарегистрированного пользователя можно через свойство hive.server2.proxy.user.

source: Allow file uploads to database
ru: Разрешить загрузку файлов в базу данных

source: Schemas allowed for File upload
ru: Схемы, в которые разрешена загрузка файлов

source: A comma-separated list of schemas that files are allowed to upload to.
ru: Разделённый запятыми список схем, в которые можно загружать файлы.

source: Additional settings.
ru: Дополнительная настройка.

source: Metadata Parameters
ru: Параметры метаданных

source: The metadata_params object gets unpacked into the sqlalchemy.MetaData call.
ru: Объект metadata_params вызывает sqlalchemy.MetaData

source: Engine Parameters
ru: Параметры драйвера

source: The engine_params object gets unpacked into the sqlalchemy.create_engine call.
ru: Объект engine_params вызывает sqlalchemy.create_engine

source: Version
ru: Версия

source: Version number
ru: Номер версии

source: Specify the database version. This is used with Presto for query cost estimation, and Dremio for syntax changes, among others.
ru: Укажите версию базы данных. Это используется в Presto для оценки стоимости запросов, и Dremio для изменения синтаксиса, среди прочих.

source: Disable drill to detail
ru: Отключить drill to detail

source: Disables the drill to detail feature for this database.
ru: Отключает функцию drill to detail для этой базы данных.

source: Allow changing catalogs
ru: Разрешить изменение каталогов

source: Give access to multiple catalogs in a single database connection.
ru: Предоставьте доступ к нескольким каталогам через одно соединение с базой данных.

source: STEP %(stepCurr)s OF %(stepLast)s
ru: ШАГ %(stepCurr)s ИЗ %(stepLast)s

source: Enter Primary Credentials
ru: Введите основные учетные данные

source: Need help? Learn how to connect your database
ru: Нужна помощь? Узнайте, как подключаться к вашей базе данных

source: Database connected
ru: Соединение с базой данных установлено

source: Create a dataset to begin visualizing your data as a chart or go to SQL Lab to query your data.
ru: Создайте датасет для визуализации ваших данных на графике или перейдите в Лабораторию SQL для просмотра данных.

source: Enter the required %(dbModelName)s credentials
ru: Введите обязательные данные для %(dbModelName)s

source: Need help? Learn more about
ru: Нужна помощь? Узнайте больше о

source: connecting to %(dbModelName)s
ru: подключение к %(dbModelName)s

source: Select a database to connect
ru: Выберите базу данных для подключения

source: SSH Host
ru: хост SSH

source: e.g. 127.0.0.1
ru: например, 127.0.0.1

source: SSH Port
ru: SSH порт

source: e.g. Analytics
ru: например, Analytics

source: Login with
ru: Войти при помощи

source: Password
ru: Пароль

source: Private Key & Password
ru: Приватный ключ и пароль

source: SSH Password
ru: Пароль SSH

source: e.g. ********
ru: например, ********

source: Private Key
ru: Приватный ключ

source: Paste Private Key here
ru: вставьте личный ключ здесь

source: Private Key Password
ru: Пароль приватного ключа

source: SSH Tunnel
ru: SSH Туннель

source: SSH Tunnel configuration parameters
ru: Параметры конфигурации SSH туннеля

source: Display Name
ru: Отображаемое имя

source: Name your database
ru: Дайте имя базе данных

source: Pick a name to help you identify this database.
ru: Выберите имя для базы данных.

source: dialect+driver://username:password@host:port/database
ru: диалект+драйвер://пользователь:пароль@хост:порт/схема

source: Refer to the
ru: Обратитесь к

source: for more information on how to structure your URI.
ru: за подробной информацией по тому, как структурировать ваш URI.

source: Test connection
ru: Тестовое соединение

source: Please enter a SQLAlchemy URI to test
ru: Введите SQLAlchemy URI для тестирования

source: e.g. world_population
ru: например, health_medicine

source: Connection failed, please check your connection settings.
ru: Соединение не удалось, проверьте настройки соединения.

source: Database settings updated
ru: Обновлены настройки базы данных

source: Sorry there was an error fetching database information: %s
ru: К сожалению, произошла ошибка при получении информации о базе данных: %s

source: Or choose from a list of other databases we support:
ru: Или выберите из списка других поддерживаемых баз данных:

source: Supported databases
ru: Поддерживаемые базы данных

source: Choose a database...
ru: Выберите базу данных...

source: Want to add a new database?
ru: Хотите добавить новую базу данных?

source: Any databases that allow connections via SQL Alchemy URIs can be added. Learn about how to connect a database driver
ru: Любые базы данных, подключаемые через SQL Alchemy URI, могут быть добавлены. Узнайте больше о том, как подключить драйвер базы данных

source: Connect
ru: Подключить

source: Finish
ru: Завершить

source: This database is managed externally, and can't be edited in Superset
ru: Эта база данных управляется извне и не может быть изменена в Суперсете

source: The passwords for the databases below are needed in order to import them. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in explore files and should be added manually after the import if they are needed.
ru: Для их импорта необходимы пароли для приведенных ниже баз данных. Пароли к базам данных требуются, чтобы импортировать их. Пожалуйста, обратите внимание, что разделы "Безопасность" и "Утверждение" в настройках конфигурации базы данных отсутствуют в импортируемых файлах и должны быть добавлены вручную после импорта, если необходимо.

source: You are importing one or more databases that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы импортируете одну или несколько баз данных, которые уже существуют. Перезапись может привести к потере части вашей работы. Вы уверены, что хотите перезаписать?

source: Database Creation Error
ru: Ошибка создания базы данных

source: We are unable to connect to your database. Click "See more" for database-provided information that may help troubleshoot the issue.
ru: Не удалось подключиться к базе данных. Нажмите "Подробнее" для информации, предоставленной базой данных в ответ, для решения проблемы.

source: CREATE DATASET
ru: СОЗДАТЬ ДАТАСЕТ

source: QUERY DATA IN SQL LAB
ru: данные запроса в SQL Lab

source: Connect a database
ru: Подключиться к базе данных

source: Edit database
ru: Редактировать Базу Данных

source: Connect this database using the dynamic form instead
ru: Подключиться к этой базе, используя динамичную форму

source: Click this link to switch to an alternate form that exposes only the required fields needed to connect this database.
ru: Нажмите для переключения на альтернативную форму подключения, которая позволит вам ввести все данные в соответствующую форму для данной базы данных.

source: Additional fields may be required
ru: Могут потребоваться дополнительные поля

source: Select databases require additional fields to be completed in the Advanced tab to successfully connect the database. Learn what requirements your databases has
ru: Некоторые базы данных требуют ручной настройки во вкладке Продвинутая настройка для успешного подключения. Вы можете ознакомиться с требованиями к вашей базе данных

source: Import database from file
ru: Импортировать базу данных из файла

source: Connect this database with a SQLAlchemy URI string instead
ru: Подключиться к этой базе через SQLAlchemy URI

source: Click this link to switch to an alternate form that allows you to input the SQLAlchemy URL for this database manually.
ru: Нажмите для переключения на альтернативную форму подключения, которая позволит вам вручную ввести SQLAlchemy URL для данной базы данных.

source: This can be either an IP address (e.g. 127.0.0.1) or a domain name (e.g. mydatabase.com).
ru: Это может быть как IP адрес (например, 127.0.0.1), так и доменное имя (например, моябазаданных.рф).

source: Host
ru: Хост

source: e.g. 5432
ru: например, 5432

source: Port
ru: Порт

source: e.g. sql/protocolv1/o/12345
ru: например,

source: Copy the name of the HTTP Path of your cluster.
ru: Скопируйте название пути HTTP вашего кластера.

source: Database name
ru: Имя базы данных

source: Copy the name of the database you are trying to connect to.
ru: Впишите имя базы данных, к которой вы пытаетесь подключиться

source: e.g. hive_metastore
ru: например,

source: Default Catalog
ru: Каталог по умолчанию

source: The default catalog that should be used for the connection.
ru: Каталог по умолчанию, который следует использовать для соединения.

source: e.g. default
ru: например,

source: Default Schema
ru: Схема по умолчанию

source: The default schema that should be used for the connection.
ru: Схема по умолчанию, которая должна использоваться для соединения.

source: Paste your access token here
ru: Вставьте здесь свой токен доступа

source: Access token
ru: Токен доступа

source: Pick a nickname for how the database will display in Superset.
ru: Выберите имя для базы данных, которое будет отображаться в Суперсете.

source: e.g. param1=value1&param2=value2
ru: например, параметр1=значение1&параметр2=значение2

source: Additional Parameters
ru: Дополнительные параметры

source: Add additional custom parameters
ru: Добавление дополнительных пользовательских параметров

source: SSL Mode "require" will be used.
ru: SSL режим “require” будет использован.

source: Type of Google Sheets allowed
ru: Допустимый тип Google Таблиц

source: Publicly shared sheets only
ru: Только общие листы

source: Public and privately shared sheets
ru: Публичные и приватные с общим доступом листы

source: How do you want to enter service account credentials?
ru: Как вы хотите ввести учетные данные об услугах?

source: Upload JSON file
ru: Загрузить JSON файл

source: Copy and Paste JSON credentials
ru: Скопировать и вставить JSON данные

source: Service Account
ru: Сервисный аккаунт

source: Paste content of service credentials JSON file here
ru: вставьте содержание файла сервисных учетных данных JSON здесь

source: Copy and paste the entire service account .json file here
ru: Скопировать и вставить .json файл сервисного аккаунта сюда

source: Upload Credentials
ru: Загрузить учетные данные

source: Use the JSON file you automatically downloaded when creating your service account.
ru: Используйте файл JSON, который вы автоматически загружаете при создании учетной записи службы.

source: Connect Google Sheets as tables to this database
ru: Подключить Google Таблицы как таблицы для этой базы данных

source: Google Sheet Name and URL
ru: Имя или URL Google Таблицы

source: Enter a name for this sheet
ru: Введите название для этого листа

source: Paste the shareable Google Sheet URL here
ru: вставьте общий URL -адрес листа Google здесь

source: Add sheet
ru: Добавить лист

source: Copy the identifier of the account you are trying to connect to.
ru: Скопируйте идентификатор учетной записи, к которой вы пытаетесь подключиться.

source: e.g. xy12345.us-east-2.aws
ru: например,

source: e.g. compute_wh
ru: например,

source: e.g. AccountAdmin
ru: например,

source: Upload file to preview columns
ru: Загрузить файл для предварительного просмотра столбцов

source: Data Imported
ru: Данные импортируются

source: Uploading a file is required
ru: Загрузка файла требуется

source: Upload a file with a valid extension. Valid: [%s]
ru: Загрузите файл с правильным расширением. Правильное: [%s]

source: Selecting a database is required
ru: Требуется выбор базы данных

source: CSV Upload
ru: Загрузка CSV

source: Excel Upload
ru: Excel загрузка

source: Columnar Upload
ru: Загрузка Columnar

source: Upload a file to a database.
ru: Загрузите файл в базу данных.

source: %(type)s File
ru: %(type)s Файл

source: Preview uploaded file
ru: Предварительный просмотр загруженный файл

source: Select a database
ru: Выберите базу данных

source: Select a database to upload the file to
ru: Выберите базу данных для загрузки файла

source: Select a schema
ru: Выберите схему

source: Select a schema if the database supports this
ru: Укажите схему, если она поддерживается базой данных

source: Name of table to be created
ru: Название таблицы, которое будет создано

source: Delimiter
ru: Разделитель

source: Select a delimiter for this data
ru: Выберите разделитель для этих данных

source: Choose a delimiter
ru: Выберите разделитель

source: Sheet name
ru: Название листа

source: Choose sheet name
ru: Выберите название листа

source: Select a sheet name from the uploaded file
ru: Выберите имя листа из загруженного файла

source: File Settings
ru: Настройки файла

source: Adjust how spaces, blank lines, null values are handled and other file wide settings.
ru: Отрегулируйте, как пробелы, пустые строки, нулевые значения обрабатываются и другие настройки широких файлов.

source: If Table Already Exists
ru: Если таблица уже существует

source: What should happen if the table already exists
ru: Что должно произойти, если таблица уже существует

source: Choose already exists
ru: Выберите уже существует

source: Columns To Be Parsed as Dates
ru: Список столбцов, которые должны быть интерпретированы как даты

source: Choose columns to be parsed as dates
ru: Выберите столбцы, которые будут проанализированы в качестве дат
