Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: When specifying SQL, the datasource acts as a view. Superset will use this statement as a subquery while grouping and filtering on the generated parent queries.
ru: Когда указан SQL, источник данных работает как представление. Superset будет использовать это выражение в подзапросе, при необходимости группировки и фильтрации.

source: Physical
ru: Физический

source: The pointer to a physical table (or view). Keep in mind that the chart is associated to this Superset logical table, and this logical table points the physical table referenced here.
ru: Указатель на физическую таблицу (или представление). Следует помнить, что график связан с логической таблицей Superset, а эта логическая таблица указывает на физическую таблицу, указанную здесь.

source: This field is used as a unique identifier to attach the metric to charts. It is also used as the alias in the SQL query.
ru: Это поле используется в качестве уникального идентификатора для прикрепления метрики к графикам. Оно также используется в качестве алиаса в SQL-запросе.

source: D3 format
ru: Формат даты/времени

source: Metric currency
ru: Валюта меры

source: Select or type currency symbol
ru: Выберите или введите символ валюты

source: Warning
ru: Предупреждение

source: Optional warning about use of this metric
ru: Необязательное предупреждение об использовании этой меры

source: <new metric>
ru: <новая мера>

source: Be careful.
ru: Будьте осторожны.

source: Changing these settings will affect all charts using this dataset, including charts owned by other people.
ru: Изменение этих настроек будет влиять на все графики, использующие этот датасет, включая графики других пользователей.

source: Sync columns from source
ru: Синхронизировать столбцы из источника

source: Calculated columns
ru: Вычисляемые столбцы

source: This field is used as a unique identifier to attach the calculated dimension to charts. It is also used as the alias in the SQL query.
ru: Это поле используется в качестве уникального идентификатора для прикрепления рассчитанного измерения к графикам.

source: <enter SQL expression here>
ru: <введите SQL выражение>

source: Settings
ru: Настройки

source: The dataset has been saved
ru: Датасет сохранен

source: Error saving dataset
ru: Набор данных по сохранению ошибок

source: The dataset configuration exposed here affects all the charts using this dataset. Be mindful that changing settings here may affect other charts in undesirable ways.
ru: Конфигурация Датасета, представленная здесь, влияет на все графики, использующие этот датасет. Помните, что изменение настроек может иметь нежелаемый эффект на другие графики.

source: Are you sure you want to save and apply changes?
ru: Вы уверены, что хотите сохранить и применить изменения?

source: Confirm save
ru: Подтвердить сохранение

source: OK
ru: ОК

source: Edit Dataset
ru: Редактировать датасет

source: Use legacy datasource editor
ru: Использовать старый редактор

source: This dataset is managed externally, and can't be edited in Superset
ru: Этот датасет управляется извне и не может быть изменена в Суперсете

source: DELETE
ru: УДАЛИТЬ

source: Type "%s" to confirm
ru: Введите "%s" для подтверждения

source: More
ru: Подробнее

source: Click to edit
ru: Нажмите для редактирования

source: You don't have the rights to alter this title.
ru: Недостаточно прав для изменения названия.

source: No databases match your search
ru: Нет баз данных, удовлетворяющих вашему поиску

source: There are no databases available
ru: Нет доступных баз данных

source: Manage your databases
ru: Управляйте своими базами данных

source: here
ru: здесь

source: Unexpected error
ru: Неожиданная ошибка

source: This may be triggered by:
ru: Возможные причины:

source: Please reach out to the Chart Owner for assistance.
ru: Пожалуйста, обратитесь к владельцу диаграммы.

source: Chart Owner: %s
ru: Владелец диаграммы: %s

source: %(message)s This may be triggered by: %(issues)s
ru: %(message)s Это может быть вызвано: %(issues)s

source: %s Error
ru: %s Ошибка

source: Missing dataset
ru: Отсутствующий датасет

source: See more
ru: Подробнее

source: See less
ru: Скрыть подробности

source: Copy message
ru: Скопировать сообщение

source: Details
ru: Детали

source: Authorization needed
ru: Требуется разрешение

source: This was triggered by:
ru: Это было вызвано:

source: Did you mean:
ru: Возможно вы имели в виду:

source: %(suggestion)s instead of "%(undefinedParameter)s?"
ru: %(suggestion)s вместо \ “%(undefinedParameter)s?”

source: Parameter error
ru: Ошибка параметра

source: We’re having trouble loading this visualization. Queries are set to timeout after %s second.
ru: У нас проблемы с загрузкой этой визуализации. Запросы выполняются по тайм-ауту через %s секунд.

source: We’re having trouble loading these results. Queries are set to timeout after %s second.
ru: У нас проблемы с загрузкой этих результатов. Запросы выполняются по тайм-ауту через %s секунд.

source: %(subtitle)s This may be triggered by: %(issue)s
ru: %(subtitle)s Это может быть вызвано: %(issue)s

source: Timeout error
ru: Ошибка таймаута

source: Click to favorite/unfavorite
ru: Добавить в избранное

source: Cell content
ru: Содержимое ячейки

source: Hide password.
ru: Скрыть пароль.

source: Show password.
ru: Показать пароль.

source: Database driver for importing maybe not installed. Visit the Superset documentation page for installation instructions:
ru: Драйвер базы данных для импорта может быть не установлен. Изучите документацию Суперсета для инструкций по установке:

source: OVERWRITE
ru: ПЕРЕЗАПИСАТЬ

source: Database passwords
ru: Пароли базы данных

source: %s PASSWORD
ru: %s ПАРОЛЬ

source: %s SSH TUNNEL PASSWORD
ru: %s Пароль SSH Tunnel

source: %s SSH TUNNEL PRIVATE KEY
ru: %s Приватный ключ SSH Tunnel

source: %s SSH TUNNEL PRIVATE KEY PASSWORD
ru: %s ПАРОЛЬ ПРИВАТНОГО КЛЮЧА SSH TUNNEL

source: Overwrite
ru: Перезаписать

source: Import
ru: Импорт

source: Import %s
ru: Импортировать %s

source: Select file
ru: Выбрать файл

source: Last Updated %s
ru: Дата изменения %s

source: Sort
ru: Сортировка

source: + %s more
ru: + еще %s

source: %s Selected
ru: %s Выбрано

source: Deselect all
ru: Снять выделение

source: Add Tag
ru: Добавить тег

source: No results match your filter criteria
ru: Не найдено результатов по вашим критериям

source: Try different criteria to display results.
ru: Попробуйте использовать другии критерии фильтрации

source: clear all filters
ru: Сбросить все фильтры

source: No Data
ru: Нет данных

source: %s-%s of %s
ru: %s-%s из %s

source: Start date
ru: Начало

source: End date
ru: Конец

source: Type a value
ru: Введите значение

source: Filter
ru: Фильтр

source: Select or type a value
ru: Выберите значение

source: Last modified
ru: Последнее изменение

source: Modified by
ru: Кем изменено

source: Created by
ru: Кем создано

source: Tags
ru: Теги

source: Menu actions trigger
ru: Действия меню триггер

source: Select ...
ru: Выбрать ...

source: Filter menu
ru: Меню фильтра

source: Reset
ru: Сбросить

source: No filters
ru: Нет фильтров

source: Select all items
ru: Выбрать все записи

source: Search in filters
ru: Поиск в фильтрах

source: Select current page
ru: Выбрать текущую страницу

source: Invert current page
ru: Инвертировать текущую страницу

source: Clear all data
ru: Очистить все данные

source: Select all data
ru: Выбрать все данные

source: Expand row
ru: Развернуть строку

source: Collapse row
ru: Свернуть строку

source: Click to sort descending
ru: Нажмите для сортировки по убыванию

source: Click to sort ascending
ru: Нажмите для сортировки по возрастанию

source: Click to cancel sorting
ru: Нажмите для отмены сортировки

source: List updated
ru: Список обновлен

source: There was an error loading the tables
ru: Возникла ошибка при загрузке таблиц

source: See table schema
ru: Таблица

source: Select table or type to search tables
ru: Выберите таблицу или введите текст для поиска таблиц

source: Force refresh table list
ru: Принудительно обновить список таблиц

source: You do not have permission to read tags
ru: У вас нет разрешения на чтение тегов

source: Timezone selector
ru: Выбор часового пояса

source: Failed to save cross-filter scoping
ru: Не удалось сохранить кросс-фильтровую привязку

source: There is not enough space for this component. Try decreasing its width, or increasing the destination width.
ru: Недостаточно пространства для этого компонента. Попробуйте уменьшить ширину или увеличить целевую ширину.

source: Can not move top level tab into nested tabs
ru: Невозможно перенести вкладку верхнего уровня во вложенную вкладку

source: This chart has been moved to a different filter scope.
ru: Этот график был перемещён в другой набор фильтров.

source: There was an issue fetching the favorite status of this dashboard.
ru: Произошла ошибка с получением статуса избранного для этого дашборда.

source: There was an issue favoriting this dashboard.
ru: Произошла ошибка при добавлении этого дашборда в избранное.

source: This dashboard is now published
ru: Дашборд теперь опубликован

source: This dashboard is now hidden
ru: Дашборд теперь скрыт

source: You do not have permissions to edit this dashboard.
ru: У вас нет прав на редактирование этого дашборда.

source: This dashboard was saved successfully.
ru: Дашборд успешно сохранен.

source: Sorry, an unknown error occurred
ru: Извините, произошла неизвестная ошибка

source: Sorry, there was an error saving this dashboard: %s
ru: Извините, произошла ошибка при сохранении дашборда: %s

source: You do not have permission to edit this dashboard
ru: У вас нет прав на редактирование этого дашборда

source: Please confirm the overwrite values.
ru: Пожалуйста, подтвердите перезаписные значения.

source: You have used all %(historyLength)s undo slots and will not be able to fully undo subsequent actions. You may save your current state to reset the history.
ru: Вы использовали все слоты %(historyLength)s для отмены действий и не сможете полностью отменить последующие действия.

source: Could not fetch all saved charts
ru: Не удалось получить все сохраненные графики

source: Sorry there was an error fetching saved charts:
ru: Извините, произошла ошибка при загрузке графиков:

source: Any color palette selected here will override the colors applied to this dashboard's individual charts
ru: Любая палитра, выбранная здесь, будет перезаписывать цвета, применённые к отдельным графикам этого дашборда

source: You have unsaved changes.
ru: У вас есть несохраненные изменения.

source: Drag and drop components and charts to the dashboard
ru: Переместите элементы оформления и графики на дашборд

source: You can create a new chart or use existing ones from the panel on the right
ru: Вы можете создать новый график или использовать существующие из панели справа

source: Create a new chart
ru: Создать новый график

source: Drag and drop components to this tab
ru: Переместите элементы оформления и графики в эту вкладку

source: There are no components added to this tab
ru: В этой вкладке нет компонентов

source: You can add the components in the edit mode.
ru: Вы можете добавить компоненты в режиме редактирования.

source: Edit the dashboard
ru: Изменить

source: There is no chart definition associated with this component, could it have been deleted?
ru: С этим компонентом не связан ни один график, возможно, он был удален?

source: Delete this container and save to remove this message.
ru: Удалите этот контейнер и сохраните изменения, чтобы убрать это сообщение.

source: Refresh interval saved
ru: Интервал обновления сохранен

source: Custom interval
ru: Пользовательский интервал

source: Put positive values and valid minute and second value less than 60
ru: Поместите положительные значения и действительное минутное и второе значение менее 60

source: Put some positive value greater than 0
ru: Поместите некоторое положительное значение больше 0

source: Refresh interval
ru: Интервал обновления

source: Refresh frequency
ru: Частота обновления

source: HOUR
ru: час

source: Type a number
ru: Введите число

source: MINUTE
ru: минута

source: Minutes value
ru: Протокол

source: SECOND
ru: второй

source: Seconds value
ru: Секундные значения

source: Are you sure you want to proceed?
ru: Вы уверены, что хотите продолжить?

source: Save for this session
ru: Сохранить на время текущей сессии

source: You must pick a name for the new dashboard
ru: Вы должны выбрать имя для нового дашборда

source: Save dashboard
ru: Сохранить дашборд

source: Overwrite Dashboard [%s]
ru: Перезаписать дашборд [%s]

source: Save as:
ru: Сохранить как:

source: [dashboard name]
ru: [имя дашборда]

source: also copy (duplicate) charts
ru: также копировать (дублировать) графики

source: viz type
ru: тип визуализации

source: recent
ru: недавние

source: Create new chart
ru: Создать новый график

source: Filter your charts
ru: Поиск

source: Filter charts
ru: Фильтрующие диаграммы

source: Sort by %s
ru: Сорт. по %s

source: Show only my charts
ru: Покажу только мои диаграммы

source: You can choose to display all charts that you have access to or only the ones you own. Your filter selection will be saved and remain active until you choose to change it.
ru: Вы можете отобразить все графики, к которым у вас есть доступ, или только те, которые у вас есть.

source: Added
ru: Добавлено

source: Unknown type
ru: Неизвестный тип

source: Viz type
ru: Тип визуализации

source: Dataset
ru: Датасет

source: Superset chart
ru: График Superset

source: Check out this chart in dashboard:
ru: Посмотреть этот график в дашборде:

source: Layout elements
ru: Оформление

source: An error occurred while fetching available CSS templates
ru: Произошла ошибка при получении доступных CSS-шаблонов

source: Load a CSS template
ru: Загрузить CSS шаблон

source: Live CSS editor
ru: Редактор CSS

source: Collapse tab content
ru: Свернуть содержимое вкладки

source: There are no charts added to this dashboard
ru: В этот дашборд еще не добавлен ни один график.

source: Go to the edit mode to configure the dashboard and add charts
ru: Перейдите в режим редактирования для изменения дашборда и добавьте графики

source: Unable to load dashboard
ru: Невозможно загрузить панель панели

source: The following filters have the 'Select first filter value by default' option checked and could not be loaded, which is preventing the dashboard from rendering: %s
ru: Следующие фильтры имеют значение «Выбрать первое значение фильтра по умолчанию» \ n, и не может быть загружено, что предотвращает рендеринг на панель \ n: %s

source: Changes saved.
ru: Изменения сохранены.

source: Disable embedding?
ru: Выключить встраивание?

source: This will remove your current embed configuration.
ru: Это удалит вашу текущую конфигурацию встраивания.

source: Embedding deactivated.
ru: Встраивание отключено

source: Sorry, something went wrong. Embedding could not be deactivated.
ru: Извините, что-то пошло не так. Встраивание не может быть деактивировано.

source: Sorry, something went wrong. Please try again.
ru: Извините, что -то пошло не так.

source: This dashboard is ready to embed. In your application, pass the following id to the SDK:
ru: Этот дашборд готов к встраиванию. В своем приложении передайте SDK следующий идентификатор:

source: Configure this dashboard to embed it into an external web application.
ru: Настройте этот дашборд для встраивания во внешнее веб-приложение

source: For further instructions, consult the
ru: Для получения дальнейших инструкций обратитесь к

source: Superset Embedded SDK documentation.
ru: Документация Superset встроена SDK.

source: Allowed Domains (comma separated)
ru: Разрешенные домены (разделить запятыми)

source: A list of domain names that can embed this dashboard. Leaving this field empty will allow embedding from any domain.
ru: Список доменных имен, которые могут встраивать этот дашборд. Если оставить поле пустым, любой домен сможет сделать встраивание.

source: Deactivate
ru: Выключить

source: Save changes
ru: Сохранить изменения

source: Enable embedding
ru: Разрешить встраивание

source: Embed
ru: Встроить

source: Applied filters (%s)
ru: Применены фильтры (%s)

source: Applied cross-filters (%d)
ru: Применены кросс-фильтры (%d)

source: Applied filters (%d)
ru: Применены фильтры (%d)

source: This dashboard is currently auto refreshing; the next auto refresh will be in %s.
ru: В настоящий момент дашборд обновляется; следующее обновление будет через %s.

source: Your dashboard is too large. Please reduce its size before saving it.
ru: Дашборд слишком большой. Пожалуйста, уменьшите его размер перед сохранением.

source: Not available
ru: Не доступно

source: Add the name of the dashboard
ru: Задайте имя дашборда

source: Dashboard title
ru: Название дашборда

source: Undo the action
ru: Отменить действие

source: Redo the action
ru: Повторить действие

source: Discard
ru: Отменить изменения

source: Edit dashboard
ru: Изменить

source: Refreshing charts
ru: Обновление графиков

source: Superset dashboard
ru: Дашборд Superset

source: Check out this dashboard:
ru: Посмотреть дашборд:

source: Refresh dashboard
ru: Обновить дашборд

source: Exit fullscreen
ru: Выйти из полноэкранного режима

source: Enter fullscreen
ru: Полноэкранный режим

source: Edit properties
ru: Редактировать свойства

source: Edit CSS
ru: Редактировать CSS

source: Download
ru: Скачать

source: Export to PDF
ru: Экспорт в PDF

source: Download as Image
ru: Скачать как изображение

source: Share
ru: Поделиться

source: Copy permalink to clipboard
ru: Скопировать ссылку в буфер обмена

source: Share permalink by email
ru: Поделиться ссылкой по email

source: Embed dashboard
ru: Встроить дашборд

source: Manage email report
ru: Управление рассылкой по почте

source: Set filter mapping
ru: Установить действие фильтра

source: Set auto-refresh interval
ru: Задать интервал обновления

source: Confirm overwrite
ru: Подтвердить перезапись

source: Yes, overwrite changes
ru: Да, перезаписать изменения

source: Are you sure you intend to overwrite the following values?
ru: Вы уверены, что хотите перезаписать эти значения?

source: Last Updated %s by %s
ru: Изменено %s пользователем %s

source: Error
ru: Ошибка

source: A valid color scheme is required
ru: Требуется корректная цветовая схема

source: JSON metadata is invalid!
ru: JSON метаданные не валидны!

source: Dashboard properties updated
ru: Свойства дашборда обновлены

source: The dashboard has been saved
ru: Дашборд сохранен

source: Access
ru: Доступ

source: Owners is a list of users who can alter the dashboard. Searchable by name or username.
ru: Владельцы – это список пользователей, которые могут изменять дашборд. Можно искать по имени или никнейму.

source: Colors
ru: Цвета

source: Roles is a list which defines access to the dashboard. Granting a role access to a dashboard will bypass dataset level checks. If no roles are defined, regular access permissions apply.
ru: Роли - это список, определяющий доступ к дашборду. Предоставление роли доступа к дашборду позволяет обойти проверки на уровне датасета. Если роли не определены, применяются обычные права доступа.

source: Dashboard properties
ru: Свойства дашборда

source: This dashboard is managed externally, and can't be edited in Superset
ru: Эта панель управления управляется снаружи и не может быть отредактирована в Superset

source: Basic information
ru: Основная информация

source: URL slug
ru: Читаемый URL

source: A readable URL for your dashboard
ru: Читаемый URL-адрес для дашборда

source: Certification
ru: Утверждение

source: Person or group that has certified this dashboard.
ru: Лицо или группа, которые утвердили этот дашборд

source: Any additional detail to show in the certification tooltip.
ru: Любые дополнительные сведения для всплывающей подсказки.

source: A list of tags that have been applied to this chart.
ru: Список тегов, которые были применены к этому графику.

source: JSON metadata
ru: JSON метаданные

source: Please DO NOT overwrite the "filter_scopes" key.
ru: Пожалуйста, не перезаписывайте клавишу \ "filter_scopes ".

source: Use "%(menuName)s" menu instead.
ru: Использовать меню "%(menuName)s" взамен.

source: This dashboard is not published, it will not show up in the list of dashboards. Click here to publish this dashboard.
ru: Этот дашборд не опубликован, он не будет отображён в списке дашбордов. Нажмите, чтобы опубликовать этот дашборд.

source: This dashboard is not published which means it will not show up in the list of dashboards. Favorite it to see it there or access it by using the URL directly.
ru: Этот дашборд не опубликован, что означает, что он не будет отображён в списке дашбордов. Добавьте его в избранное, чтобы увидеть там или воспользуйтесь доступом по прямой ссылке.

source: This dashboard is published. Click to make it a draft.
ru: Дашборд опубликован. Нажмите, чтобы сделать черновиком.

source: Draft
ru: Черновик

source: Annotation layers are still loading.
ru: Слои аннотаций загружаются.

source: One ore more annotation layers failed loading.
ru: Один или несколько слоев аннотации не удалось загрузить.

source: This chart applies cross-filters to charts whose datasets contain columns with the same name.
ru: Эта диаграмма применяется по перекрестным фильтрам к диаграммам, наборы данных которых содержат столбцы с тем же именем.

source: Data refreshed
ru: Данные обновлены

source: Cached %s
ru: Добавлено в кэш %s

source: Fetched %s
ru: Получено %s

source: Query %s: %s
ru: Запрос %s: %s

source: Force refresh
ru: Обновить

source: Hide chart description
ru: Скрыть описание графика

source: Show chart description
ru: Показать описание графика

source: Cross-filtering scoping
ru: Поперечная плита

source: View query
ru: Показать SQL запрос

source: View as table
ru: Показать в виде таблицы

source: Chart Data: %s
ru: Данные графика: %s

source: Share chart by email
ru: Поделиться графиком по email

source: Check out this chart:
ru: Посмотреть график:

source: Export to .CSV
ru: Скачать .CSV файл

source: Export to Pivoted .CSV
ru: Скачать Pivoted .CSV

source: Export to Excel
ru: Скачать Excel файл

source: Export to full .CSV
ru: Экспорт в целый .CSV

source: Export to full Excel
ru: Экспорт в полный Excel

source: Download as image
ru: Сохранить как изображение

source: Something went wrong.
ru: Что-то пошло не так.

source: Search...
ru: Поиск...

source: No filter is selected.
ru: Не выбраны фильтры.

source: Editing 1 filter:
ru: Редактирование 1 фильтра:

source: Batch editing %d filters:
ru: Множественное редактирование %d фильтров:

source: Configure filter scopes
ru: Настроить область действия фильтра

source: There are no filters in this dashboard.
ru: В этом дашборде нет фильтров.

source: Expand all
ru: Расширить все

source: Collapse all
ru: Свернуть всё

source: An error occurred while opening Explore
ru: Произошла ошибка при открытии режима исследования

source: Empty column
ru: Пустой столбец

source: This markdown component has an error.
ru: Этот компонент содержит ошибки.

source: This markdown component has an error. Please revert your recent changes.
ru: Этот компонент содержит ошибки. Пожалуйста, отмените последние изменения.

source: Empty row
ru: Пустой ряд

source: You can
ru: Вы можете

source: create a new chart
ru: создать новый график

source: or use existing ones from the panel on the right
ru: или использовать уже существующие из панели справа

source: You can add the components in the
ru: Вы можете добавить компоненты в

source: edit mode
ru: режиме редактирования

source: Delete dashboard tab?
ru: Удалить вкладку дашборда?

source: Deleting a tab will remove all content within it. You may still reverse this action with the
ru: Удаление вкладки удалит все ее содержимое. Вы можете отменить это действие при помощи сочетания клавиш
