Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Pixels
ru: Пиксели

source: Miles
ru: Мили

source: Kilometers
ru: Километры

source: The unit of measure for the specified point radius
ru: Единица измерения для указанного радиуса маркера

source: Labelling
ru: Маркировка

source: label
ru: метка

source: `count` is COUNT(*) if a group by is used. Numerical columns will be aggregated with the aggregator. Non-numerical columns will be used to label points. Leave empty to get a count of points in each cluster.
ru: `count` - это COUNT(*), если используется группировка. Числовые столбцы будут агрегированы с помощью агрегатора. Нечисловые столбцы будут использоваться для обозначения точек. Оставьте пустым, чтобы получить подсчет точек в каждом кластере.

source: Cluster label aggregator
ru: Агрегатор меток кластера

source: sum
ru: Сумма

source: mean
ru: Среднее

source: max
ru: Максимум

source: std
ru: Стандартное отклонение

source: var
ru: Дисперсия

source: Aggregate function applied to the list of points in each cluster to produce the cluster label.
ru: Агрегатная функция, применяемая к списку точек в каждом кластере для получения метки кластера.Агрегатная функция, применяемая для списка точек в каждом кластере для создания метки кластера.

source: Visual Tweaks
ru: Визуальные настройки

source: Live render
ru: Мгновенная отрисовка

source: Points and clusters will update as the viewport is being changed
ru: Точки и кластеры будут обновляться по мере изменения области просмотра

source: Map Style
ru: Стиль карты

source: Streets
ru: Схема

source: Dark
ru: Темный

source: Light
ru: Светлый

source: Satellite Streets
ru: Гибридный режим

source: Satellite
ru: Спутник

source: Outdoors
ru: Туристический режим

source: Base layer map style. See Mapbox documentation: %s
ru: Стиль карты базовых слоев. Смотреть документацию Mapbox: %s

source: Opacity
ru: Прозрачность

source: Opacity of all clusters, points, and labels. Between 0 and 1.
ru: Непрозрачность всех кластеров, точек и меток. Между 0 и 1.

source: RGB Color
ru: Цвет RGB

source: The color for points and clusters in RGB
ru: Цвет для маркеров и кластеров в RGB

source: Viewport
ru: Область просмотра

source: Default longitude
ru: Долгота по умолчанию

source: Longitude of default viewport
ru: Долгота для области просмотра

source: Default latitude
ru: Широта по умолчанию

source: Latitude of default viewport
ru: Широта для области просмотра

source: Zoom
ru: Масштабирование

source: Zoom level of the map
ru: Уровень масштабирования карты

source: One or many controls to group by. If grouping, latitude and longitude columns must be present.
ru: один или много элементов управления для группы.

source: Light mode
ru: Светлый режим

source: Dark mode
ru: Темная тема

source: Scatter
ru: Точечный

source: Transformable
ru: Трансформируемый

source: Significance Level
ru: Уровень значимости

source: Threshold alpha level for determining significance
ru: Пороговый альфа-уровень для определения значимости

source: p-value precision
ru: точность p-значения

source: Number of decimal places with which to display p-values
ru: Количество десятичных значений для демонстрации p-значений

source: Lift percent precision
ru: Процент подъема

source: Number of decimal places with which to display lift values
ru: Количество десятичных знаков для демонстрации значений подъема

source: Table that visualizes paired t-tests, which are used to understand statistical differences between groups.
ru: Таблица, которая визуализирует парные t-тесты, которые используются для понимания статистических различий между группами.Таблица, визуализирующая парные t-тесты, которые используются для нахождения статистических различий между группами.

source: Paired t-test Table
ru: Таблица парного t-теста

source: Statistical
ru: Статистический учет

source: Tabular
ru: Таблицы

source: Options
ru: Опции

source: Data Table
ru: Таблица

source: Whether to display the interactive data table
ru: Отображать интерактивную таблицу с данными

source: Include Series
ru: Включать серию

source: Include series name as an axis
ru: Включить имена категорий в качестве оси

source: Ranking
ru: Ранжирование

source: Plots the individual metrics for each row in the data vertically and links them together as a line. This chart is useful for comparing multiple metrics across all of the samples or rows in the data.
ru: Заклинает отдельные метрики для каждой строки в вертикали данных и связывает их вместе как строка.

source: Directional
ru: Направленный

source: Time Series Options
ru: Настройки временных рядов

source: Not Time Series
ru: Не временные ряды

source: Ignore time
ru: Игнорировать время

source: Time Series
ru: Временной ряд

source: Standard time series
ru: Стандартные временные ряды

source: Aggregate Mean
ru: Агрегированное среднее

source: Mean of values over specified period
ru: Среднее значений за указанный период

source: Aggregate Sum
ru: Агрегированная сумма

source: Sum of values over specified period
ru: Сумма значений за обозначенный период

source: Metric change in value from `since` to `until`
ru: Изменение меры с `до` до `после`

source: Percent Change
ru: Процентное изменение

source: Metric percent change in value from `since` to `until`
ru: Процентное изменение меры с `до` до `после`

source: Factor
ru: Фактор

source: Metric factor change from `since` to `until`
ru: Изменение метрического фактора с `с` до `

source: Advanced Analytics
ru: Расширенная аналитика

source: Use the Advanced Analytics options below
ru: Используйте настройки Расширенной аналитики ниже

source: Settings for time series
ru: Настройки временных рядов

source: Date Time Format
ru: Формат даты и времени

source: Partition Limit
ru: Количество разбиений

source: The maximum number of subdivisions of each group; lower values are pruned first
ru: Максимальное количество подразделений каждой группы;

source: Partition Threshold
ru: Порог раздела

source: Partitions whose height to parent height proportions are below this value are pruned
ru: Разделы, пропорции высоты от высоты от родителей ниже этого значения обрезаны

source: Log Scale
ru: Логарифмическая шкала

source: Use a log scale
ru: Использовать логарифмическую шкалу

source: Equal Date Sizes
ru: Одинаковые размеры дат

source: Check to force date partitions to have the same height
ru: Проверьте, чтобы принудительно дата разбил, чтобы иметь одинаковую высоту

source: Rich Tooltip
ru: Расширенная всплывающая подсказка

source: The rich tooltip shows a list of all series for that point in time
ru: Расширенная всплывающая подсказка показывает список всех категорий для этой точки.

source: Rolling Window
ru: Скользящее окно

source: Rolling Function
ru: Скользящая средняя

source: cumsum
ru: Кумулятивная сумма

source: Min Periods
ru: Минимальный период

source: Time Shift
ru: Временной сдвиг

source: 1 week
ru: 1 неделя

source: 28 days
ru: 28 дней

source: 30 days
ru: 30 дней

source: 52 weeks
ru: 52 недели

source: 1 year
ru: 1 год

source: 104 weeks
ru: 104 недели

source: 2 years
ru: 2 года

source: 156 weeks
ru: 156 недель

source: 3 years
ru: 3 года

source: Overlay one or more timeseries from a relative time period. Expects relative time deltas in natural language (example: 24 hours, 7 days, 52 weeks, 365 days). Free text is supported.
ru: наложенный один или несколько раз из относительного периода времени.

source: Actual Values
ru: Фактические значения

source: 1T
ru: 1МИН

source: 1H
ru: 1Ч

source: 1D
ru: 1Д

source: 7D
ru: 7Д

source: 1M
ru: 1М

source: 1AS
ru: 1С

source: Method
ru: Метод

source: asfreq
ru: asfreq (без изменения)

source: bfill
ru: bfill (заполняет пропуски предыдущими значениями)

source: ffill
ru: ffill (заполняет пропуски следующими значениями)

source: median
ru: Медиана

source: Part of a Whole
ru: Покомпонентное сравнение

source: Compare the same summarized metric across multiple groups.
ru: Сравнивает один и тот же обобщенный показатель в нескольких группах.

source: Categorical
ru: Категориальный

source: Use Area Proportions
ru: Использовать пропорции области

source: Check if the Rose Chart should use segment area instead of segment radius for proportioning
ru: Проверьте, должна ли диаграмма Rose использовать площадь сегмента вместо радиуса сегмента для пропорции

source: A polar coordinate chart where the circle is broken into wedges of equal angle, and the value represented by any wedge is illustrated by its area, rather than its radius or sweep angle.
ru: Полярная координатная диаграмма, где круг разбивается на клинья с равным углом, а значение, представленное любого клина, иллюстрируется его площадью, а не его радиусом или углами.

source: Nightingale Rose Chart
ru: Диаграмма Найтингейл

source: Advanced-Analytics
ru: Продвинутая аналитика

source: Multi-Layers
ru: Многослойный

source: Source / Target
ru: Источник / Цель

source: Choose a source and a target
ru: Выберите источник и цель

source: Limiting rows may result in incomplete data and misleading charts. Consider filtering or grouping source/target names instead.
ru: Ограничение строк может привести к неполным данным и вводящим в заблуждение диаграммам.

source: Visualizes the flow of different group's values through different stages of a system. New stages in the pipeline are visualized as nodes or layers. The thickness of the bars or edges represent the metric being visualized.
ru: Визуализирует поток значений разных групп на разных этапах системы.

source: Demographics
ru: Демография

source: Survey Responses
ru: Ответы на опрос

source: Percentages
ru: Проценты

source: Sankey Diagram with Loops
ru: Схема Санки с петлями

source: Country Field Type
ru: Тип поля страны

source: Full name
ru: Полное имя

source: code International Olympic Committee (cioc)
ru: Код Международного Олимпийского Комитета (cioc)

source: code ISO 3166-1 alpha-2 (cca2)
ru: Код ISO 3166-1 alpha-2 (cca2)

source: code ISO 3166-1 alpha-3 (cca3)
ru: Код ISO 3166-1 alpha-3 (cca3)

source: The country code standard that Superset should expect to find in the [country] column
ru: Код страны, который Суперсет ожидает найти в столбце со страной

source: Show Bubbles
ru: Показать пузыри

source: Whether to display bubbles on top of countries
ru: Отображать пузыри поверх стран

source: Max Bubble Size
ru: Максимальный размер пузыря

source: Color by
ru: Выбор цвета по

source: Choose whether a country should be shaded by the metric, or assigned a color based on a categorical color palette
ru: Выберите, должна ли страна быть затенена метрикой, или назначить цвет на основе категориальной цветовой палиты

source: Country Column
ru: Столбец со страной

source: 3 letter code of the country
ru: 3х буквенный код страны

source: Metric that defines the size of the bubble
ru: Показатель, определяющий размер пузяря

source: Bubble Color
ru: Цвет пузыря

source: Country Color Scheme
ru: Цветовая схема страны

source: A map of the world, that can indicate values in different countries.
ru: Карта мира, на которой могут быть указаны значения в разных странах.

source: Multi-Dimensions
ru: Многомерный

source: Multi-Variables
ru: Несколько переменных

source: Featured
ru: Популярные

source: Pick a set of deck.gl charts to layer on top of one another
ru: Выберите набор диаграмм Deck.gl, чтобы слой друг на друга

source: Select charts
ru: Выберите графики

source: Error while fetching charts
ru: Возникла ошибка при получении графиков

source: Compose multiple layers together to form complex visuals.
ru: Объединяет несколько слоев вместе для формирования сложных визуальных эффектов.

source: deckGL
ru: Карта deckGL

source: Start (Longitude, Latitude):
ru: Старт (Долгота, Широта):

source: End (Longitude, Latitude):
ru: Конец (Долгота, Широта):

source: Start Longitude & Latitude
ru: Начальные долгота и широта

source: Point to your spatial columns
ru: Указание на столбцы с расположением

source: End Longitude & Latitude
ru: Конечные Долгота и Широта

source: Arc
ru: Дуга

source: Target Color
ru: Целевой цвет

source: Color of the target location
ru: Цвет целевого местоположения

source: Categorical Color
ru: Цвет категории

source: Pick a dimension from which categorical colors are defined
ru: Выберите измерение, на основе которого определяются категориальные цвета

source: Stroke Width
ru: Ширина обводки

source: Advanced
ru: Продвинутая настройка

source: Plot the distance (like flight paths) between origin and destination.
ru: Постройте расстояние (например, пути полета) между происхождением и пунктом назначения.

source: 3D
ru: 3D карты

source: Web
ru: Сеть

source: Centroid (Longitude and Latitude):
ru: Центроид (Долгота и Широта):

source: Threshold:
ru: Порог:

source: The size of each cell in meters
ru: Размер каждой ячейки в метрах

source: Aggregation
ru: Агрегация

source: The function to use when aggregating points into groups
ru: функция для использования при агрегировании точек в группы

source: Contours
ru: Контуры

source: Define contour layers. Isolines represent a collection of line segments that serparate the area above and below a given threshold. Isobands represent a collection of polygons that fill the are containing values in a given threshold range.
ru: определить контурные слои.

source: Weight
ru: Вес

source: Metric used as a weight for the grid's coloring
ru: Мера, используемая как вес для раскрашивания сетки

source: Uses Gaussian Kernel Density Estimation to visualize spatial distribution of data
ru: Использует оценку плотности ядра Гаусса для визуализации пространственного распределения данных

source: Spatial
ru: Пространственный

source: GeoJson Settings
ru: Настройки GeoJson

source: Line width unit
ru: Единица измерения ширины линии

source: meters
ru: метры

source: pixels
ru: пиксели

source: Point Radius Scale
ru: Шкала радиуса маркера

source: The GeoJsonLayer takes in GeoJSON formatted data and renders it as interactive polygons, lines and points (circles, icons and/or texts).
ru: Geojsonlayer принимает данные Geojson, форматированные и делает их интерактивными полигонами, линиями и точками (круги, иконки и/или тексты).Диаграмма принимает данные в формате GeoJSON и отображает их в виде интерактивных полигонов, линий и точек (кругов, значков и/или текста).

source: Longitude and Latitude
ru: Долгота и Широта

source: Height
ru: Высота

source: Metric used to control height
ru: Мера, используемая для регулирования высоты

source: Visualize geospatial data like 3D buildings, landscapes, or objects in grid view.
ru: Визуализируйте геопространственные данные, такие как 3D здания, ландшафты или объекты в сетке.Визуализирует геопространственные данные, такие как 3D-здания, ландшафты или объекты в виде сетки.

source: Intesity
ru: Назначение

source: Intensity is the value multiplied by the weight to obtain the final weight
ru: Интенсивность - это значение, умноженное на вес, чтобы получить конечный вес

source: Intensity Radius
ru: Радиус интенсивности

source: Intensity Radius is the radius at which the weight is distributed
ru: Радиус интенсивности - это радиус, при котором вес распределяется

source: Dynamic Aggregation Function
ru: Динамическая агрегирующая функция

source: variance
ru: Дисперсия

source: deviation
ru: отклонение

source: Overlays a hexagonal grid on a map, and aggregates data within the boundary of each cell.
ru: Накладывает гексагональную сетку на карту и агрегирует данные в границах каждой ячейки.

source: Polyline
ru: Полилина

source: Visualizes connected points, which form a path, on a map.
ru: Визуализирует связанные точки, которые образуют путь, на карте.

source: name
ru: имя

source: Polygon Column
ru: Полигонный столб

source: Polygon Encoding
ru: Кодирование многоугольника

source: Elevation
ru: Высота

source: Polygon Settings
ru: Настройки полигона

source: Opacity, expects values between 0 and 100
ru: Непрозрачность, принимаются значения от 0 до 100

source: Number of buckets to group data
ru: Количество ведер для групповых данных

source: How many buckets should the data be grouped in.
ru: Сколько ведер должны быть сгруппированы данные.

source: Bucket break points
ru: Точки разрыва бакета

source: List of n+1 values for bucketing metric into n buckets.
ru: Список значений n 1 для балансирования метрики в N -ведра.

source: Emit Filter Events
ru: Выдать события фильтрации

source: Whether to apply filter when items are clicked
ru: Применять фильтр при щелчке по элементам

source: Multiple filtering
ru: Множественная фильтрация

source: Allow sending multiple polygons as a filter event
ru: Возможность отправки нескольких полигонов в качестве события фильтрации

source: Visualizes geographic areas from your data as polygons on a Mapbox rendered map. Polygons can be colored using a metric.
ru: Визуализирует географические области из ваших данных в виде полигонов на карте, отрисованной Mapbox. Полигоны можно раскрасить с помощью метрики.

source: Category
ru: Категория

source: Point Size
ru: Размер маркера

source: Point Unit
ru: Единица измерения маркера

source: Square meters
ru: Квадратные метры

source: Square kilometers
ru: Квадратные километры

source: Square miles
ru: Квадратные мили

source: Radius in meters
ru: Радиус в метрах

source: Radius in kilometers
ru: Радиус в километрах

source: Radius in miles
ru: Радиус в милях

source: Minimum Radius
ru: Минимальный радиус

source: Minimum radius size of the circle, in pixels. As the zoom level changes, this insures that the circle respects this minimum radius.
ru: Минимальный размер радиуса окружности (в пикселях). При изменении масштаба это гарантирует, что окружность соответствует этому минимальному радиусу.

source: Maximum Radius
ru: Максимальный радиус

source: Maximum radius size of the circle, in pixels. As the zoom level changes, this insures that the circle respects this maximum radius.
ru: максимальный размер радиуса круга, в пикселях.

source: Point Color
ru: Цвет маркера

source: A map that takes rendering circles with a variable radius at latitude/longitude coordinates
ru: Карта, на которой отрисовываются круги с переменным радиусом по координатам широты/долготы

source: Grid
ru: Сетка

source: Aggregates data within the boundary of grid cells and maps the aggregated values to a dynamic color scale
ru: агрегаты данных в границе ячеек сетки и отображают агрегированные значения в динамическую цветовую шкалу

source: For more information about objects are in context in the scope of this function, refer to the
ru: Для получения дополнительной информации об объектах находится в контексте в области этой функции, см.

source: source code of Superset's sandboxed parser
ru: исходный код sandboxed парсера Суперсета

source: This functionality is disabled in your environment for security reasons.
ru: Эта функция отключена в вашей среде по соображениям безопасности.

source: Ignore null locations
ru: Игнорировать пустые локации

source: Whether to ignore locations that are null
ru: Игнорировать местоположения, которые не содержат данных о расположении

source: Auto Zoom
ru: Авто масштабирование

source: When checked, the map will zoom to your data after each query
ru: Если отмечено, карта будет смасштабирована к вашим данным после каждого запроса

source: Select a dimension
ru: Выберете измерение

source: Extra data for JS
ru: Доп. данные для JS

source: List of extra columns made available in JavaScript functions
ru: Список дополнительных столбцов, предоставленных в функциях JavaScript

source: Define a javascript function that receives the data array used in the visualization and is expected to return a modified version of that array. This can be used to alter properties of the data, filter, or enrich the array.
ru: Определите функцию JavaScript, которая получает массив данных, используемый в визуализации, и, как ожидается, вернет модифицированную версию этого массива. Определите функцию javascript, которая получает массив данных, используемый в визуализации, и, как ожидается, вернет измененную версию этого массива. Это может быть использовано для изменения свойств данных, фильтрации или расширения массива.

source: Define a function that receives the input and outputs the content for a tooltip
ru: Задайте функцию, которая получает на вход содержимое всплывающей подсказки

source: Define a function that returns a URL to navigate to when user clicks
ru: Задайте функцию, которая возвращает URL для навигации при пользовательском нажатии

source: Legend Format
ru: Формат легенды

source: Choose the format for legend values
ru: Выберите формат значений легенды

source: Legend Position
ru: Расположение легенды

source: Choose the position of the legend
ru: Выберите позицию легенды

source: Top left
ru: Сверху слева

source: Top right
ru: Сверху справа

source: Bottom left
ru: Снизу слева

source: Bottom right
ru: Снизу справа

source: Lines column
ru: Линии столбца

source: The database columns that contains lines information
ru: Столбцы базы данных, содержащие информацию о строках

source: Line width
ru: Толщина линии

source: The width of the lines
ru: Ширина линий

source: Fill Color
ru: Цвет заливки

source: Set the opacity to 0 if you do not want to override the color specified in the GeoJSON
ru: Установите прозрачность 0, если вы не хотите переписывать цвет, указанный в GeoJSON

source: Stroke Color
ru: Цвет обводки

source: Filled
ru: С заливкой

source: Whether to fill the objects
ru: Использовать заливку для объектов

source: Stroked
ru: С обводкой

source: Whether to display the stroke
ru: Отображение обводки

source: Extruded
ru: Экструдирован

source: Whether to make the grid 3D
ru: Сделать сетку 3D

source: Grid Size
ru: Размер сетки

source: Defines the grid size in pixels
ru: Определяет размер сетки (в пикселях)

source: Parameters related to the view and perspective on the map
ru: Параметры, связанные с представлением и перспективой на карте

source: Longitude & Latitude
ru: Долгота и Широта

source: Fixed point radius
ru: Фиксированный радиус

source: Multiplier
ru: Мультипликатор

source: Factor to multiply the metric by
ru: Число, на которое умножается мера

source: Lines encoding
ru: Кодирование линий

source: The encoding format of the lines
ru: Формат кодирования линий

source: geohash (square)
ru: geohash (квадрат)

source: Reverse Lat & Long
ru: Поменять местами широту и долготу

source: GeoJson Column
ru: Столбец GeoJson

source: Select the geojson column
ru: Выберите geojson столбец

source: Right Axis Format
ru: Формат правой оси

source: Show Markers
ru: Показать маркеры

source: Show data points as circle markers on the lines
ru: Покажите точки данных как маркеры кружков на линии

source: Y bounds
ru: Показывать границы оси Y

source: Whether to display the min and max values of the Y-axis
ru: Отображать минимальное и максимальное значение на оси Y

source: Y 2 bounds
ru: Границы оси Y 2

source: Line Style
ru: Тип линии

source: linear
ru: линейный

source: basis
ru: Основа

source: cardinal
ru: кардинал

source: monotone
ru: монотон

source: step-before
ru: шаг перед

source: step-after
ru: шаг-после

source: Line interpolation as defined by d3.js
ru: Линейная интерполяция, определенная в d3.js

source: Show Range Filter
ru: Показать фильтр Диапазон

source: Whether to display the time range interactive selector
ru: Отображение интерактивного селектора временного интервала

source: Extra Controls
ru: Дополнительные элементы управления

source: Whether to show extra controls or not. Extra controls include things like making mulitBar charts stacked or side by side.
ru: Отображает дополнительные элементы управления на самом графике и позволяет менять отображение столбцов: без накопления и с ним.

source: X Tick Layout
ru: Расположение делений оси X

source: flat
ru: плоская

source: staggered
ru: ступенчатый

source: The way the ticks are laid out on the X-axis
ru: Способ расположения делений по оси X
