Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Comma-separated color picks for the intervals, e.g. 1,2,4. Integers denote colors from the chosen color scheme and are 1-indexed. Length must be matching that of interval bounds.
ru: Номера цветов, разделенные запятой, например, 1,2,4. Целые числа задают цвета из выбранной цветовой схемы и начинаются с 1 (не с нуля). Длина должна соответствовать границам интервала.

source: Uses a gauge to showcase progress of a metric towards a target. The position of the dial represents the progress and the terminal value in the gauge represents the target value.
ru: Использует индикатор для демонстрации прогресса показателя в достижении цели. Положение циферблата показывает ход выполнения, а конечное значение на индикаторе представляет целевое значение.

source: Gauge Chart
ru: Индикаторная диаграмма

source: Name of the source nodes
ru: Имя исходных вершин

source: Name of the target nodes
ru: Имя конечных вершин

source: Source category
ru: Исходная категория

source: The category of source nodes used to assign colors. If a node is associated with more than one category, only the first will be used.
ru: Категория исходных вершин предназначена для задания цветов. Если вершина связана более, чем с одной категорией, только первая будет использована.

source: Target category
ru: Целевая категория

source: Category of target nodes
ru: Категория целевых вершин

source: Chart options
ru: Свойства графика

source: Layout
ru: Оформление

source: Graph layout
ru: Формат сетевого графика

source: Force
ru: Силовой алгоритм

source: Layout type of graph
ru: Тип макета графика

source: Edge symbols
ru: Оформление ребер

source: Symbol of two ends of edge line
ru: Символ двух концов края линии

source: None -> None
ru: Ничего -> Ничего

source: None -> Arrow
ru: Ничего -> Стрелка

source: Circle -> Arrow
ru: Круг -> Стрелка

source: Circle -> Circle
ru: Круг -> Круг

source: Enable node dragging
ru: Разрешить перемещение вершин

source: Whether to enable node dragging in force layout mode.
ru: Включить перемещение вершин в режиме силового алгоритма.

source: Enable graph roaming
ru: Включить перемещение по графику

source: Disabled
ru: Отключено

source: Scale only
ru: Только масштабирование

source: Move only
ru: Только перемещение

source: Scale and Move
ru: Масштабирование и перемещение

source: Whether to enable changing graph position and scaling.
ru: Чтобы включить изменение позиции графика и масштабирование.

source: Node select mode
ru: Режим выбора вершин

source: Single
ru: Один

source: Multiple
ru: Несколько

source: Allow node selections
ru: Разрешить выбор вершин

source: Label threshold
ru: Порог метки

source: Minimum value for label to be displayed on graph.
ru: Минимальное значение метки для отображения на графике.

source: Node size
ru: Размер вершины

source: Median node size, the largest node will be 4 times larger than the smallest
ru: Медианный размер вершины, самая большая вершина будет в 4 раза больше самой маленькой.

source: Edge width
ru: Толщина ребра

source: Median edge width, the thickest edge will be 4 times thicker than the thinnest.
ru: Медианная толщина ребра, самое толстое ребро будет в 4 раза толще самой тонкой.

source: Edge length
ru: Длина ребер

source: Edge length between nodes
ru: Длина ребер между вершинами

source: Gravity
ru: Гравитация

source: Strength to pull the graph toward center
ru: Сила притяжения вершин к центру

source: Repulsion
ru: Отталкивание

source: Repulsion strength between nodes
ru: Сила отталкивания вершин

source: Friction
ru: Трение

source: Friction between nodes
ru: Сила трения между вершинами

source: Displays connections between entities in a graph structure. Useful for mapping relationships and showing which nodes are important in a network. Graph charts can be configured to be force-directed or circulate. If your data has a geospatial component, try the deck.gl Arc chart.
ru: Отображает соединения между объектами в структуре графика.

source: Graph Chart
ru: Сетевой график

source: Structural
ru: Структура

source: Legend Type
ru: Тип легенды

source: Piecewise
ru: Кусочно

source: Hard value bounds applied for color coding.
ru: Границы жестких значений применяются для цветовой кодировки.

source: Y-Axis
ru: ось Y

source: Numeric column used to calculate the histogram.
ru: Числовой столбец, используемый для расчета гистограммы.

source: The number of bins for the histogram
ru: Количество бункеров для гистограммы

source: Normalize
ru: Нормализовать

source: The normalize option transforms the histogram values into proportions or probabilities by dividing each bin's count by the total count of data points. This normalization process ensures that the resulting values sum up to 1, enabling a relative comparison of the data's distribution and providing a clearer understanding of the proportion of data points within each bin.
ru: Опция «Нормализовать» преобразует значения гистограммы в пропорции или вероятности, деляя количество каждого бина на общее количество точек данных. Этот процесс нормализации гарантирует, что полученные значения подводят 1, что позволяет относительно сравнительно сравнительно сравнивать распределение данных и обеспечивающих более ясное понимание доли данных данных. Нормировка преобразует значения гистограммы в пропорции или вероятности путем деления количества точек в каждом бине на общее количество точек данных. Такой процесс гарантирует, что итоговые суммы будут равны 1, что позволяет сравнить распределение данных и получить более четкое представление о доле точек данных в каждом бине.

source: The cumulative option allows you to see how your data accumulates over different values. When enabled, the histogram bars represent the running total of frequencies up to each bin. This helps you understand how likely it is to encounter values below a certain point. Keep in mind that enabling cumulative doesn't change your original data, it just changes the way the histogram is displayed.
ru: Совокупный параметр позволяет вам увидеть, как ваши данные накапливаются по разным значениям. Опция позволяет увидеть, как накапливаются данные при различных значениях. Если включено, столбцы гистограммы представляют собой общую сумму частот до каждого бина. Это поможет вам понять, насколько велика вероятность встретить значения ниже определенной точки. Помните, что включение этого режима не изменяет исходные данные, а лишь меняет способ отображения гистограммы.

source: The histogram chart displays the distribution of a dataset by representing the frequency or count of values within different ranges or bins. It helps visualize patterns, clusters, and outliers in the data and provides insights into its shape, central tendency, and spread.
ru: График Гистограмма отображает распределение набора данных путем, представляющего частоту или подсчет значений в разных диапазонах или ящиках. Он помогает визуализировать закономерности, кластеры и выбросы в данных и дает представление о его форме, центральной тенденции и разбросе.

source: Series type
ru: Тип серии

source: Smooth Line
ru: Гладкая линия

source: Step - start
ru: Шаг - начало

source: Step - middle
ru: шаг - середина

source: Step - end
ru: шаг - конец

source: Series chart type (line, bar etc)
ru: Тип диаграммы серии (линия, бар и т. Д.)

source: Area chart
ru: Диаграмма с областями

source: Draw area under curves. Only applicable for line types.
ru: Отобразить область под кривыми. Применимо только для линий"

source: Opacity of area chart.
ru: Непрозрачность диаграммы областей.

source: Marker
ru: Маркер

source: Draw a marker on data points. Only applicable for line types.
ru: Отобразить маркеры на данных. Применимо только для линий.

source: Marker size
ru: Размер маркера

source: Size of marker. Also applies to forecast observations.
ru: Размер маркера. Также применяется к прогнозным значениям.

source: Primary
ru: Первичная

source: Secondary
ru: Вторичная

source: Primary or secondary y-axis
ru: Первичная или вторичная ось Y

source: Shared query fields
ru: Поля общедоступного запроса

source: Query A
ru: Запрос А

source: Advanced analytics Query A
ru: Расширенный анализ: запрос А

source: Query B
ru: Запрос Б

source: Advanced analytics Query B
ru: Расширенный анализ: запрос Б

source: Data Zoom
ru: Масштабирование графика

source: Enable data zooming controls
ru: Включить элементы управления масштабированием данных

source: Minor Split Line
ru: Разметка полотна линиями

source: Draw split lines for minor y-axis ticks
ru: Рисует разделительные линии для небольших отметок оси Y

source: Primary y-axis Bounds
ru: Главные границы оси Y

source: Bounds for the primary Y-axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ru: Границы для первичной оси Y.

source: Primary y-axis format
ru: Формат первичной оси Y

source: Logarithmic scale on primary y-axis
ru: Логарифмическая шкала для главной оси Y

source: Secondary y-axis Bounds
ru: вторичные границы оси Y.

source: Bounds for the secondary Y-axis. Only works when Independent Y-axis bounds are enabled. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ru: Границы для вторичной оси Y.

source: Secondary y-axis format
ru: Формат вторичной оси Y

source: Secondary currency format
ru: Формат вторичной валюты

source: Secondary y-axis title
ru: Название вторичной оси Y

source: Logarithmic scale on secondary y-axis
ru: Логарифмическая шкала для вторичной оси Y

source: Customize Metrics
ru: Настроить меры

source: Visualize two different series using the same x-axis. Note that both series can be visualized with a different chart type (e.g. 1 using bars and 1 using a line).
ru: Визуализируйте две разные серии, используя одну и ту же ось X.

source: Mixed Chart
ru: Смешанный график

source: Rose Type
ru: Тип розы

source: Area
ru: Площадь

source: Radius
ru: Радиус

source: Whether to show as Nightingale chart.
ru: Показывать ли диаграмма Соловей.

source: Template
ru: Шаблон

source: Label Template
ru: Шаблон метки

source: Format data labels. Use variables: {name}, {value}, {percent}. \n represents a new line. ECharts compatibility: {a} (series), {b} (name), {c} (value), {d} (percentage)
ru: Форматируйте метки данных. Используйте переменные: {name}, {value}, {percent}. \n обозначает новую строку. Совместимость с ECharts: {a} (серия), {b} (имя), {c} (значение), {d} (процент)

source: Put the labels outside of the pie?
ru: Вынести метки за пределы диаграммы

source: Label Line
ru: Линия метки

source: Draw line from Pie to label when labels outside?
ru: Проводит линию от диаграммы к метке, когда метки находятся снаружи

source: Show Total
ru: Показать общий итог

source: Whether to display the aggregate count
ru: Отображать совокупное количество

source: Pie shape
ru: Форма круговой диаграммы

source: Outer Radius
ru: Внешний радиус

source: Outer edge of Pie chart
ru: Внешний радиус круговой диаграммы

source: Inner Radius
ru: Внутренний радиус

source: Inner radius of donut hole
ru: Внутренний радиус отверстия для кольца

source: The classic. Great for showing how much of a company each investor gets, what demographics follow your blog, or what portion of the budget goes to the military industrial complex. Pie charts can be difficult to interpret precisely. If clarity of relative proportion is important, consider using a bar or other chart type instead.
ru: Классическая круговая/кольцевая диаграмма.

source: Pie Chart
ru: Круговая диаграмма

source: Nightingale
ru: Соловья

source: Total: %s
ru: Итого: %s

source: The maximum value of metrics. It is an optional configuration
ru: Максимальное значение мер. Это необязательная настройка

source: Label position
ru: Положение метки

source: Radar
ru: Радар

source: Further customize how to display each metric
ru: Дальнейшая настройка отображения каждой меры

source: Circle radar shape
ru: Круглая форма радара

source: Radar render type, whether to display 'circle' shape.
ru: Тип рендеринга радара, чтобы отображать форму «круга».

source: Visualize a parallel set of metrics across multiple groups. Each group is visualized using its own line of points and each metric is represented as an edge in the chart.
ru: Визуализируйте параллельный набор метрик в нескольких группах.

source: Radar Chart
ru: Диаграмма радар

source: The column to be used as the source of the edge.
ru: Столбец, который будет использоваться в качестве источника края.

source: The column to be used as the target of the edge.
ru: Столбец, который будет использоваться в качестве цели края.

source: The Sankey chart visually tracks the movement and transformation of values across system stages. Nodes represent stages, connected by links depicting value flow. Node height corresponds to the visualized metric, providing a clear representation of value distribution and transformation.
ru: График Sankey визуально отслеживает движение и преобразование значений на этапах системы. Узлы представляют этапы, соединенные связями, изображающими поток ценностей. Узел высота узла соответствует визуализированной метрике, обеспечивая наглядное представление Распределения и трансформации стоимости.

source: Sankey Chart
ru: График Sankey

source: Primary Metric
ru: Основная мера

source: The primary metric is used to define the arc segment sizes
ru: Основная мера используется для определения размера сегмента дуги

source: Secondary Metric
ru: Вторичная мера

source: [optional] this secondary metric is used to define the color as a ratio against the primary metric. When omitted, the color is categorical and based on labels
ru: [необязательно] вторичная мера используется для определения цвета как доли по отношению к основной мере. Если не выбрано, цвет задается согласно имени категории

source: When only a primary metric is provided, a categorical color scale is used.
ru: Когда предоставляется только основная мера, используется категориальная цветовая схема.

source: When a secondary metric is provided, a linear color scale is used.
ru: Когда предоставляется вторичная мера, используется линейная цветовая схема.

source: Hierarchy
ru: Иерархия

source: Sets the hierarchy levels of the chart. Each level is represented by one ring with the innermost circle as the top of the hierarchy.
ru: Устанавливает уровни иерархии диаграммы.

source: Uses circles to visualize the flow of data through different stages of a system. Hover over individual paths in the visualization to understand the stages a value took. Useful for multi-stage, multi-group visualizing funnels and pipelines.
ru: использует круги для визуализации потока данных через разные этапы системы.

source: Sunburst Chart
ru: Диаграмма Солнечные лучи

source: Multi-Levels
ru: Многоуровневый

source: % of total
ru: % от общего числа

source: % of parent
ru: % родителей

source: When using other than adaptive formatting, labels may overlap
ru: При использовании, кроме адаптивного форматирования, этикетки могут перекрываться

source: Swiss army knife for visualizing data. Choose between step, line, scatter, and bar charts. This viz type has many customization options as well.
ru: швейцарский армейский нож для визуализации данных.

source: Generic Chart
ru: Общая диаграмма

source: zoom area
ru: зомская зона

source: restore zoom
ru: восстановить масштабирование

source: Series Style
ru: Стиль категорий

source: Area chart opacity
ru: Непрозрачность диаграммы с областями

source: Opacity of Area Chart. Also applies to confidence band.
ru: Непрозрачность зоны.

source: Marker Size
ru: Размер маркера

source: Area charts are similar to line charts in that they represent variables with the same scale, but area charts stack the metrics on top of each other.
ru: Диаграммы с областями похожи на линейные диаграммы в том смысле, что они отображают показатели с одинаковым масштабом, но диаграммы областей накладывают эти показатели друг на друга.

source: Area Chart
ru: Диаграмма с областями

source: Axis Title
ru: Название оси

source: AXIS TITLE MARGIN
ru: ОТСТУП ЗАГОЛОВКА ОСИ

source: AXIS TITLE POSITION
ru: ПОЛОЖЕНИЕ ЗАГОЛОВКА ОСИ

source: Axis Format
ru: Формат Оси

source: Logarithmic axis
ru: Логарифмическая ось

source: Draw split lines for minor axis ticks
ru: Рисует разделительные линии для небольших отметок оси

source: Truncate Axis
ru: Настройка интервала оси

source: It’s not recommended to truncate axis in Bar chart.
ru: Не рекомендуется урезать интервал оси в столбчатой диаграмме

source: Axis Bounds
ru: Границы оси

source: Bounds for the axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ru: Границы для оси. Границы для оси. Если оставить поле пустым, границы динамически определяются на основе минимального/максимального значения данных. Обратите внимание, что эта функция только расширит диапазон осей. Она не изменит размер графика.

source: Chart Orientation
ru: Ориентация графика

source: Bar orientation
ru: Направление столбцов

source: Vertical
ru: Вертикально

source: Horizontal
ru: Горизонтально

source: Orientation of bar chart
ru: Ориентация диаграммы

source: Bar Charts are used to show metrics as a series of bars.
ru: Столбчатые диаграммы используются для отображения показателей в виде серии столбцов.

source: Bar Chart
ru: Столбчатая диаграмма

source: Line chart is used to visualize measurements taken over a given category. Line chart is a type of chart which displays information as a series of data points connected by straight line segments. It is a basic type of chart common in many fields.
ru: Линейная диаграмма используется для визуализации измерений, взятых по данной категории. Линейная диаграмма используется для визуализации показателей, полученных в рамках одной категории. Линейная диаграмма - это тип диаграммы, который отображает информацию в виде ряда точек данных, соединенных прямыми отрезками. Это базовый тип диаграммы, распространенный во многих областях.

source: Line Chart
ru: Линейный график

source: Scatter Plot has the horizontal axis in linear units, and the points are connected in order. It shows a statistical relationship between two variables.
ru: График Scatter Plot имеет горизонтальную ось в линейных единицах, а точки соединены по порядку. Он показывает статистическую связь между двумя переменными.

source: Scatter Plot
ru: Точечная диаграмма

source: Smooth-line is a variation of the line chart. Without angles and hard edges, Smooth-line sometimes looks smarter and more professional.
ru: Плавная линия-это вариация линейной диаграммы.

source: Step type
ru: Тип шага

source: Start
ru: Начало

source: Middle
ru: Середина

source: End
ru: Конец

source: Defines whether the step should appear at the beginning, middle or end between two data points
ru: Определяет, должен ли шаг отображаться в начале, середине или конце между двумя точками данных

source: Stepped-line graph (also called step chart) is a variation of line chart but with the line forming a series of steps between data points. A step chart can be useful when you want to show the changes that occur at irregular intervals.
ru: график Stepped-Line (также называемый этап-диаграмма) представляет собой вариацию линейной диаграммы, но с линией, образующей серию шагов между точками данных.

source: Name of the id column
ru: Имя столбца id

source: Parent
ru: Родитель

source: Name of the column containing the id of the parent node
ru: Имя столбца, содержащее id родительской вершины

source: Optional name of the data column.
ru: Необязательное имя столбца данных.

source: Root node id
ru: Идентификатор корневого узла

source: Id of root node of the tree.
ru: Id корневой вершины дерева.

source: Metric for node values
ru: Мера для значений вершин

source: Tree layout
ru: Оформление дерева

source: Orthogonal
ru: ортогональный

source: Radial
ru: Радиальное

source: Layout type of tree
ru: Тип макета дерева

source: Tree orientation
ru: Ориентация дерева

source: Left to Right
ru: Слева направо

source: Right to Left
ru: Справа налево

source: Top to Bottom
ru: Сверху вниз

source: Bottom to Top
ru: Снизу вверх

source: Orientation of tree
ru: Ориентация дерева

source: Node label position
ru: Расположение метки вершины

source: left
ru: слева

source: top
ru: сверху

source: right
ru: справа

source: bottom
ru: снизу

source: Position of intermediate node label on tree
ru: Положение метки промежуточного узла на дереве

source: Child label position
ru: Положение метки дочернего элемента

source: Position of child node label on tree
ru: Расположение метки дочерней вершины на дереве

source: Emphasis
ru: Акцент

source: ancestor
ru: предок

source: descendant
ru: потомок

source: Which relatives to highlight on hover
ru: Подсвечивается при наведении

source: Symbol
ru: Символ

source: Empty circle
ru: Пустой круг

source: Circle
ru: Круг

source: Rectangle
ru: Прямоугольник

source: Triangle
ru: Треугольник

source: Diamond
ru: Ромб

source: Pin
ru: Закрепить

source: Arrow
ru: Стрела

source: Symbol size
ru: Размер символа

source: Size of edge symbols
ru: Размер краевых символов

source: Visualize multiple levels of hierarchy using a familiar tree-like structure.
ru: Визуализирует несколько уровней иерархии, используя древовидную структуру.

source: Tree Chart
ru: Древовидная диаграмма

source: Show Upper Labels
ru: Показать верхние метки

source: Show labels when the node has children.
ru: Показывать метки, когда у вершины есть дочерние элементы.

source: Key
ru: Ключ

source: Show hierarchical relationships of data, with the value represented by area, showing proportion and contribution to the whole.
ru: Покажите иерархические отношения данных, причем значение представлено площадью, показывающая пропорцию и вклад в целое.

source: Total
ru: Итого

source: Assist
ru: Помощь

source: Increase
ru: Увеличение

source: Decrease
ru: Уменьшение

source: Series colors
ru: Цвета серий

source: Breaks down the series by the category specified in this control. This can help viewers understand how each category affects the overall value.
ru: Разбивает серию по категории, указанной в этом элементе управления. Это может помочь зрителям понять, как каждая категория влияет на общее значение.

source: A waterfall chart is a form of data visualization that helps in understanding the cumulative effect of sequentially introduced positive or negative values. These intermediate values can either be time based or category based.
ru: Диаграмма водопада - это форма визуализации данных, которая помогает в понимании совокупного эффекта последовательно введенных положительных или отрицательных значений.

source: page_size.all
ru: все

source: Loading...
ru: Загрузка...

source: Write a handlebars template to render the data
ru: Напишите шаблон руля, чтобы отображать данные

source: must have a value
ru: значение обязательно

source: Handlebars Template
ru: Шаблон Handlebars

source: A handlebars template that is applied to the data
ru: Шаблон handlebars, примененный к данным

source: Include time
ru: Включить время

source: Whether to include the time granularity as defined in the time section
ru: Добавляет столбец даты/времени с группировкой дат, как определено в разделе Время

source: Percentage metrics
ru: Процентные меры
