Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: CSS templates
ru: CSS шаблоны

source: There was an issue deleting the selected templates: %s
ru: Произошла ошибка при удалении выбранных шаблонов: %s

source: CSS template
ru: CSS шаблон

source: This action will permanently delete the template.
ru: Это действие навсегда удалит шаблон.

source: Delete Template?
ru: Удалить шаблон?

source: Are you sure you want to delete the selected templates?
ru: Вы уверены, что хотите удалить выбранные шаблоны?

source: The passwords for the databases below are needed in order to import them together with the dashboards. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ru: Для баз данных нужны пароли, чтобы импортировать их вместе с дашбордами. Пожалуйста, обратите внимание, что разделы "Безопасность" и "Утверждение" в настройках конфигурации базы данных отсутствуют в экспортируемых файлах и должны быть добавлены вручную после импорта, если необходимо.

source: You are importing one or more dashboards that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы импортируете один или несколько дашбордов, которые уже существуют. Перезапись может привести к потере части вашей работы. Вы уверены, что хотите перезаписать?

source: Dashboard imported
ru: Дашборд импортирован

source: There was an issue deleting the selected dashboards:
ru: Произошла ошибка при удалении выбранных дашбордов:

source: An error occurred while fetching dashboard owner values: %s
ru: Произошла ошибка при получении владельца дашборда: %s

source: Are you sure you want to delete the selected dashboards?
ru: Вы уверены, что хотите удалить выбранные дашборды?

source: An error occurred while fetching database related data: %s
ru: Произошла ошибка при получении данных о базе данных: %s

source: Upload file to database
ru: Загрузить файл в базу данных

source: Upload CSV
ru: Загрузить CSV

source: Upload Excel
ru: Загрузить Excel

source: Upload Columnar
ru: Загрузить Columnar

source: AQE
ru: Асинхронные запросы

source: Allow data manipulation language
ru: Разрешить операции вставки, обновления и удаления данных

source: File upload
ru: Загрузка файлов

source: Delete database
ru: Удалить базу данных

source: The database %s is linked to %s charts that appear on %s dashboards and users have %s SQL Lab tabs using this database open. Are you sure you want to continue? Deleting the database will break those objects.
ru: База данных %s привязана к %s графику(-ам), который(-ые) используется(-ются) в %s дашборде(-ах), и пользователи имеют %s открытую(-ых) вкладку(-ок) в Лаборатории SQL. Вы уверены, что хотите продолжить? Удаление базы данных приведёт к неработоспособности этих компонентов.

source: Delete Database?
ru: Удалить базу данных?

source: Dataset imported
ru: Импортирован датасет

source: An error occurred while fetching dataset related data
ru: Произошла ошибка при получении метаданных датасета

source: An error occurred while fetching dataset related data: %s
ru: Произошла ошибка при получении данных о датасете: %s

source: Physical dataset
ru: Физический датасет

source: Virtual dataset
ru: Виртуальный датасет

source: Virtual
ru: Виртуальный

source: Search by query text
ru: Поиск по тексту запроса

source: An error occurred while fetching datasets: %s
ru: Произошла ошибка при получении датасетов: %s

source: An error occurred while fetching schema values: %s
ru: Произошла ошибка при извлечении значений схемы: %s

source: An error occurred while fetching dataset owner values: %s
ru: Произошла ошибка при получении владельца датасета: %s

source: Import datasets
ru: Импортировать датасеты

source: There was an issue deleting the selected datasets: %s
ru: Произошла ошибка при удалении выбранных датасетов: %s

source: There was an issue duplicating the dataset.
ru: Произошла ошибка при дублировании датасета.

source: There was an issue duplicating the selected datasets: %s
ru: Произошла ошибка при дублировании выбранных датасетов: %s

source: The dataset %s is linked to %s charts that appear on %s dashboards. Are you sure you want to continue? Deleting the dataset will break those objects.
ru: Датасет %s привязан к %s графику(-ам), который(-ые) используется(-ются) в %s дашборде(-ах). Вы уверены, что хотите продолжить? Удаление датасета приведёт к неработоспособности этих объектов.

source: Delete Dataset?
ru: Удалить датасет?

source: Are you sure you want to delete the selected datasets?
ru: Вы уверены, что хотите удалить выбранные датасеты?

source: 0 Selected
ru: 0 выбрано

source: %s Selected (Virtual)
ru: %s Выбрано (Виртуальные)

source: %s Selected (Physical)
ru: %s Выбрано (Физические)

source: %s Selected (%s Physical, %s Virtual)
ru: %s Выбрано (%s Физические, %s Виртуальные)

source: log
ru: журнал

source: Execution ID
ru: ID исполнения

source: Scheduled at (UTC)
ru: Запланировано на (часовой пояс UTC)

source: Start at (UTC)
ru: Время начала (UTC)

source: Error message
ru: Сообщение об ошибке

source: There was an issue fetching your recent activity: %s
ru: Произошла ошибка при получении вашей последней активности: %s

source: Home
ru: Главная

source: Thumbnails
ru: Миниатюры

source: Recents
ru: Недавние

source: There was an issue previewing the selected query. %s
ru: Произошла ошибка при предпросмотре выбранного запроса: %s

source: TABLES
ru: ТАБЛИЦЫ

source: Open query in SQL Lab
ru: Открыть в SQL редакторе

source: An error occurred while fetching database values: %s
ru: Произошла ошибка при получении значений базы данных: %s

source: An error occurred while fetching user values: %s
ru: Произошла ошибка при извлечении пользовательских значений: %s

source: Row Level Security
ru: Безопасность на уровне строк

source: Deleted %s
ru: Удалено %s

source: Deleted
ru: Удалено

source: There was an issue deleting rules: %s
ru: Возникла проблема с удалением правил: %s

source: No Rules yet
ru: Правила отсутствуют

source: Are you sure you want to delete the selected rules?
ru: Вы уверены, что хотите удалить выбранные правила?

source: The passwords for the databases below are needed in order to import them together with the saved queries. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ru: Для баз данных нужны пароли, чтобы импортировать их вместе с сохраненными запросами. Пожалуйста, обратите внимание, что разделы "Безопасность" и "Утверждение" в настройках конфигурации базы данных отсутствуют в экспортируемых файлах и должны быть добавлены вручную после импорта, если необходимо.

source: You are importing one or more saved queries that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы импортируете один или несколько сохраненных запросов, которые уже существуют. Перезапись может привести к потере части вашей работы. Вы уверены, что хотите продолжить?

source: Query imported
ru: Запрос импортирован

source: There was an issue previewing the selected query %s
ru: Произошла ошибка при предпросмотре выбранного запроса %s

source: Import queries
ru: Импортировать запросы

source: Link Copied!
ru: Ссылка скопирована!

source: There was an issue deleting the selected queries: %s
ru: Произошла ошибка при удалении выбранных запросов: %s

source: Edit query
ru: Редактировать запрос

source: Copy query URL
ru: Скопировать ссылку на запрос

source: Export query
ru: Экспорт запроса

source: Delete query
ru: Удалить запрос

source: Searches all text fields: Name, Description, Database & Schema
ru: Поиск по всем текстовым полям: Название, Описание, База данных и Схема

source: Are you sure you want to delete the selected queries?
ru: Вы уверены, что хотите удалить выбранные запросы?

source: queries
ru: запросы

source: tag
ru: тег

source: No Tags created
ru: Нет созданных Тегов

source: Are you sure you want to delete the selected tags?
ru: Вы уверены, что хотите удалить выбранные теги?

source: Image download failed, please refresh and try again.
ru: Ошибка скачивания изображения, пожалуйста, обновите и попробуйте заново.

source: PDF download failed, please refresh and try again.
ru: Загрузка PDF не удалась, пожалуйста, обновите и попробуйте снова.

source: Select values in highlighted field(s) in the control panel. Then run the query by clicking on the %s button.
ru: Выберите значения в обязательных полях на панели управления. Затем запустите запрос, нажав на кнопку %s.

source: An error occurred while fetching %s info: %s
ru: Произошла ошибка при получении информации о %s: %s

source: An error occurred while fetching %ss: %s
ru: Произошла ошибка при получении: %s: %s

source: An error occurred while creating %ss: %s
ru: Произошла ошибка при создании %ss: %s

source: Please re-export your file and try importing again
ru: Пожалуйста, повторно экспортируйте ваш файл и попробуйте импортировать его снова

source: An error occurred while importing %s: %s
ru: Произошла ошибка при попытке импортировать %s: %s

source: There was an error fetching the favorite status: %s
ru: Произошла ошибка при получении статуса избранного: %s

source: There was an error saving the favorite status: %s
ru: Произошла ошибка при сохранении статуса избранного: %s

source: Connection looks good!
ru: Соединение в порядке!

source: ERROR: %s
ru: ОШИБКА: %s

source: There was an error fetching the filtered charts and dashboards:
ru: Возникла ошибка при получении отфильтрованных графиков и приборных панелей:

source: There was an issue deleting: %s
ru: Произошла ошибка при удалении: %s

source: URL
ru: Ссылка (URL)

source: Templated link, it's possible to include {{ metric }} or other values coming from the controls.
ru: Шаблонная ссылка, можно включить {{ metric }} или другие значения, поступающие из элементов управления.

source: Time-series Table
ru: Таблица временных рядов

source: Compare multiple time series charts (as sparklines) and related metrics quickly.
ru: Быстрое сравнение нескольких графиков временных рядов (в виде спарклайнов) и связанных с ними показателей.

source: Text
ru: Текст

source: We have the following keys: %s
ru: У нас есть следующие ключи: %s

source: Query History
ru: История запросов

source: Manage
ru: Управление

source: List Users
ru: Список пользователей

source: List Roles
ru: Список ролей

source: Action Log
ru: Журнал Действий

source: Database Connections
ru: Базы данных

source: Plugins
ru: Плагины

source: CSS Templates
ru: CSS шаблоны

source: Alerts & Reports
ru: Оповещения и отчеты

source: Drop columns here or click
ru: Перетащите столбцы сюда

source: Saved Queries
ru: Сохраненные Запросы

source: Select all
ru: Выбрать все

source: Show values
ru: Показать значения

source: Hide values
ru: Скрыть значения
