Repository: dodopizza/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Sorry, An error occurred
ru: Извините, произошла ошибка

source: Save as Dataset
ru: Сохранить как датасет

source: Open in SQL Lab
ru: Открыть в SQL редакторе

source: Failed to verify select options: %s
ru: Ошибка при проверке вариантов выбора: %s

source: No annotation layers
ru: Нет слоев аннотаций

source: Add an annotation layer
ru: Добавить слой аннотации

source: Annotation layer
ru: Слой аннотаций

source: Select the Annotation Layer you would like to use.
ru: Выбрать слой аннотации, который вы хотите использовать.

source: Use another existing chart as a source for annotations and overlays. Your chart must be one of these visualization types: [%s]
ru: Используйте другую существующую диаграмму в качестве источника для аннотаций и наложений. \ N Ваша диаграмма должна быть одним из этих типов визуализации: [%s]

source: Expects a formula with depending time parameter 'x' in milliseconds since epoch. mathjs is used to evaluate the formulas. Example: '2x+5'
ru: Формула с зависимой переменной 'x' в милисекундах с 1970 года (Unix-время). Для рассчета используется mathjs. Например: '2x+5'

source: Annotation layer value
ru: Значение слоя аннотации

source: Bad formula.
ru: Неверная формула.

source: Annotation Slice Configuration
ru: Настройки аннотации из графика

source: This section allows you to configure how to use the slice to generate annotations.
ru: Этот раздел позволяет настроить, как использовать Slice \ N для генерации аннотаций.

source: Annotation layer time column
ru: Столбец времени Аннотации Время времени

source: Interval start column
ru: Столбец с началом интервала

source: Event time column
ru: Столбец формата дата/время

source: This column must contain date/time information.
ru: В этом столбец должны быть данные формата дата/время.

source: Annotation layer interval end
ru: Конечный интервал слоя аннотации

source: Interval End column
ru: Столбец с концом интервала

source: Annotation layer title column
ru: Столбец заголовка аннотации слоя

source: Title Column
ru: Столбец с названием

source: Pick a title for you annotation.
ru: Выберите название для вашей аннотации

source: Annotation layer description columns
ru: Описательные столбцы слоя аннотаций.

source: Description Columns
ru: Описательные столбцы

source: Pick one or more columns that should be shown in the annotation. If you don't select a column all of them will be shown.
ru: Выберите один или несколько столбцов, которые должны отображаться в аннотации. Если вы не выберите столбец, все столбцы будут отображены.

source: Override time range
ru: Переопределить временной интервал

source: This controls whether the "time_range" field from the current view should be passed down to the chart containing the annotation data.
ru: Должен ли временной интервал из этого представления переписать временной интервал графика, содержащего данные аннотации.

source: Override time grain
ru: Переопределить единицу времени

source: This controls whether the time grain field from the current view should be passed down to the chart containing the annotation data.
ru: Должен ли единица времени из этой таблицы переписать единицу времени графика.

source: Time delta in natural language (example: 24 hours, 7 days, 56 weeks, 365 days)
ru: Временной сдвиг на естественном языке (например: 24 hours, 7 days, 56 weeks, 365 days)

source: Display configuration
ru: Настройки отображения

source: Configure your how you overlay is displayed here.
ru: Настройка отображения слоя аннотации поверх графика.

source: Annotation layer stroke
ru: Штрих слоя аннотации

source: Style
ru: Стиль

source: Solid
ru: Сплошной

source: Dashed
ru: Штрих

source: Long dashed
ru: Длинный штрих

source: Dotted
ru: Пунктир

source: Annotation layer opacity
ru: Непрозрачность слоя аннотации

source: Automatic Color
ru: Автоматический цвет

source: Shows or hides markers for the time series
ru: Показывает или скрывает маркеры для временных рядов

source: Hide Line
ru: Скрыть линию

source: Hides the Line for the time series
ru: Скрывает линию для временных рядов

source: Layer configuration
ru: Настройки слоя

source: Configure the basics of your Annotation Layer.
ru: Настройте слой аннотации.

source: Mandatory
ru: Обязательно

source: Hide layer
ru: Скрыть слой

source: Show label
ru: Показывать метку

source: Whether to always show the annotation label
ru: Всегда показывать метку аннотации

source: Annotation layer type
ru: Тип слоя аннотации

source: Choose the annotation layer type
ru: Выбрать тип слоя аннотации

source: Annotation source type
ru: Тип источника аннотации

source: Choose the source of your annotations
ru: Выберите источник аннотаций

source: Annotation source
ru: Источник аннотации

source: Remove
ru: Удалить

source: Time series
ru: Временной ряд

source: Edit annotation layer
ru: Редактировать слой аннотации

source: Add annotation layer
ru: Добавить слой аннотации

source: Empty collection
ru: Пустая коллекция

source: Add an item
ru: Добавить запись

source: Remove item
ru: Удалить элемент

source: The colors of this chart might be overridden by custom label colors of the related dashboard. Check the JSON metadata in the Advanced settings.
ru: Цвета этой диаграммы могут быть переопределены по индивидуальным цветам метки соответствующей приборной панели. \ N Проверьте метаданные JSON в расширенных настройках.

source: The color scheme is determined by the related dashboard. Edit the color scheme in the dashboard properties.
ru: Цветовая схема определяется соответствующей панелью.Цветовая схема определена соответствующим дашбордом. Измените цветовую схему в свойствах дашборда.

source: You are viewing this chart in a dashboard context with labels shared across multiple charts. The color scheme selection is disabled.
ru: Вы просматриваете эту диаграмму в контексте приборной панели с этикетками, разделенными по нескольким диаграммам. \ N Выбор цветовой схемы отключена.

source: You are viewing this chart in the context of a dashboard that is directly affecting its colors. To edit the color scheme, open this chart outside of the dashboard.
ru: Вы просматриваете эту диаграмму в контексте приборной панели, которая напрямую влияет на ее цвета.

source: Dashboard scheme
ru: Схема дашборда

source: Custom color palettes
ru: Пользовательские цветовые палитры

source: Featured color palettes
ru: Показанные цветовые палитры

source: Other color palettes
ru: Другие цветовые палитры

source: Select color scheme
ru: Выберите цветовую схему

source: Select scheme
ru: Выберите схему

source: Show less columns
ru: Показать меньше столбцов

source: Show all columns
ru: Показать все столбцы

source: This metric will be exported as time
ru: Эта мера будет экспортирована в формате времени

source: Fraction digits
ru: Десятичные знаки

source: Number of decimal digits to round numbers to
ru: Кол-во десятичных разрядов для округления числа

source: Min Width
ru: Минимальная ширина

source: Default minimal column width in pixels, actual width may still be larger than this if other columns don't need much space
ru: Минимальная ширина столбца (в пикселях). Реальная ширина по-прежнему может быть больше, чем указанная, если остальным столбцам не будет хватать места

source: Text align
ru: Выравнивание текста

source: Horizontal alignment
ru: Выравнивание по горизонтали

source: Show cell bars
ru: Наложить гистограммы на ячейки

source: Whether to align positive and negative values in cell bar chart at 0
ru: Выравнивание гистограммы внутри ячеек по горизонтали слева

source: Color +/-
ru: Раскрасить +/-

source: Whether to colorize numeric values by if they are positive or negative
ru: Окрашивать ячейки с числами в зависимости от их знака

source: Truncate Cells
ru: Усеченные клетки

source: Truncate long cells to the "min width" set above
ru: Усечение длинных ячеек до «минимальной ширины», установленной выше

source: Pin column
ru: Закрепить колонку

source: Pin column with horizontal scroll
ru: Закрепить колонку при горизонтальном скроле

source: Select aggregate options
ru: Выберите настройки агрегации

source: %s aggregates(s)
ru: Агрегатных функций: %s

source: Hide value in Total
ru: Скрыть значение в Total

source: Customize chart metrics or columns with currency symbols as prefixes or suffixes. Choose a symbol from dropdown or type your own.
ru: Настройте метрики диаграммы или столбцы с символами валюты в качестве префиксов или суффиксов.

source: Small number format
ru: Форматирование маленьких чисел

source: D3 number format for numbers between -1.0 and 1.0, useful when you want to have different significant digits for small and large numbers
ru: формат номеров D3 для чисел от -1,0 до 1,0, полезный, если вы хотите иметь различные значимые цифры для небольших и больших чисел

source: No gradient
ru: Нет градиента

source: Color:
ru: Цвет:

source: Lower threshold must be lower than upper threshold
ru: Нижний порог должен быть ниже, чем верхний порог

source: Upper threshold must be greater than lower threshold
ru: Верхний порог должен быть больше нижнего порога

source: Isoline
ru: изолиния

source: Threshold
ru: Порог

source: Defines the value that determines the boundary between different regions or levels in the data
ru: определяет значение, которое определяет границу между различными регионами или уровнями в данных

source: The width of the Isoline in pixels
ru: ширина изолина в пикселях

source: The color of the isoline
ru: цвет изолинии

source: Isoband
ru: Изобанд

source: Lower Threshold
ru: Нижний порог

source: The lower limit of the threshold range of the Isoband
ru: Нижний предел порогового диапазона изобанд

source: Upper Threshold
ru: Верхний порог

source: The upper limit of the threshold range of the Isoband
ru: верхний предел порогового диапазона изобанд

source: The color of the isoband
ru: Цвет изолинии

source: Click to add a contour
ru: Нажмите, чтобы добавить контур

source: Prefix
ru: Префикс

source: Suffix
ru: Суффикс

source: Currency prefix or suffix
ru: Префикс или суффикс валюты

source: Prefix or suffix
ru: Префикс или суффикс

source: Currency symbol
ru: Символ валюты

source: Currency
ru: Валюта

source: Edit dataset
ru: Редактировать датасет

source: You must be a dataset owner in order to edit. Please reach out to a dataset owner to request modifications or edit access.
ru: Вы должны быть владельцем датасета для его редактирования. Пожалуйста, обратитесь к владельцу с просьбой предоставить доступ.

source: View in SQL Lab
ru: Открыть в Лаборатории SQL

source: Query preview
ru: Предпросмотр запроса

source: Save as dataset
ru: Сохранить как датасет

source: Missing URL parameters
ru: Пропущенные параметры URL

source: The URL is missing the dataset_id or slice_id parameters.
ru: URL -адрес отсутствует параметры dataset_id или slice_id.

source: The dataset linked to this chart may have been deleted.
ru: Датасет, связанный с этим графиком, похоже, был удален.

source: RANGE TYPE
ru: Тип

source: Actual time range
ru: Текущие настройки фильтрации времени

source: APPLY
ru: ПРИМЕНИТЬ

source: Edit time range
ru: Изменить временной интервал

source: Configure Advanced Time Range
ru: Установить особый временной интервал

source: START (INCLUSIVE)
ru: НАЧАЛО (ВКЛЮЧИТЕЛЬНО)

source: Start date included in time range
ru: Начальная дата включена во временной интервал

source: END (EXCLUSIVE)
ru: КОНЕЦ (НЕ ВКЛЮЧИТЕЛЬНО)

source: End date excluded from time range
ru: Конечная дата исключена из временного интервала

source: Configure Time Range: Previous...
ru: Установить временной интервал: предыдущий...

source: Configure Time Range: Last...
ru: Установить временной интервал: последний...

source: Configure Time Range: Current...
ru: Настройте диапазон времени: текущий ...

source: Configure custom time range
ru: Установить пользовательский временной интервал

source: Relative quantity
ru: Относительное количество

source: Relative period
ru: Относительный период

source: END (INCLUSIVE)
ru: КОНЕЦ (ВКЛЮЧИТЕЛЬНО)

source: End date included to time range
ru: Дата окончания включена в диапазон времени

source: Anchor to
ru: Привязать к

source: NOW
ru: Сейчас

source: Date/Time
ru: Дата/Время

source: Return to specific datetime.
ru: Вернуться к конкретной дате.

source: Syntax
ru: Синтаксис

source: Example
ru: Пример

source: Moves the given set of dates by a specified interval.
ru: Перемещает заданный набор дат с указанным интервалом.

source: Truncates the specified date to the accuracy specified by the date unit.
ru: Усекает указанную дату с точностью, указанной в единице измерения даты.

source: Get the last date by the date unit.
ru: Получить последнюю дату от подразделения даты.

source: Get the specify date for the holiday
ru: Получить дату указания на праздник

source: Previous
ru: Предыдущий

source: Current
ru: Текущий

source: Select date (until included)
ru: Выберите дату (включая конец)

source: Last day
ru: Последние сутки

source: Last week
ru: Последние 7 дней

source: Last month
ru: Последние 30 дней

source: Last quarter
ru: Последние 90 дней

source: Last year
ru: Последние 365 дней

source: previous calendar week
ru: предыдущая календарная неделя

source: previous calendar month
ru: предыдущий календарный месяц

source: previous calendar year
ru: предыдущий календарный год

source: Current day
ru: Текущий день

source: Current week
ru: Текущая неделя

source: Current month
ru: Текущий месяц

source: Current quarter
ru: Текущий квартал

source: Current year
ru: Текущий год

source: Seconds %s
ru: Секунд %s

source: Minutes %s
ru: Минут %s

source: Hours %s
ru: Часов %s

source: Days %s
ru: Дней %s

source: Weeks %s
ru: Недель %s

source: Months %s
ru: Месяцев %s

source: Quarters %s
ru: Кварталов %s

source: Years %s
ru: Лет %s

source: Specific Date/Time
ru: Конкретная дата/время

source: Relative Date/Time
ru: Относительная дата/время

source: Now
ru: Сейчас

source: Midnight
ru: Полночь

source: Saved expressions
ru: Сохраненные выражения

source: Saved
ru: Сохранено

source: %s column(s)
ru: Столбцов: %s

source: No temporal columns found
ru: Столбцы формата дата/время не найдены

source: No saved expressions found
ru: Не найдено сохраненных выражений

source: Add calculated temporal columns to dataset in "Edit datasource" modal
ru: Добавьте новые столбцы формата дата/время в датасет в настройках датасета

source: Add calculated columns to dataset in "Edit datasource" modal
ru: Добавьте новые вычисляемые столбцы в датасет в настройках датасета

source: to mark a column as a time column
ru: , чтобы пометить столбец как столбец даты/времени

source: to add calculated columns
ru: для добавления вычисляемых столбцов

source: Simple
ru: Столбец

source: Mark a column as temporal in "Edit datasource" modal
ru: Присвойте столбцу формат даты/времени в настройках датасета

source: Custom SQL
ru: Через SQL

source: My column
ru: Мой столбец

source: This filter might be incompatible with current dataset
ru: Этот фильтр может быть несовместим с этим датасетом

source: This column might be incompatible with current dataset
ru: Этот график может быть несовместим с этим датасетом

source: Drop a column here or click
ru: Отбросьте столбец здесь или нажмите

source: Click to edit label
ru: Нажмите для редактирования метки

source: Drop columns/metrics here or click
ru: Перетащите столбцы/меры сюда

source: This metric might be incompatible with current dataset
ru: Эта мера может быть несовместима с этим датасетом

source: Drop a column/metric here or click
ru: Перетащите столбец/меру сюда

source: This filter was inherited from the dashboard's context. It won't be saved when saving the chart.
ru: Этот фильтр был унаследован от контекста панели. Фильтр был наследован из контекста дашборда. Он не будет сохранен при сохранении графика.

source: %s option(s)
ru: %s вариант(ов)

source: Select subject
ru: Выберите Тема

source: No such column found. To filter on a metric, try the Custom SQL tab.
ru: Такой столбец не найден. Чтобы фильтровать по мере, попробуйте использовать вкладку Свой SQL.

source: To filter on a metric, use Custom SQL tab.
ru: Для фильтрации по мере используйте вкладку Свой SQL.

source: %s operator(s)
ru: %s параметр(ы)

source: Select operator
ru: Выбрать оператор

source: Comparator option
ru: Вариант сравнения

source: Type a value here
ru: Введите значение здесь

source: Filter value (case sensitive)
ru: Фильтровать значения (зависит от регистра)

source: Failed to retrieve advanced type
ru: Не удалось получить расширенный тип

source: choose WHERE or HAVING...
ru: выберите WHERE или HAVING...

source: Filters by columns
ru: Фильтры по столбцам

source: Filters by metrics
ru: Фильтры по мерам

source: Fixed
ru: Фиксированный

source: Based on a metric
ru: На основе меры

source: My metric
ru: Моя мера

source: Add metric
ru: Добавить меру

source: Select saved metrics
ru: Выберите сохраненные меры

source: %s saved metric(s)
ru: Сохраненная мер: %s

source: Saved metric
ru: Сохраненная мера

source: No saved metrics found
ru: Не найдено сохраненных мер

source: Add metrics to dataset in "Edit datasource" modal
ru: Добавьте меры в датасет в настройках датасета

source: to add metrics
ru: для добавления мер

source: Simple ad-hoc metrics are not enabled for this dataset
ru: Простые специальные метрики не включены для этого набора данных

source: column
ru: столбец

source: aggregate
ru: агрегатная функция

source: Custom SQL ad-hoc metrics are not enabled for this dataset
ru: Пользовательские ad-hoc меры SQL не разрешены для этого датасета

source: Error while fetching data: %s
ru: Возникла ошибка при получении данных: %s

source: Time series columns
ru: Столбцы временных рядов

source: Actual value
ru: Фактическое значение

source: Sparkline
ru: Спарклайн

source: Period average
ru: Среднее за период

source: The column header label
ru: Заголовок столбца

source: Column header tooltip
ru: Всплывающая подсказка заголовка столбца

source: Type of comparison, value difference or percentage
ru: Тип сравнения, разница значений или доля

source: Width
ru: Ширина

source: Width of the sparkline
ru: Ширина спарклайна

source: Height of the sparkline
ru: Высота спарклайна

source: Time lag
ru: Временной лаг

source: Number of periods to compare against. You can use negative numbers to compare from the beginning of the time range.
ru: Количество периодов для сравнения с.

source: Time Lag
ru: Временной лаг

source: Time ratio
ru: Соотношение времени

source: Number of periods to ratio against
ru: Количество периодов для сравнения

source: Time Ratio
ru: Соотношение времени

source: Show Y-axis
ru: Показать ось Y

source: Show Y-axis on the sparkline. Will display the manually set min/max if set or min/max values in the data otherwise.
ru: Показывать ось Y на спарклайне.

source: Y-axis bounds
ru: Границы оси Y

source: Manually set min/max values for the y-axis.
ru: Вручную задать мин./макс. значения для оси Y

source: Color bounds
ru: Границы цвета

source: Number bounds used for color encoding from red to blue. Reverse the numbers for blue to red. To get pure red or blue, you can enter either only min or max.
ru: Ограничения чисел, используемые для кодирования цвета от красного до синего. \ N Обратите число чисел для синего до красного.

source: Optional d3 number format string
ru: Формат числовой строки

source: Number format string
ru: Числовой формат

source: Optional d3 date format string
ru: Формат временной строки

source: Date format string
ru: Формат временной строки

source: Column Configuration
ru: Свойства столбца

source: Select Viz Type
ru: Выберите тип визуализации

source: Currently rendered: %s
ru: Сейчас отрисовано: %s

source: Other
ru: Прочее

source: Search all charts
ru: Поиск по всем графикам

source: No description available.
ru: Описание отсутствует.

source: Examples
ru: Примеры

source: This visualization type is not supported.
ru: Этот тип визуализации не поддерживается.

source: View all charts
ru: Показать все графики

source: Select a visualization type
ru: Выберите тип визуализации

source: No results found
ru: Записи не найдены

source: Superset Chart
ru: График Superset

source: New chart
ru: Новый график

source: Edit chart properties
ru: Редактировать свойства графика

source: On dashboards
ru: На дашбордах

source: Export to original .CSV
ru: Экспорт исходных данных в .CSV

source: Export to pivoted .CSV
ru: Экспорт сводной таблицы в .CSV

source: Export to .JSON
ru: Экспорт в .JSON

source: Embed code
ru: Встроенный код

source: Run in SQL Lab
ru: Открыть в SQL редакторе

source: Code
ru: Редактор

source: Markup type
ru: Тип разметки

source: Pick your favorite markup language
ru: Выберите свой любимый язык разметки

source: Put your code here
ru: Введите произвольный текст в формате html или markdown

source: URL parameters
ru: Параметры URL

source: Extra parameters for use in jinja templated queries
ru: Дополнительные параметры для запросов, использующих шаблонизацию Jinja

source: Annotations and layers
ru: Аннотации и слои

source: Annotation layers
ru: Слои аннотаций

source: My beautiful colors
ru: Мои красивые цвета

source: < (Smaller than)
ru: < (меньше чем)

source: > (Larger than)
ru: > (больше чем)

source: <= (Smaller or equal)
ru: <= (меньше или равно)

source: >= (Larger or equal)
ru: >= (больше или равно)

source: == (Is equal)
ru: == (равно)

source: != (Is not equal)
ru: != (не равно)

source: Not null
ru: Не пусто

source: 60 days
ru: 60 дней

source: 90 days
ru: 90 дней

source: Send as PDF
ru: Отправить как PDF

source: Send as PNG
ru: Отправить в формате PNG

source: Send as CSV
ru: Отправить в формате CSV

source: Send as text
ru: Отправить текстом

source: General information
ru: Общая информация

source: Alert condition
ru: Условие оповещения

source: Alert contents
ru: Содержание оповещения

source: Report contents
ru: Содержание отчета

source: Notification method
ru: Способ уведомления

source: owners
ru: владельцы

source: content type
ru: тип содержания

source: database
ru: база данных

source: alert condition
ru: условие оповещения

source: working timeout
ru: работающий таймаут

source: recipients
ru: получатели

source: email subject
ru: тема письма

source: invalid email
ru: неверный адрес электронной почты

source: Not all required fields are complete. Please provide the following:
ru: Не все обязательные поля заполнены. Пожалуйста, укажите следующее:

source: Add another notification method
ru: Добавить другой способ уведомления

source: Add delivery method
ru: Добавить способ оповещения

source: report
ru: рассылка

source: %s updated
ru: Обновлено: %s

source: Edit Report
ru: Редактировать отчет

source: Edit Alert
ru: Редактировать оповещение

source: Add Report
ru: Добавить рассылку

source: Add Alert
ru: Добавить оповещение

source: Add
ru: Добавить

source: Set up basic details, such as name and description.
ru: Настройте основные сведения, такие как название и описание.

source: Report name
ru: Имя отчета

source: Alert name
ru: Имя оповещения

source: Enter report name
ru: Введите название отчета

source: Enter alert name
ru: Введите название оповещения

source: Include description to be sent with %s
ru: Включите описание, которое будет отправлено с %s

source: Report is active
ru: Отчет активен

source: Alert is active
ru: Оповещение активно

source: Define the database, SQL query, and triggering conditions for alert.
ru: Определите базу данных, SQL-запрос и условия срабатывания оповещения.

source: Select database
ru: Выберите базу данных

source: SQL Query
ru: SQL запрос

source: The result of this query must be a value capable of numeric interpretation e.g. 1, 1.0, or "1" (compatible with Python's float() function).
ru: Результат этого запроса должен быть значением, способным к численной интерпретации, например,

source: Trigger Alert If...
ru: Оповестить, если...
